 
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ОбновлениеЗаголовкаАналогов();

КонецПроцедуры  

&НаСервере
Процедура ОбновлениеЗаголовкаАналогов() 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РСК_АналогиИЗамены.ПриемникНоменклатура КАК ПриемникНоменклатура,
		|	РСК_АналогиИЗамены.ПриемникХарактеристика КАК ПриемникХарактеристика,
		|	РСК_АналогиИЗамены.ПриемникСерия КАК ПриемникСерия
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
		|ГДЕ
		|	РСК_АналогиИЗамены.ИсточникНоменклатура = &Номенклатура
		|	И РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РСК_АналогиИЗамены.ИсточникНоменклатура,
		|	РСК_АналогиИЗамены.ИсточникХарактеристика,
		|	РСК_АналогиИЗамены.ИсточникСерия
		|ИЗ
		|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
		|ГДЕ
		|	РСК_АналогиИЗамены.ПриемникНоменклатура = &Номенклатура
		|	И РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РСК_АналогиИЗамены1.ИсточникНоменклатура КАК ИсточникНоменклатура,
		|	РСК_АналогиИЗамены1.ИсточникХарактеристика КАК ИсточникХарактеристика,
		|	РСК_АналогиИЗамены1.ИсточникСерия КАК ИсточникСерия
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены1
		|		ПО РСК_АналогиИЗамены.ПриемникНоменклатура = РСК_АналогиИЗамены1.ПриемникНоменклатура
		|			И РСК_АналогиИЗамены.ПриемникХарактеристика = РСК_АналогиИЗамены1.ПриемникХарактеристика
		|			И РСК_АналогиИЗамены.ПриемникСерия = РСК_АналогиИЗамены1.ПриемникСерия 
		|			И РСК_АналогиИЗамены.ВидСвязи = РСК_АналогиИЗамены1.ВидСвязи
		|ГДЕ
		|	РСК_АналогиИЗамены.ИсточникНоменклатура = &Номенклатура
		|	И РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
		|	И НЕ (РСК_АналогиИЗамены1.ИсточникНоменклатура, РСК_АналогиИЗамены1.ИсточникХарактеристика, РСК_АналогиИЗамены1.ИсточникСерия) В
		|				(ВЫБРАТЬ
		|					ВТ.ПриемникНоменклатура,
		|					ВТ.ПриемникХарактеристика,
		|					ВТ.ПриемникСерия
		|				ИЗ
		|					ВТ КАК ВТ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ.ПриемникНоменклатура,
		|	ВТ.ПриемникХарактеристика,
		|	ВТ.ПриемникСерия
		|ИЗ
		|	ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ2.ИсточникНоменклатура КАК ИсточникНоменклатура,
		|	ВТ2.ИсточникХарактеристика КАК ИсточникХарактеристика,
		|	ВТ2.ИсточникСерия КАК ИсточникСерия
		|ИЗ
		|	ВТ2 КАК ВТ2";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	ВДЗ = Запрос.Выполнить().Выбрать();
	
	Если ВДЗ.Количество() > 1 Тогда 
		
		Элементы.ГиперссылкаПерейтиАналоги.Заголовок = "Аналоги (" + Строка(ВДЗ.Количество() - 1) + ")"; 
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура САВ_ПриОткрытииПосле(Отказ)
	//Вставить содержимое обработчика 
	РезультатЗапроса();
	//Закладка = ЭтаФорма.ХарактеристикиИзделия.ПолучитьЭлементы();
	//Если Закладка.Количество()>0 Тогда
	//	ЭтаФорма.Элементы.СтраницаХарактеристикиИзделия.Видимость=Истина;
	//Иначе                                                                
	//	ЭтаФорма.Элементы.СтраницаХарактеристикиИзделия.Видимость=Ложь;
	//КонецЕсли;
	//
		
КонецПроцедуры 


&НаСервере
Процедура РезультатЗапроса() 
	Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
			|				Хар.НомерПараметра,
			|				Хар.Родитель,
			|				Хар.Ссылка, 
			|				РегХар.ВладелецПараметра,
			|				Хар.Ссылка КАК Наименование,
			|				Хар.Характеристика,
			|				РегХар.ЗначениеПоУмолчанию
			|			ИЗ
			|				Справочник.САВ_ВидыСвойствНоменклатуры   КАК Хар    
			|			Левое Соединение  РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК РегХар
			|			ПО
			|			Хар.Ссылка=РегХар.СвойствоПараметра.Ссылка
			|			ГДЕ
			|				   РегХар.ВладелецПараметра=&Номенклатура
			|				УПОРЯДОЧИТЬ ПО
			|					Хар.Родитель.Код,
			|				    Хар.Ссылка.Код
			|ИТОГИ ПО
			|    Хар.Родитель ИЕРАРХИЯ
			|АВТОУПОРЯДОЧИВАНИЕ"; 


			Запрос.УстановитьПараметр("Номенклатура",Объект.Ссылка);
Результат = Запрос.Выполнить(); 
Дерево_ = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);       
ЗначениеВРеквизитФормы(Дерево_, "ХарактеристикиИзделия");

	
КонецПроцедуры

&НаКлиенте
Процедура САВ_ЗагрузитьДругиеПараметрыПосле(Команда) 
		 СтандартнаяОбработка=ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Excel (*.xlsx)|*.xlsx"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "D:\";
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;

	




	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
				
	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	
	// Перебираем все листы
	    ТекГр="";
		ТекГрНаим=""; 
		Груп="";
		Лист = ЭксельКнига.Sheets(1);
		КоличествоСтрок = 350;//Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = 3;//Лист.Cells(1, 1).SpecialCells(11).Column;
 
 
 Номенкл=ТекущийОбъект();
 
	ОчиститьРегистр(Номенкл); 		
		// Перебираем строки
		Для НомерСтроки = 18 По КоличествоСтрок Цикл  
			Попытка
				Груп=Лист.Cells(НомерСтроки, 1).Value;
			Исключение
				Груп="";
			КонецПопытки;
			
			Если Груп=Неопределено Тогда
				ТекГрНаим=СокрЛП(Строка(Лист.Cells(НомерСтроки, 2).Value)); 
				СоздатьГруппу(ТекГрНаим);
				
			Иначе
					ТекНом=Лист.Cells(НомерСтроки, 1).Value;
				Попытка
					ТекПар=Лист.Cells(НомерСтроки, 2).Value;
				Исключение
					ТекПар="";
				КонецПопытки;
			    Попытка
					ТекЗнач=Лист.Cells(НомерСтроки, 3).Value;
				Исключение
					ТекЗнач="";
				КонецПопытки;   
				////Если НЕ ЭтотОбъект.Номенклатура.Пустая() Тогда
				////	Номенкл=ЭтотОбъект.Номенклатура;
				////КонецЕсли;

				////Если НЕ ЭтотОбъект.Характеристика.Пустая() Тогда
				////	Номенкл=ЭтотОбъект.Характеристика;
				////КонецЕсли;

				////Если НЕ ЭтотОбъект.Серия.Пустая() Тогда
				////	Номенкл=ЭтотОбъект.Серия;
				////КонецЕсли;

				
				СоздатьЭлемент(ТекГрНаим,ТекПар,ТекЗнач,Номенкл,ТекНом);
				
				
			КонецЕсли;
			
			КонецЦикла;
			

		
	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
    РезультатЗапроса();
	
КонецПроцедуры

&НаСервере
Функция ТекущийОбъект()
	Возврат Объект.Ссылка;
КонецФункции



Функция СоздатьГруппу(НаимГр) 
	ТекГр=""; 
	Запрос=Новый Запрос;
	Запрос.Текст="Выбрать
		| Ссылка
		|ИЗ
		|	Справочник.САВ_ВидыСвойствНоменклатуры КАК ВС
		|ГДЕ
		|	ВС.Наименование=&Наименование
		|И
		| 	ВС.ЭтоГруппа=Истина";
	Запрос.УстановитьПараметр("Наименование",НаимГр);
	Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Количество()=0 Тогда
		ТекГр=Справочники.САВ_ВидыСвойствНоменклатуры.СоздатьГруппу();
		ТекГр.Наименование=НаимГр;
		ТекГр.Записать(); 
	КонецЕсли;
	
	Возврат НаимГр;
КонецФункции   

Процедура ОчиститьРегистр(номен)
		НаборЗаписей = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВладелецПараметра.Установить(Номен);
	НаборЗаписей.Записать(); 
КонецПроцедуры

Процедура СоздатьЭлемент(ТекГрНаим,ТекПар,ТекЗнач, Номен, ТекНом) 
	ПВХ="";
	Запрос=Новый Запрос;
	Запрос.Текст="Выбрать
		| Ссылка
		|ИЗ
		|	Справочник.САВ_ВидыСвойствНоменклатуры КАК ВС
		|ГДЕ
		|	ВС.Наименование=&Наименование
		|И
		| 	ВС.ЭтоГруппа=Ложь";
	Запрос.УстановитьПараметр("Наименование",ТекПар);
	Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Количество()=0 Тогда  
		Сообщить(ТекПар);
		ТекЭл=Справочники.САВ_ВидыСвойствНоменклатуры.СоздатьЭлемент();
		ТекЭл.Наименование=ТекПар;  
		ТекЭл.НомерПараметра=ТекНом;
		ТекЭл.Родитель=Справочники.САВ_ВидыСвойствНоменклатуры.НайтиПоНаименованию(ТекГрНаим).Ссылка;
		Если ПВХ=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ТекПар) Тогда
			ТекЭл.Характеристика=ПВХ; 
		Иначе 
 КЧ = Новый КвалификаторыСтроки(100);
 Массив = Новый Массив;
 Массив.Очистить();
 Массив.Добавить(Тип("СправочникСсылка.ЗначенияСвойствОбъектов"));
 ТЧ=Новый ОписаниеТипов(Массив,КЧ);
 НовЭл=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
 НовЭл.Наименование=ТекПар;
 //НовЭл.НазначениеСвойства = Справочники.Номенклатура;
 НовЭл.ТипЗначения = ТЧ; 
 НовЭл.Заголовок=ТекПар;
 НовЭл.Записать();

 ТекЭл.Характеристика=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ТекПар);
			
			
			
		КонецЕсли;
 ТекЭл.Записать();
Иначе
 	Если Результат.Следующий() Тогда
 		ТекЭл=Результат.Ссылка; 
	Иначе
		Сообщить("Системная ошибка загрузки. Обратитесь к администратору 1С!"); 
		Возврат;
	КонецЕсли;
	
КонецЕсли;	

//Создание записи регистра
 
	
 	НаборЗаписей = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьМенеджерЗаписи(); 
 	НаборЗаписей.ВладелецПараметра=Номен;
	НаборЗаписей.СвойствоПараметра=Справочники.САВ_ВидыСвойствНоменклатуры.НайтиПоНаименованию(ТекПар); 
	
	ЗСО=Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ТекЗнач,Ложь,,ТекЭл.Характеристика);  
	Запрос1 =Новый Запрос;
	Запрос1.Текст="ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|  	Справочник.ЗначенияСвойствОбъектов КАК ЗСО
		|ГДЕ
		|	ЗСО.Владелец=&ТекЭл
		|И
		|	ЗСО.Наименование ПОДОБНО &ТекЗнач";
	Запрос1.УстановитьПараметр("текЭл",ТекЭл.Характеристика);
	Запрос1.УстановитьПараметр("ТекЗнач","%"+ТекЗнач+"%");
	Рез=Запрос1.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		ЗСО=Рез.Ссылка;
	Иначе
		
	
	Запрос2=Новый Запрос; 
	Запрос2.Текст="ВЫБРАТЬ
		|	*
		|ИЗ
		|  	Справочник.ЗначенияСвойствОбъектов КАК ЗСО
		|ГДЕ
		|	ЗСО.Владелец=&ТекЭл";
	Запрос2.УстановитьПараметр("ТекЭл",ТекЭл.Характеристика);
	Результат=Запрос2.Выполнить().Выбрать();
	НомерЗн=Результат.Количество();
		ЗСО=Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
		ЗСО.Наименование= Строка(НомерЗн+1)+". "+ТекЗнач;
		ЗСО.Владелец=ТекЭл.Характеристика;  
		ЗСО.Записать();
	КонецЕсли;
	
	
	НаборЗаписей.ЗначениеПоУмолчанию=ЗСО;
	НаборЗаписей.Записать();



//************************
	
	
		

	КонецПроцедуры
	
	

&НаКлиенте
Процедура САВ_ХарактеристикиИзделияЗначениеПоУмолчаниюПриИзмененииПосле(Элемент)
	//Сообщить(ЭтотОбъект.Элементы.ХарактеристикиИзделия.ТекущиеДанные.Наименование+", "+Элемент.ТекстРедактирования); 
	ПереписатьПараметр(ЭтотОбъект.Элементы.ХарактеристикиИзделия.ТекущиеДанные.Наименование,ЭтотОбъект.Элементы.ХарактеристикиИзделия.ТекущиеДанные.НомерПараметра,Элемент.ТекстРедактирования);
КонецПроцедуры   
&НаСервере
Процедура ПереписатьПараметр(Параметр,НомерПараметра,НовоеЗначениеПараметра) 
	 Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ХН.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
    |ИЗ
    |    РегистрСведений.САВ_ХарактеристикиНоменклатуры КАК ХН
    |ГДЕ
    |    ХН.ВладелецПараметра = &ВладелецПараметра И
    |    ХН.СвойствоПараметра = &СвойствоПараметра";
    
    Запрос.УстановитьПараметр("ВладелецПараметра", Объект.Ссылка);
    Запрос.УстановитьПараметр("СвойствоПараметра", Параметр);

    Выборка = Запрос.Выполнить().Выбрать();
    Если НЕ Выборка.Следующий() Тогда
        ТекЗапись = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьМенеджерЗаписи();
        ТекЗапись.ВладелецПараметра = Объект.Ссылка;
        ТекЗапись.СвойствоПараметра = Параметр;  
		ТекЗапись.ЗначениеПоУмолчанию=Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(НовоеЗначениеПараметра,Истина,,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(Параметр));
        Попытка        
            ТекЗапись.Записать();
        Исключение
        КонецПопытки;
    Иначе
        ТекЗапись = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьМенеджерЗаписи();
        ТекЗапись.ВладелецПараметра = Объект.Ссылка;
        ТекЗапись.СвойствоПараметра = Параметр;
		
		ТекЗапись.Прочитать();
        
        ТекЗапись.ЗначениеПоУмолчанию  = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(НовоеЗначениеПараметра,Истина,,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(Параметр));
        //Попытка
            ТекЗапись.Записать();
        //Исключение
        //КонецПопытки;

    КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура САВ_ХарактеристикиИзделияЗначениеПоУмолчаниюНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ЗначениеОтбора = Новый Структура("Владелец",ТекСпр(Элементы.ХарактеристикиИзделия.ТекущиеДанные.Наименование));
	ПараметрыВыбора1 = Новый Структура("Отбор", ЗначениеОтбора, Истина);
	ПараметрыВыбора1.Вставить("РежимВыбора",Истина);
	
	ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.Форма.ФормаСписка",ПараметрыВыбора1,Элемент);

КонецПроцедуры


&НаСервере
Функция ТекСпр(НаименованиеОбъекта)
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(НаименованиеОбъекта.Наименование);
КонецФункции

&НаКлиенте
Процедура РСК_ГиперссылкаПерейтиШтрихкодыСерийНоменклатурыОбработкаНавигационнойСсылкиВместо(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	СтандартнаяОбработка = Ложь;
	ГиперссылкаПерейтиСформироватьПараметрыИВопрос(Элемент.Имя, НавигационнаяСсылкаФорматированнойСтроки)
    //++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&Вместо("ИмяЭлементаПереходаКСвязанномуСписку")
Функция РСК_ИмяЭлементаПереходаКСвязанномуСписку(Элементы, ИмяЭлемента, ИмяГиперссылки)
	
	НовоеИмя = ПродолжитьВызов(Элементы, ИмяЭлемента, ИмяГиперссылки); 

	//++ РС Консалт: Минаков А.С. Задача 20226
	Если ИмяГиперссылки Тогда
		Если ИмяЭлемента = Элементы.ГиперссылкаПерейтиШтрихкодыСерийНоменклатуры.Имя Тогда
			НовоеИмя = Элементы.КомандаПерейтиШтрихкодыСерийНоменклатуры.Имя
		КонецЕсли
	Иначе
		Если ИмяЭлемента = Элементы.КомандаПерейтиШтрихкодыСерийНоменклатуры.Имя Тогда
			НовоеИмя = Элементы.ГиперссылкаПерейтиШтрихкодыСерийНоменклатуры.Имя
		КонецЕсли
	КонецЕсли;
	//++ РС Консалт: Минаков А.С. Задача 20226

	Возврат НовоеИмя
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
&Вместо("ЭлементПереходаКСвязанномуСписку")
Функция РСК_ЭлементПереходаКСвязанномуСписку(Элементы, ИмяЭлемента)
	
	ЭлементПереходаКСвязанномуСписку = ПродолжитьВызов(Элементы, ИмяЭлемента);
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	Если ИмяЭлемента = Элементы.ГиперссылкаПерейтиШтрихкодыСерийНоменклатуры.Имя Тогда
		
		ЭлементПереходаКСвязанномуСписку = Истина
		
	КонецЕсли;
	//++ РС Консалт: Минаков А.С. Задача 20226
	
	Возврат ЭлементПереходаКСвязанномуСписку
	
КонецФункции

&НаКлиенте
&Вместо("ПараметрыПереходаПоГиперссылке")
Функция РСК_ПараметрыПереходаПоГиперссылке(ИмяЭлемента, Гиперссылка)
	
	ПараметрыПереходаПоГиперссылке = ПродолжитьВызов(ИмяЭлемента, Гиперссылка);
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	Если ИмяЭлемента = "ГиперссылкаПерейтиШтрихкодыСерийНоменклатуры" Тогда
		
		ПараметрыФормы = Новый Структура("Номенклатура", Объект.Ссылка);
		
		ПараметрыПереходаПоГиперссылке.ИмяФормы       = "РегистрСведений.ДСТ_ШтрихкодыСерий.ФормаСписка";
		ПараметрыПереходаПоГиперссылке.ПараметрыФормы = ПараметрыФормы
		
	КонецЕсли;
	//++ РС Консалт: Минаков А.С. Задача 20226
	
	Возврат ПараметрыПереходаПоГиперссылке 

КонецФункции

&НаКлиенте
Процедура РСК_ГиперссылкаПерейтиАналогиНажатиеПосле(Элемент)
	
	ОткрытьФорму("Обработка.РСК_ВводАналоговИЗамен.Форма.Форма", Новый Структура("Номенклатура", Объект.Ссылка), ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПараметр(Параметр) 
	 
		ТекЗапись = РегистрыСведений.САВ_ХарактеристикиНоменклатуры.СоздатьНаборЗаписей();
		ТекЗапись.Отбор.ВладелецПараметра.Установить(Объект.Ссылка); 
		ТекЗапись.Отбор.СвойствоПараметра.Установить(Параметр); 
		
		ТекЗапись.Записать();
	
КонецПроцедуры



&НаКлиенте
Процедура РСК_ХарактеристикиИзделияПередУдалениемПосле(Элемент, Отказ)
		УдалитьПараметр(Элемент.ТекущиеДанные.Наименование);

КонецПроцедуры




