
&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура РСК_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	#Удаление
	Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика
		#КонецУдаления
		#Вставка
	//++ РС Консалт: Минаков А.С. Задача 22756
		Если (СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика 
			Или СпособДоставки = Перечисления.СпособыДоставки.РСК_ПеревозчикДоКлиента
			Или СпособДоставки = Перечисления.СпособыДоставки.РСК_ПеревозчикДоПВЗ)	
		#КонецВставки
		И СпособДоставкиОбъект = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		ТекущийОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу;
	Иначе
		ТекущийОбъект.СпособДоставки = СпособДоставки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриЧтенииСозданииНаСервере")
Процедура РСК_ПриЧтенииСозданииНаСервере()

	ИспользоватьУправлениеДоставкой   = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой");
	ИспользоватьГрафикиОплаты         = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты");
	ИспользоватьУпрощеннуюСхемуОплаты = ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВПродажах");

	Если ИспользоватьУправлениеДоставкой Тогда

		СтруктураРеквизитовДоставкиДоИзмененияВФорме = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки();
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовДоставкиДоИзмененияВФорме,Объект);

		Если Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
			// При доставке до перевозчика менеджер указывает время доставки до перевозчика
			Элементы.ВремяДоставкиС.Видимость  = Ложь;
			Элементы.ВремяДоставкиПо.Видимость = Ложь;
			СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
			#Удаление
		ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика Тогда
			#КонецУдаления
			#Вставка
	//++ РС Консалт: Минаков А.С. Задача 22756
		ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика 
			Или Объект.СпособДоставки = Перечисления.СпособыДоставки.РСК_ПеревозчикДоКлиента
			Или Объект.СпособДоставки = Перечисления.СпособыДоставки.РСК_ПеревозчикДоПВЗ Тогда	
			#КонецВставки
			СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
		Иначе
			СпособДоставки = Объект.СпособДоставки;
		КонецЕсли;

		РеквизитыДоставки = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки();
		РеквизитыДоставки.Вставить("Партнер", Объект.Партнер);
		РеквизитыДоставки.Вставить("Ссылка",  Объект.Ссылка);
		ЗаполнитьЗначенияСвойств(РеквизитыДоставки, Объект);
		РеквизитыДоставки.СпособДоставки = СпособДоставки;

		ДоставкаТоваров.ПриЧтенииСозданииРаспоряженийНаСервере(Элементы, РеквизитыДоставки);
		ЗаполнитьЗначенияСвойств(Объект, РеквизитыДоставки);

	Иначе
		Элементы.СтраницаДоставка.Видимость = Ложь;
	КонецЕсли;

	НаборыСервер.ЗаполнитьСлужебныеРеквизиты(ЭтаФорма);

	УправлениеЭлементамиЗаписи();
	ВариантОбеспеченияИФлагОбособленно = ПродажиСервер.ВариантОбеспеченияИФлагОбособленноПоУмолчанию(
	Объект.Соглашение,
	Объект.Статус);

КонецПроцедуры
