//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Партнер", Партнер);
	тзТелефоны = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыТелефонов);
	Список.Загрузить(тзТелефоны);
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
&НаКлиенте
Процедура Применить(Команда)
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("АдресТаблицыТелефонов", ПолучитьАдресТаблицыТелефонов());
	Закрыть(СтруктураОтвета);
КонецПроцедуры

// Получает адрес временного хранилища таблыцы телефонов
//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
&НаСервере
Функция ПолучитьАдресТаблицыТелефонов()

	тзТелефоны = Список.Выгрузить(Новый Структура("ДляСМС", Истина));
	Возврат ПоместитьВоВременноеХранилище(тзТелефоны, УникальныйИдентификатор);

КонецФункции // ПолучитьАдресТаблиыТелефонов()

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	//++ РС Консалт: Трофимов Евгений 17.11.2022 Тикет 21931
	//e1cib/data/Документ.Задание?ref=b2c4a495b7eb77d044112200679ed904
	Парам = Новый Структура;
	Парам.Вставить("Партнер", Партнер);
	ОткрытьФорму(
		"РегистрСведений.РСК_СообщенияСМС.Форма.ФормаГрупповойОтправкиСМССообщений",
		Парам,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	//-- КонецТикета 21931	
КонецПроцедуры
