
&НаСервере
Процедура РСК_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	//++ РС Консалт: Трофимов Евгений 11.12.2022 Задача 22454
	//e1cib/data/Документ.Задание?ref=b14c6ffbdbd828834649b3741d796378
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РСК_ПартияПоставкиКонтейнеры.Ссылка КАК ПартияПоставки,
		|	РСК_ПартияПоставкиКонтейнеры.ДатаПоступленияНаСклад КАК ДатаПоступленияНаСклад
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РСК_ПартияПоставки.Товары КАК РСК_ПартияПоставкиТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РСК_ПартияПоставки.Контейнеры КАК РСК_ПартияПоставкиКонтейнеры
		|			ПО РСК_ПартияПоставкиТовары.Ссылка = РСК_ПартияПоставкиКонтейнеры.Ссылка
		|				И РСК_ПартияПоставкиТовары.НомерКонтейнера = РСК_ПартияПоставкиКонтейнеры.НомерКонтейнера
		|		ПО ПриобретениеТоваровУслугТовары.ЗаказПоставщику = РСК_ПартияПоставкиТовары.ЗаказПоставщику
		|			И ПриобретениеТоваровУслугТовары.КодСтроки = РСК_ПартияПоставкиТовары.КодСтроки
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
		|	И РСК_ПартияПоставкиКонтейнеры.ДокументПриобретения = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ДатаПоступления = Выборка.ДатаПоступленияНаСклад;
		Элементы.ДатаПоступления.ТолькоПросмотр = Истина;
	КонецЕсли;
	//-- КонецЗадачи 22454	
КонецПроцедуры
