// Объём упаковки
//
// Параметры:
//  Номенклатура	 - СправочникСсылка.Номенклатура - 
//  Характеристика	 - СправочникСсылка.ХарактеристикиНоменклатуры - 
//  Серия			 - СправочникСсылка.СерииНоменклатуры - 
//  Упаковка		 - СправочникСсылка.УпаковкиЕдиницыИзмерения - 
// 
// Возвращаемое значение:
//   - Число - Объём упаковки, м.куб
//
Функция Объём(Номенклатура, Характеристика, Серия, Упаковка) Экспорт

	ВГХ = РСК_ВызовСервера.ПолучитьВГХСтруктуру(Номенклатура, Характеристика, Серия);
    ОбъёмПоХарактеристикам = ВГХ.ДлинаУпаковки * ВГХ.ВысотаУпаковки * ВГХ.ШиринаУпаковки / 1000000000;
	Если ОбъёмПоХарактеристикам = 0 Тогда
		ТаблицаУпаковок = Новый ТаблицаЗначений;
		ТаблицаУпаковок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаУпаковок.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ТаблицаУпаковок.Колонки.Добавить("КоличествоУпаковок", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		НС = ТаблицаУпаковок.Добавить();
		НС.Номенклатура = Номенклатура;
		НС.Упаковка = Упаковка;
		НС.КоличествоУпаковок = 1;
		ВГХ = РСК_ВызовСервера.ПолучитьВГХпоДаннымУпаковкиИзТаблицы(ТаблицаУпаковок);
		Если ВГХ.Количество() Тогда
			Возврат ВГХ[0].Объем;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбъёмПоХарактеристикам;
	
КонецФункции
