
&ИзменениеИКонтроль("ПередЗаписью")
Процедура РСК_ПередЗаписью(Отказ, Замещение)

	// ERP Начало
	//++ Локализация
	//++ НЕ УТ
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	//-- НЕ УТ
	//-- Локализация

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// ERP конец

	Для Каждого Запись Из ЭтотОбъект Цикл
		#Удаление
		Запись.Представление = РегистрыСведений.ДокументыФизическихЛиц.ПредставлениеЗаписи(Запись);
		#КонецУдаления
		#Вставка
		Если ПустаяСтрока(Запись.Представление) Тогда
			Запись.Представление = РегистрыСведений.ДокументыФизическихЛиц.ПредставлениеЗаписи(Запись);
		КонецЕсли;
		#КонецВставки
	КонецЦикла;

КонецПроцедуры
