
&ИзменениеИКонтроль("СформироватьДокументыПоРаспоряжениям")
Функция РСК_СформироватьДокументыПоРаспоряжениям(ГруппировкиРаспоряжений, СписокОшибок, ПолеОшибки)

	СозданныеДокументы = Новый Массив;

	Для каждого Группировка Из ГруппировкиРаспоряжений Цикл

		Если Группировка.Свойство("Обработчик") И ЗначениеЗаполнено(Группировка.Обработчик) Тогда
			МенеджерНакладной = ОбщегоНазначения.ОбщийМодуль(Группировка.Обработчик);
		Иначе
			МенеджерНакладной = Документы[Группировка.ИмяОформляемогоДокумента];
		КонецЕсли;

		Для каждого Распоряжения Из Группировка.МассивЗаказов Цикл

			ДокументОбъект = Документы[Группировка.ИмяОформляемогоДокумента].СоздатьДокумент();

			ПараметрыЗаполнения = МенеджерНакладной.ПараметрыЗаполненияДокумента();
			ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Группировка.ПоляЗаполнения);
			РеквизитыШапки = МенеджерНакладной.ДанныеЗаполненияНакладной(Распоряжения, Группировка.ПоляЗаполнения);
			МенеджерНакладной.ИнициализироватьПараметрыЗаполнения(ПараметрыЗаполнения, РеквизитыШапки, Распоряжения);

			ДокументОбъект.Заполнить(ПараметрыЗаполнения);
			ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ДокументОбъект.Дата), ДокументОбъект.Дата, ТекущаяДатаСеанса());
			#Вставка
			//++ РС Консалт: Минаков А.С. Задача 20226
			Если Группировка.ПоляЗаполнения.Свойство("Дата") Тогда
				ДокументОбъект.Дата = Группировка.ПоляЗаполнения.Дата
			КонецЕсли;
			//++ РС Консалт: Минаков А.С. Задача 20226
			#КонецВставки

			Ошибка = Не ДокументОбъект.ПроверитьЗаполнение();
			Если Не Ошибка Тогда
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Ошибка при проведении документа';
					|en = 'An error occurred while posting the document'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					Ошибка = Истина;
				КонецПопытки;
			КонецЕсли;

			Если Ошибка Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

				Сообщения = ПолучитьСообщенияПользователю(Истина);
				Для Каждого Сообщение Из Сообщения Цикл
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок, ПолеОшибки, Сообщение.Текст, Неопределено);
				КонецЦикла;

				ТекстОшибки = НСтр("ru = 'Не удалось провести документ - %1';
				|en = 'Cannot post the document: %1'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ДокументОбъект.Ссылка);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок, ПолеОшибки, ТекстОшибки, Неопределено);
			КонецЕсли;

			ИсторияРаботыПользователя.Добавить(ДокументОбъект.Ссылка);
			СозданныеДокументы.Добавить(ДокументОбъект.Ссылка);

		КонецЦикла;

	КонецЦикла;

	ОбеспечениеВДокументахСервер.ПроверитьЗапуститьФоновоеЗаданиеРаспределенияЗапасов();
	Возврат СозданныеДокументы;

КонецФункции
