
&ИзменениеИКонтроль("ДобавитьПрофильМенеджераПоПроизводствуНаСтороне")
Процедура РСК_ДобавитьПрофильМенеджераПоПроизводствуНаСтороне(ОписанияПрофилей)
	
	// Профиль "Менеджер по производству на стороне".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПроизводствуНаСтороне";
	ОписаниеПрофиля.Идентификатор = "7387da7a-e932-11e2-a832-c86000df10d3";
	ОписаниеПрофиля.Родитель      = "Производство";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по производству на стороне';
										|en = 'Third party production officer'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Базовые права.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТехнологическихПроцессов");
	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	///////////////////////////////////////////////////////////////////////
	// Регистры, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПереданныхПереработчику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюДокументовИмпорта");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	//-- НЕ УТ

	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАналоговМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства2_1");
	//-- Устарело_Производство21

	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Документы, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПервичныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовБронирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовДавальцев2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовДавальцам2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства2_2");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	//-- Устарело_Производство21

	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Документы, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПередачиПереработчику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПослеПоступленияОтПереработчика");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОтПереработчиков");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповТоваровХранителем");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПереработчикам");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПереработчикам2_5");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокПриобретений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОприходованияИзлишковТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОСписанииТоваровУХранителя");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПереработчиков");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПереработчиков2_5");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачСырьяПереработчикам");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПересортицыТоваровУХранителя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорчиТоваровУХранителя");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийОтПереработчиков");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровОтХранителя");
	#Удаление
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	#КонецУдаления
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭтаповПроизводства2_2");
	//-- НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявленийОВвозеТоваров");
	
	///////////////////////////////////////////////////////////////////////
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПередачиВПереработку2_5");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПроизводстваНаСтороне");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПроизводстваНаСтороне2_5");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЭтаповОплатыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаЗаказыПереработчикам");
	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Видимые подсистемы КИ
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	
	///////////////////////////////////////////////////////////////////////
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров",					"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",						"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",					"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации",			"Предустановленный");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ТипыОснованийАктаОРасхождениях",	"Предустановленный");
	
	// Х.О. документов передачи на ответ. хранение, договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВыкупТоваровПереработчиком");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.КорректировкаОтчетаПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПереработчику2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПересортицаТоваровУПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПорчаТоваровУПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчикаВСтранахЕАЭС2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика");
	
	// Значения доступа по типам оснований актов о расхождениях
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПередачаТоваровПереработчику");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ПоступлениеТоваровОтПереработчика");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ТипыОснованийАктаОРасхождениях", "Перечисление.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтПереработчика");
	
	///////////////////////////////////////////////////////////////////////
	// Дополнительные права.
	
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийЗакупок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахЗакупки");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоПроизводствуНаСтороне(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Описание поставляемого профиля.
	
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем выполняются задачи:
					|1. Оформление заказов переработчикам;
					|2. Отражения поступлений от переработчиков и передач переработчикам;
					|3. Оформление отчетов переработчиков о выполнении услуг по переработке.';
					|en = 'The following tasks are performed under the profile:
					|1. Generation of ""Purchase orders — Subcontracting"".
					|2. Recording of subcontractor receipts and transfers.
					|3. Generation of subcontractor reports on tolling service provision.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьРолиЛокальногоДиспетчера")
Процедура РСК_ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля)
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДиспетчированиеЭтаповПроизводства");
	//-- НЕ УТКА
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекСчетовУчетаПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровПооперационногоПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТехнологическихПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрисоединенныхФайловДокументовРемонты");
	//-- НЕ УТКА
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАналоговМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПооперационногоРасписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоТрудозатраты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства2_1");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБракаВПроизводстве");
	//-- Устарело_Производство21

	//-- НЕ УТКА
	
	// Документы, чтение.
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСторонеБезПросмотра");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПереработчикам2_5БезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовПереработчиков2_5БезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровХранителю");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровОтХранителя");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхКалькуляций");
	//++ Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	//-- Устарело_Переработка24
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовДавальцев2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовДавальцам2_5");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботыРабочихЦентров");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	//-- Устарело_Производство21

	//-- НЕ УТКА
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПричинЗадержекВыполненияЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПричинОтменыПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПараметровПооперационногоПланирования");
	//-- НЕ УТКА
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	//++ Локализация
	//-- Локализация
	#Удаление
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	#КонецУдаления
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДвиженийПродукцииИМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовМатериаловВПроизводство");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовМатериаловИзПроизводства");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокЗаказаМатериаловВПроизводство");
	//-- НЕ УТКА

	//-- Устарело_Производство21
	
	//++ НЕ УТКА
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОпераций2_2");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСменныхЗаданий");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутныхЛистовПроизводства");
	//-- Устарело_Производство21
	
	//-- НЕ УТКА
	
	// Регистры, добавление изменение.

	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафикаЭтаповПроизводства2_2");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасписанияРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПередачиМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПооперационногоРасписания");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоступностиДляРасписанияРаботы");
	//-- НЕ УТКА
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыЛокальногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиИДоступностьТоваров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрФормированияЗаказовПоПланамРаспределениеИПеренос");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиСостояниеОбеспеченияЗаказов");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПолученияМатериаловПоЗаказамНаВнутреннееПотребление");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЗаказовНаПередачуВПроизводствоПоПлану");
	//++ НЕ УТКА
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеПеремещенийПоЗаказамНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполнениеЭтаповПроизводства");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоВыполнениюМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовОЗагрузкеРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполненияОпераций");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполнениеМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеНастроекПередачиМатериаловВПроизводствоПоНоменклатуре");
	//-- Устарело_Производство21

	//-- НЕ УТКА
	
	//++ НЕ УТКА
	ОперативныйУчетПроизводстваПриПланированииСервер.ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("ХозяйственныеОперации", "Предустановленный");
	
	// Х.О. документов передачи на ответ. хранение, договоров контрагентов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПереработчику2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчика2_5");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоУПереработчикаВСтранахЕАЭС2_5");
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья");
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	
	// Х.О. документа ДвижениеПродукцииИМатериалов
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой");
	//++ НЕ УТКА
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство");
	ОписаниеПрофиля.ЗначенияДоступа.Добавить("ХозяйственныеОперации", "Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства");
	//-- НЕ УТКА
	
	УправлениеДоступомЛокализация.ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	
КонецПроцедуры
