
//&После("ОбработкаПолученияПолейПредставления")
//++ РС Консалт: Трофимов Евгений 14.07.2022
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеНоменклатуры");
КонецПроцедуры

//&После("ОбработкаПолученияПредставления")
//++ РС Консалт: Трофимов Евгений 14.07.2022
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ПустаяСтрока(Данные.Наименование) Тогда
		Представление = Данные.НаименованиеНоменклатуры;
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
КонецПроцедуры
