
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.РСК_ОтчетПоВыдачеТСР.Форма.ФормаДокумента" 
		И ПараметрыВыполненияКоманды.Источник.Модифицированность = Истина Тогда
		
		ПоказатьПредупреждение(,"Нужно записать изменения в документе");
		Возврат;
		
	КонецЕсли;

	ФормаРеализации = ПолучитьФорму(
		"Документ.РеализацияТоваровУслуг.ФормаОбъекта",,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	ДанныеФормы = ФормаРеализации.Объект;
	ЗаполнитьФормуНаСервере(ДанныеФормы, ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, ФормаРеализации.Объект);
	ФормаРеализации.ОбновитьВидимостьЭлементовПриЗаполненииНаОсновании();
	ФормаРеализации.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере(ДанныеФормы, ОтчетПоВыдачеТСР)
	УстановитьПривилегированныйРежим(Истина);
	оРеал = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	оРеал.Заполнить(ОтчетПоВыдачеТСР);
	ЗначениеВДанныеФормы(оРеал, ДанныеФормы);
КонецПроцедуры

