
&Вместо("ЗаписатьИзмененияЦенНаСервере")
Функция РСК_ЗаписатьИзмененияЦенНаСервере(Форма, Комментарий, ВариантПримененияЦен)
	РеквизитыНовыхДокументов = Новый Структура;
	РеквизитыНовыхДокументов.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	РеквизитыНовыхДокументов.Вставить("Комментарий", Комментарий);
	РеквизитыНовыхДокументов.Вставить("Статус", Перечисления.СтатусыУстановокЦенНоменклатуры.НеСогласован);
	РеквизитыНовыхДокументов.Вставить("Дата", Форма.Дата);
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма,"УстанавливатьВременныеЦены") Тогда
		УстанавливатьВременныеЦены = Форма.УстанавливатьВременныеЦены;
		РеквизитыНовыхДокументов.Вставить("УстанавливатьВременныеЦены", УстанавливатьВременныеЦены);
		РеквизитыНовыхДокументов.Вставить("ДатаЗавершенияПериодаДействияЦен", Форма.ДатаЗавершенияПериодаДействияЦен);
		СохраненныеДокументыПериодическихЦен = Форма.СохраненныеДокументыПериодическихЦен;
	Иначе
		УстанавливатьВременныеЦены = Неопределено;
	КонецЕсли; 
	
	ИспользуетсяЦенообразование25 = Форма.ИспользуетсяЦенообразование25;
	
	Данные = Новый Структура;
	Данные.Вставить("Форма",                    Форма);
	Данные.Вставить("Документы",                Новый Массив);
	Данные.Вставить("СохранятьБазовые",         Ложь);
	Данные.Вставить("РеквизитыНовыхДокументов", РеквизитыНовыхДокументов);
	Данные.Вставить("ТолькоИзмененные",         Истина);
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "СохраненныеДокументы") Тогда
		СохраненныеДокументы = Форма.СохраненныеДокументы;//ТаблицаЗначений
		Для Каждого СтрокаТЧ Из СохраненныеДокументы Цикл
			ДокументОбъект = СтрокаТЧ.Ссылка.ПолучитьОбъект();
			Данные.Документы.Добавить(ДокументОбъект);
		КонецЦикла;
	КонецЕсли;
	
	УстановкаЦенСервер.ПоместитьЦеныВТабличнуюЧасть(Данные);
	
	МассивДокументы = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		Для Каждого ДокументОбъект Из Данные.Документы Цикл
			ТабличнаяЧастьТовары = ?(ИспользуетсяЦенообразование25, ДокументОбъект.Товары2_5, ДокументОбъект.Товары);
			Если ТабличнаяЧастьТовары.Количество() > 0 Тогда
				
				НомерВПределахДня = УстановкаЦенВызовСервера.РассчитатьНомерВПределахДня(
					Форма.Дата, ДокументОбъект.Ссылка);
				ДокументОбъект.Дата = УстановкаЦенКлиентСервер.РассчитатьДатуДокумента(
					Форма.Дата, НомерВПределахДня);
				
				Статус = Неопределено;
				Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеЦенНоменклатуры")
					Или ПраваПользователяПовтИсп.УстановкаЦенНоменклатурыБезСогласования() Тогда
					Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
				Иначе
					Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.НеСогласован;
				КонецЕсли;
				
				ДокументОбъект.Статус = Статус;
				
				Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма,"УстанавливатьВременныеЦены") Тогда
					ДокументОбъект.МаркетинговоеМероприятие = ?(Форма.УстанавливатьВременныеЦены,Форма.МаркетинговоеМероприятие,Неопределено);
				КонецЕсли;
				
				ДокументОбъект.Записать(?(ВариантПримененияЦен = 0, РежимЗаписиДокумента.Запись,
					РежимЗаписиДокумента.Проведение), РежимПроведенияДокумента.Неоперативный);
				
				СогласованиеЦенНоменклатуры = Неопределено;
				Если ВариантПримененияЦен = 1
					И ДокументОбъект.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.НеСогласован Тогда
					СогласованиеЦенНоменклатурыОбъект = БизнесПроцессы.СогласованиеЦенНоменклатуры.СоздатьБизнесПроцесс();
					СогласованиеЦенНоменклатурыОбъект.Дата = ТекущаяДатаСеанса();
					СогласованиеЦенНоменклатурыОбъект.Заполнить(ДокументОбъект.Ссылка);
					СогласованиеЦенНоменклатурыОбъект.Записать();
					СогласованиеЦенНоменклатурыОбъект.Старт(БизнесПроцессы.СогласованиеЦенНоменклатуры.ТочкиМаршрута.Старт);
					СогласованиеЦенНоменклатуры = СогласованиеЦенНоменклатурыОбъект.Ссылка;
				КонецЕсли;
				
				СтруктураДокументов = Новый Структура;
				СтруктураДокументов.Вставить("УстановкаЦенНоменклатуры", ДокументОбъект.Ссылка);
				СтруктураДокументов.Вставить("СогласованиеЦенНоменклатуры", СогласованиеЦенНоменклатуры);
				МассивДокументы.Добавить(СтруктураДокументов);
				
			Иначе
				ЭтоДокументОкончанияПериода = Ложь;
				Если ТипЗнч(УстанавливатьВременныеЦены) = Тип("Булево") Тогда
					Отбор = Новый Структура("ДокументОкончанияПериодаДействияЦен",ДокументОбъект.Ссылка);
					ЭтоДокументОкончанияПериода = СохраненныеДокументыПериодическихЦен.НайтиСтроки(Отбор).Количество() > 0;
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(ДокументОбъект.Ссылка)
					И НЕ ЭтоДокументОкончанияПериода
					Тогда
					ДокументОбъект.Прочитать();
					ДокументОбъект.Удалить();
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		       
		//Если ТипЗнч(УстанавливатьВременныеЦены) = Тип("Булево") Тогда
		//	ТаблицаОбработкиПериодовЦен = ПолучитьТаблицуОбработкиПериодов(
		//		УстанавливатьВременныеЦены,МассивДокументы,СохраненныеДокументыПериодическихЦен);
		//	НовыеПарыДокументовПериодическихЦен = СохраненныеДокументыПериодическихЦен.Выгрузить();
		//	НовыеПарыДокументовПериодическихЦен.Очистить();
		//	Для каждого СтрокаТЗ Из ТаблицаОбработкиПериодовЦен Цикл
		//		Если СтрокаТЗ.УдалитьКортеж Тогда
		//			Если ЗначениеЗаполнено(СтрокаТЗ.ДокументНачалаПериодаДействияЦенБывший) Тогда
		//				ДокументНаУдаление = СтрокаТЗ.ДокументНачалаПериодаДействияЦенБывший.ПолучитьОбъект();//ДокументОбъект
		//				Если ДокументНаУдаление <> Неопределено Тогда
		//					ДокументНаУдаление.Удалить();
		//				КонецЕсли; 
		//			КонецЕсли; 
		//			Если ЗначениеЗаполнено(СтрокаТЗ.ДокументОкончанияПериодаДействияЦен) Тогда
		//				ДокументНаУдаление = СтрокаТЗ.ДокументОкончанияПериодаДействияЦен.ПолучитьОбъект();//ДокументОбъект
		//				Если ДокументНаУдаление <> Неопределено Тогда
		//					ДокументНаУдаление.Удалить();
		//				КонецЕсли; 
		//			КонецЕсли; 
		//		ИначеЕсли УстанавливатьВременныеЦены Тогда
		//			Если СтрокаТЗ.ДокументОкончанияПериодаСуществует Тогда
		//				ДокументЗавершенияПериодаЦен = СтрокаТЗ.ДокументОкончанияПериодаДействияЦен.ПолучитьОбъект();
		//			Иначе
		//				ДокументЗавершенияПериодаЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		//			КонецЕсли;
		//			Если ИспользуетсяЦенообразование25 Тогда
		//				ЗаполнитьДокументОкончанияАкции25(ДокументЗавершенияПериодаЦен,СтрокаТЗ.ДокументНачалаПериодаДействияЦен,Форма.ДатаЗавершенияПериодаДействияЦен);
		//			Иначе
		//				ЗаполнитьДокументОкончанияАкции(ДокументЗавершенияПериодаЦен,СтрокаТЗ.ДокументНачалаПериодаДействияЦен,Форма.ДатаЗавершенияПериодаДействияЦен);
		//			КонецЕсли;
		//			НомерВПределахДня = УстановкаЦенВызовСервера.РассчитатьНомерВПределахДня(
		//				Форма.ДатаЗавершенияПериодаДействияЦен, ДокументЗавершенияПериодаЦен.Ссылка);
		//			ДокументЗавершенияПериодаЦен.Дата = УстановкаЦенКлиентСервер.РассчитатьДатуДокумента(
		//				Форма.ДатаЗавершенияПериодаДействияЦен, НомерВПределахДня);
		//			ДокументЗавершенияПериодаЦен.Записать(
		//				?(ВариантПримененияЦен = 0, РежимЗаписиДокумента.Запись, РежимЗаписиДокумента.Проведение), 
		//				РежимПроведенияДокумента.Неоперативный);
		//			
		//			СтруктураДокументов = Новый Структура;
		//			СтруктураДокументов.Вставить("УстановкаЦенНоменклатуры", ДокументЗавершенияПериодаЦен.Ссылка);
		//			СтруктураДокументов.Вставить("СогласованиеЦенНоменклатуры", СогласованиеЦенНоменклатуры);
		//			СтруктураДокументов.Вставить("ДокументНачалаПериодаДействияЦен", СтрокаТЗ.ДокументНачалаПериодаДействияЦен);
		//			МассивДокументы.Добавить(СтруктураДокументов);
		//			
		//			СтрокаПары = НовыеПарыДокументовПериодическихЦен.Добавить();
		//			СтрокаПары.ДокументНачалаПериодаДействияЦен = СтрокаТЗ.ДокументНачалаПериодаДействияЦен;
		//			СтрокаПары.ДокументОкончанияПериодаДействияЦен = ДокументЗавершенияПериодаЦен.Ссылка;
		//		Иначе
		//			Если СтрокаТЗ.ДокументОкончанияПериодаСуществует Тогда
		//				ДокументНаУдаление = СтрокаТЗ.ДокументОкончанияПериодаДействияЦен.ПолучитьОбъект();//ДокументОбъект
		//				Если ДокументНаУдаление <> Неопределено Тогда
		//					ДокументНаУдаление.Удалить();
		//				КонецЕсли; 
		//			КонецЕсли;
		//		КонецЕсли; 
		//	КонецЦикла; 
		//КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		//Если ТипЗнч(УстанавливатьВременныеЦены) = Тип("Булево") Тогда
		//	СохраненныеДокументыПериодическихЦен.Очистить();
		//	СохраненныеДокументыПериодическихЦен.Загрузить(НовыеПарыДокументовПериодическихЦен);
		//КонецЕсли;
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = НСтр("ru = 'Ошибка при установке цен.';
								|en = 'An error occurred on pricing.'") + ИнформацияОбОшибке().Описание;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
		
	КонецПопытки;
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "СохраненныеДокументы") Тогда
		СохраненныеДокументы = Форма.СохраненныеДокументы;//ТаблицаЗначений
		
		УстановкаЦенСервер.ОчиститьСохраненныеДокументы(СохраненныеДокументы, Форма.УникальныйИдентификатор);
		
		Для Каждого СтрокаТЧ Из МассивДокументы Цикл
			НоваяСтрока = СохраненныеДокументы.Добавить();
			НоваяСтрока.Ссылка = СтрокаТЧ.УстановкаЦенНоменклатуры;
			ЗаблокироватьДанныеДляРедактирования(СтрокаТЧ.УстановкаЦенНоменклатуры,,Форма.УникальныйИдентификатор);
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Ложь;
	
	Возврат МассивДокументы;

КонецФункции
