// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ОтчетОПоставкеТовараПолучателям";
	//КомандаПечати.Представление = НСтр("ru = 'Отчёт о поставке товаров получателям'");
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "РеестрВыдачиТовара";
	//КомандаПечати.Представление = НСтр("ru = 'Реестр выдачи товара'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетОПоставкеТовараПолучателям") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм,
	//		"ОтчетОПоставкеТовараПолучателям",
	//		НСтр("ru = 'Отчёт о поставке товаров получателям'"),
	//		ПечатнаяФормаОтчетОПоставкеТовараПолучателям(МассивОбъектов, ОбъектыПечати),
	//		,
	//		"Документ.РСК_ОтчетПоВыдачеТСР.ОтчетОПоставкеТовараПолучателям"
	//	);
	//ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрВыдачиТовара") Тогда	
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм,
	//		"РеестрВыдачиТовара",
	//		НСтр("ru = 'Реестр выдачи товара'"),
	//		ПечатнаяФормаРеестрВыдачиТовара(МассивОбъектов, ОбъектыПечати),
	//		,
	//		"Документ.РСК_ОтчетПоВыдачеТСР.РеестрВыдачиТовара"
	//	);
	//КонецЕсли;
		
КонецПроцедуры

Функция ПечатнаяФормаОтчетОПоставкеТовараПолучателям(МассивОбъектов, ОбъектыПечати)
		
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.КлючПараметровПечати = "ОтчетОПоставкеТовараПолучателям";
	//ДопДанные = Новый Структура;
	//
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РСК_ОтчетПоВыдачеТСР.ОтчетОПоставкеТовараПолучателям");
	//
	//ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьСтрокаТСР = Макет.ПолучитьОбласть("СтрокаТСР");
	//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//
	//Запрос = Новый Запрос(ТекстЗапросаПечатнойФормыРеестрВыдачиТовара());
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//ВыборкаСсылка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ПервыйДокумент = Истина;
	//Пока ВыборкаСсылка.Следующий() Цикл
	//	
	//	Если ПервыйДокумент Тогда
	//		ПервыйДокумент = Ложь;
	//	Иначе
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаСсылка);
	//	ОбластьШапка.Параметры.ДатаКонтракта = Формат(ВыборкаСсылка.ДатаКонтракта, "ДФ=dd.MM.yyyy");
	//	
	//	СведенияОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(
	//		ВыборкаСсылка.Организация, 
	//		ВыборкаСсылка.ДатаЗаказа
	//	);
	//	Организация = СведенияОрганизации.ПолноеНаименование;
	//	ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(
	//		ВыборкаСсылка.Организация, 
	//		ВыборкаСсылка.ДатаЗаказа
	//	);
	//	
	//	ПредставительПоставщикаДолжность = нРег(СклонениеПредставленийОбъектов.ПросклонятьПредставление(
	//		ОтветственныеЛица.РуководительДолжностьПредставление, 
	//		2,
	//		ОтветственныеЛица.РуководительДолжность	
	//	));
	//	
	//	Руководитель = СклонениеПредставленийОбъектов.ПросклонятьПредставление(
	//		ОтветственныеЛица.РуководительПредставление,
	//		2,
	//		ОтветственныеЛица.Руководитель
	//	);
	//	
	//	РуководительСокр = РСК_РаботаСоСтроками.ФамилияИИницыалы(Руководитель);
	//	
	//	ДопДанные.Вставить("Поставщик", СведенияОрганизации.ПолноеНаименование);
	//	ДопДанные.Вставить("ПредставительПоставщика", ПредставительПоставщикаДолжность + " " + РуководительСокр);
	//	ДопДанные.Вставить("Основание", "Устава");
	//	ДопДанные.Вставить("Должность", ОтветственныеЛица.РуководительДолжностьПредставление);
	//	ДопДанные.Вставить("Руководитель", ОтветственныеЛица.РуководительПредставление);
	//	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДопДанные);
	//	ТабличныйДокумент.Вывести(ОбластьШапка);
	//	
	//	Выборка = ВыборкаСсылка.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ОбластьСтрокаТСР.Параметры.Заполнить(Выборка);
	//		
	//		ДопДанные.Вставить("АдресПолучателя", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
	//			Выборка.Заявитель,
	//			Справочники.ВидыКонтактнойИнформации.АдресПартнера,
	//			ВыборкаСсылка.ДатаКонтракта
	//		));
	//		
	//		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТСР.Параметры, ДопДанные);
	//		ТабличныйДокумент.Вывести(ОбластьСтрокаТСР);
	//	КонецЦикла;
	//	
	//	ДопДанные.Вставить("ИтКво", ВыборкаСсылка.Количество);
	//	ДопДанные.Вставить("СуммаСтрокой", ЧислоПрописью(
	//		ВыборкаСсылка.Сумма,
	//		"Л = ru_RU; ДП = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"
	//	));
	//	ДопДанные.Вставить("ИтСумма", ВыборкаСсылка.Сумма);
	//	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ДопДанные);
	//	ТабличныйДокумент.Вывести(ОбластьПодвал);
	//	
	//КонецЦикла;
	//
	
	//Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатнаяФормаРеестрВыдачиТовара(МассивОбъектов, ОбъектыПечати)

	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.КлючПараметровПечати = "РеестрВыдачиТовара";
	//ДопДанные = Новый Структура;
	//
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РСК_ОтчетПоВыдачеТСР.РеестрВыдачиТовара");
	//
	//ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьСтрокаТСР = Макет.ПолучитьОбласть("СтрокаТСР");
	//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//
	//Запрос = Новый Запрос(ТекстЗапросаПечатнойФормыРеестрВыдачиТовара());
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//ВыборкаСсылка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ПервыйДокумент = Истина;
	//Пока ВыборкаСсылка.Следующий() Цикл
	//	
	//	Если ПервыйДокумент Тогда
	//		ПервыйДокумент = Ложь;
	//	Иначе
	//		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//	ОбластьШапка.Параметры.ДатаНомерКонтрактаШапка = 
	//		" № "+ВыборкаСсылка.НомерКонтракта + " от "+ Формат(ВыборкаСсылка.ДатаКонтракта, "ДФ=dd.MM.yyyy");
	//	ТабличныйДокумент.Вывести(ОбластьШапка);
	//	
	//	Выборка = ВыборкаСсылка.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		ОбластьСтрокаТСР.Параметры.Заполнить(Выборка);
	//		
	//		ДопДанные.Вставить("АдресПолучателя", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
	//			Выборка.Заявитель,
	//			Справочники.ВидыКонтактнойИнформации.АдресПартнера,
	//			ВыборкаСсылка.ДатаКонтракта
	//		));
	//		
	//		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТСР.Параметры, ДопДанные);
	//		ТабличныйДокумент.Вывести(ОбластьСтрокаТСР);
	//	КонецЦикла;
	//	
	//	ДопДанные.Вставить("ИтКво", ВыборкаСсылка.Количество);
	//	ДопДанные.Вставить("СуммаСтрокой", ЧислоПрописью(
	//		ВыборкаСсылка.Сумма,
	//		"Л = ru_RU; ДП = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"
	//	));
	//	ДопДанные.Вставить("ИтСумма", Формат(ВыборкаСсылка.Сумма, "ЧДЦ=2"));
	//	ДопДанные.Вставить("ФИОПодписанта", ВыборкаСсылка.ФИОПодписанта);
	//	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ДопДанные);
	//	ТабличныйДокумент.Вывести(ОбластьПодвал);
	//	
	//КонецЦикла;
	//
	//Возврат ТабличныйДокумент;

КонецФункции // ПечатнаяФормаРеестрВыдачиТовара()

Функция ТекстЗапросаПечатнойФормыРеестрВыдачиТовара() Экспорт
	Текст = 
		"ВЫБРАТЬ
		|	РСК_ОтчетПоВыдачеТСР.Ссылка КАК Ссылка,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.НомерПоДаннымКлиента КАК НомерКонтракта,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.ДатаПоДаннымКлиента КАК ДатаКонтракта,
		|	РСК_ОтчетПоВыдачеТСРРеестр.НомерСтроки КАК НомерСтроки,
		|	Партнеры.РСК_СНИЛС КАК СНИЛС,
		|	Партнеры.Наименование КАК ФИО,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Заявитель КАК Заявитель,
		|	НоменклатураКонтрагентов.НаименованиеПолное КАК ТСР,
		|	НоменклатураКонтрагентов.НаименованиеНоменклатуры КАК Модель,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Количество КАК Количество,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Цена КАК Цена,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Сумма КАК Сумма,
		|	РСК_ОтчетПоВыдачеТСР.ДатаВыдачи КАК ДатаВыдачи,
		|	ЕСТЬNULL(РСК_ОтчетПоВыдачеТСРРеестр.Акт.ДатаВыполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыполнения,
		|	РСК_ОтчетПоВыдачеТСРРеестр.НомерРеестра КАК НомерРеестра,
		|	РСК_ОтчетПоВыдачеТСРРеестр.ДатаРеестра КАК ДатаРеестра,
		|	РСК_ОтчетПоВыдачеТСРРеестр.НомерНаправления КАК НомерНаправления,
		|	РСК_ОтчетПоВыдачеТСРРеестр.ДатаНаправления КАК ДатаНаправления,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Акт.Номер КАК НомерАкта,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.Дата КАК ДатаЗаказа,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.Организация КАК Организация,
		|	РСК_ОтчетПоВыдачеТСРРеестр.ДовЛицо КАК ДовЛицо,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.РСК_ДокументУЛ, """") КАК ПаспортДовЛица,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.РСК_ФИОПодписанта КАК ФИОПодписанта,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.РСК_ПредставительПоставщикаГК КАК ПредставительПоставщикаГК,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.РСК_ДоверенностьПредставителяГК КАК ДоверенностьПредставителяГК,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(дсНомераФилиалов.Значение, """") КАК СТРОКА(50)) КАК НомерФилиала,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.РСК_ОбъектПоставкиГК КАК ОбъектПоставки,
		|	РСК_ОтчетПоВыдачеТСР.Контракт.РСК_ПоставщикГК КАК ПоставщикГК,
		|	РСК_ОтчетПоВыдачеТСРРеестр.Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Документ.РСК_ОтчетПоВыдачеТСР.Реестр КАК РСК_ОтчетПоВыдачеТСРРеестр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РСК_ОтчетПоВыдачеТСР КАК РСК_ОтчетПоВыдачеТСР
		|		ПО РСК_ОтчетПоВыдачеТСРРеестр.Ссылка = РСК_ОтчетПоВыдачеТСР.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК дсНомераФилиалов
		|			ПО Партнеры.Ссылка = дсНомераФилиалов.Объект
		|				И (дсНомераФилиалов.Свойство = &СвойствоНомерФилиала)
		|		ПО РСК_ОтчетПоВыдачеТСРРеестр.Заявитель = Партнеры.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|		ПО РСК_ОтчетПоВыдачеТСРРеестр.ТСР = НоменклатураКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|		ПО РСК_ОтчетПоВыдачеТСРРеестр.ДовЛицо = КонтактныеЛицаПартнеров.Ссылка
		|ГДЕ
		|	РСК_ОтчетПоВыдачеТСРРеестр.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма)
		|ПО
		|	Ссылка
		|";

	Возврат Текст;
	
КонецФункции // ТекстЗапросаПечатнойФормыРеестрВыдачиТовара()
