#Область Дауншифтинг
//++ РС Консалт: Трофимов Евгений 07.02.2023 Тикет 23694
//e1cib/data/Документ.Задание?ref=85df5f81b1cad03f41a905483c110911
//В релизе 8.3.18 и 8.3.21 это были предопределённые элементы
//В релизе 8.3.20 предопределённые элемены в расширении недопустимы!

Функция ВРаботе() Экспорт

	Возврат ПолучитьСсылку(Новый УникальныйИдентификатор("f9ba55ce-1582-11ed-b597-3cecefa80401"));

КонецФункции

Функция Завершено() Экспорт

	Возврат ПолучитьСсылку(Новый УникальныйИдентификатор("f9ba55cf-1582-11ed-b597-3cecefa80401"));

КонецФункции

Функция ЗавершеноСОшибками() Экспорт

	Возврат ПолучитьСсылку(Новый УникальныйИдентификатор("f9ba55d0-1582-11ed-b597-3cecefa80401"));

КонецФункции

Функция Начало() Экспорт

	Возврат ПолучитьСсылку(Новый УникальныйИдентификатор("f9ba55d1-1582-11ed-b597-3cecefa80401"));

КонецФункции

Функция ТестоваяПриемка() Экспорт

	Возврат ПолучитьСсылку(Новый УникальныйИдентификатор("f9ba55d2-1582-11ed-b597-3cecefa80401"));

КонецФункции

#КонецОбласти