
&ИзменениеИКонтроль("ПолучитьДанныеЗаданияНаОтборРазмещениеТоваров")
Функция РСК_ПолучитьДанныеЗаданияНаОтборРазмещениеТоваров(ПравилаПечати, ИмяДокумента, ТипЗадания, МассивОбъектов)

	ОперацияПоступления			= ТипЗадания = "ЗаданиеНаРазмещение";
	ВидДвижения					= ?(ОперацияПоступления, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	РазделительПакетовЗапроса	= ОбщегоНазначенияУТ.РазделительЗапросовВПакете();
	ИспользуютсяПомещения		= ?(ПравилаПечати.Количество() > 0,
	ЗначениеЗаполнено(ПравилаПечати[0].ИмяПоляПомещение),
	Ложь);

	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗапросаВТДанныхЗадания(ПравилаПечати, ИмяДокумента));
	ТекстыЗапроса.Добавить(ТекстЗапросаВТТоварыДокумента(ПравилаПечати, ИмяДокумента));
	ТекстыЗапроса.Добавить(ТекстЗапросаВТТоварыЗадания(ИмяДокумента));
	ТекстыЗапроса.Добавить(ТекстЗапросаВТТоваровСуммированная());
	ТекстыЗапроса.Добавить(ТекстЗапросаДокументовБезТоваров(ИмяДокумента));
	ТекстыЗапроса.Добавить(ШаблонТекстаЗапросаДанныхЗадания(Ложь));
	ТекстыЗапроса.Добавить(ТекстЗапросаТоварыЗадания(ИспользуютсяПомещения, ОперацияПоступления));
	ТекстыЗапроса.Добавить(ТекстЗапросаУпаковкиЗадания(ИспользуютсяПомещения, ОперацияПоступления));

	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, РазделительПакетовЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДанныеЗадания", "ДанныеЗадания");
	#Вставка
	//++ РС Консалт: Минаков А.С. Задача 20226
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Номенклатура.НаименованиеПолное", "Номенклатура.Наименование");
	//++ РС Консалт: Минаков А.С. Задача 20226
	#КонецВставки

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивОбъектов",			МассивОбъектов);
	Запрос.УстановитьПараметр("ОперацияПоступления",	ОперацияПоступления);
	Запрос.УстановитьПараметр("ВидДвижения",			ВидДвижения);

	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);

	МаксимальныйИндекс = Результат.ВГраница();

	ДанныеЗадания = Новый Структура;
	ДанныеЗадания.Вставить("РезультатПоОшибкам",		Результат[МаксимальныйИндекс - 3]);
	ДанныеЗадания.Вставить("РезультатПоРаспоряжениям",	Неопределено);
	ДанныеЗадания.Вставить("РезультатПоШапке",			Результат[МаксимальныйИндекс - 2]);
	ДанныеЗадания.Вставить("РезультатПоТабличнойЧасти",	Результат[МаксимальныйИндекс - 1]);
	ДанныеЗадания.Вставить("РезультатПоУпаковкам",		Результат[МаксимальныйИндекс]);
	ДанныеЗадания.Вставить("РезультатПоСериям",			Неопределено);

	Возврат ДанныеЗадания;

КонецФункции
