
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВОтчете", 	Перечисления.РСК_СтатусыАктовВыдачи.ВОтчете, Истина, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Выдан", 		Перечисления.РСК_СтатусыАктовВыдачи.Выдан, Истина, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Отгружен", 	Перечисления.РСК_СтатусыАктовВыдачи.Отгружен, Истина, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Подготовлен", Перечисления.РСК_СтатусыАктовВыдачи.Подготовлен, Истина, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Создан", 		Перечисления.РСК_СтатусыАктовВыдачи.Создан, Истина, Истина);
КонецПроцедуры
