//++Конарев Ввод на основании
Функция ДобавитьКомандуСоздатьНаОснованииПриобретениеУслугПрочихАктивов(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПриобретениеУслугПрочихАктивов) Тогда
          КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
          КомандаСоздатьНаОсновании.Обработчик = "РСК_Клиент.СозданиеПриобретениеУслугПрочихАктивов";
          КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ПриобретениеУслугПрочихАктивов);
          КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
     
          Возврат КомандаСоздатьНаОсновании;

     КонецЕсли;

     Возврат Неопределено;	
	
КонецФункции