//++Конарев Ввод на основании
Функция ДобавитьКомандуСоздатьНаОснованииПриобретениеУслугПрочихАктивов(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПриобретениеУслугПрочихАктивов) Тогда
          КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
          КомандаСоздатьНаОсновании.Обработчик = "РСК_Клиент.СозданиеПриобретениеУслугПрочихАктивов";
          КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ПриобретениеУслугПрочихАктивов);
          КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
     
          Возврат КомандаСоздатьНаОсновании;

     КонецЕсли;

     Возврат Неопределено;	
	
 КонецФункции

//++ Конарев Добавление возможности печати сертификатов формата pdf
Процедура ПрисоединитьPDFКТабличномуДокументу(ТабличныйДокумент, Макет, ПрисоединенныйФайл) Экспорт
	
	ВременнаяПапкаДляРазархивирования = КаталогВременныхФайлов() + Новый УникальныйИдентификатор;
	УстановитьПривилегированныйРежим(Истина);
	СоздатьКаталог(ВременнаяПапкаДляРазархивирования); 
	УстановитьПривилегированныйРежим(Ложь);
	ВременныйФайл  = ПолучитьИмяВременногоФайла("pdf");
	ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл);
	ДвоичныеДанные.Записать(ВременныйФайл);  
	
	МассивПутейPNG = ПреобразоватьPdfВPng(ВременныйФайл, ВременнаяПапкаДляРазархивирования, 150); 
	Для Каждого Путь из МассивПутейPNG Цикл 
		
		Область = Макет.ПолучитьОбласть("Изображение");		 
		Рисунок = Область.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
		Рисунок.Высота = 297;
		Рисунок.Ширина = 210;
		
		Рисунок.ГраницаСверху = Ложь;
		Рисунок.ГраницаСнизу = Ложь;
		Рисунок.ГраницаСлева = Ложь;
		Рисунок.ГраницаСправа = Ложь;
		
		Рисунок.РазмерКартинки = РазмерКартинки.АвтоРазмер;
		Рисунок.Картинка = Новый Картинка(Новый ДвоичныеДанные(Путь));
		Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		ТабличныйДокумент.Вывести(Область);	
		
	КонецЦикла;  
	
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	
КонецПроцедуры   

// Запускает ImageMagick с указанными параметрами. В случае ошибки вызывается исключение,
// в остальных случаях возвращается код возврата ImageMagick.
//
// Параметры:
//   Параметры - Строка - параметры запуска ImageMagick.
//   ФайлыКУдалению - Массив - необязательный параметр, временные файлы, требующие удаления.
//   ИмяBatФайла - строка, полный путь + имя  bat файла. Может быть пуст.
//
// Возвращаемое значение:
//   Число - 0 в случае успешного выполнения, 300+ - при завершении с предупреждением.
//     Полный список предупреждений см. в документации к ImageMagick.
//
Функция ЗапуститьImageMagick(Параметры, ФайлыКУдалению, ИмяBatФайла = "") Экспорт
	
	ТипПлатформыСервера = Новый СистемнаяИнформация();
	
	Если (ТипПлатформыСервера = ТипПлатформы.Linux_x86 
		Или ТипПлатформыСервера = ТипПлатформы.Linux_x86_64) Тогда
	
		ИмяBatФайла = "";
		
	КонецЕсли;	
	
	ПолныйПуть = "C:\Program Files\ImageMagick-7.1.0-Q16\magick.exe";
	Если (ТипПлатформыСервера <> ТипПлатформы.Linux_x86 
		И ТипПлатформыСервера <> ТипПлатформы.Linux_x86_64) // в Линукс можно пустой путь
		И Не ЗначениеЗаполнено(ПолныйПуть) Тогда
			
		УдалитьВременныеФайлы(ФайлыКУдалению);
		ВызватьИсключение НСтр("ru = 'В настройках программы не указан полный путь к программе ImageMagick.'");
	КонецЕсли;
	
	Если ПолныйПуть = "convert.exe" Тогда
		УдалитьВременныеФайлы(ФайлыКУдалению);
		ВызватьИсключение НСтр("ru = 'В настройках программы указан полный путь к устаревшей версии ImageMagick (convert.exe).'");
	КонецЕсли;
		
	Если (ТипПлатформыСервера = ТипПлатформы.Linux_x86 
		Или ТипПлатформыСервера = ТипПлатформы.Linux_x86_64) Тогда
		
		Если ПолныйПуть <> "" Тогда
			СтрокаКоманды = СокрЛП(ПолныйПуть) + " " + Параметры;
		Иначе	
			СтрокаКоманды = Параметры;
		КонецЕсли;

	Иначе	
		СтрокаКоманды = """" + СокрЛП(ПолныйПуть) + """ " + Параметры;
	КонецЕсли;
	
	СтрокаЗапуска = СтрокаКоманды;
	Если ИмяBatФайла <> "" Тогда
		ЗаписьТекста = Новый ЗаписьТекста(ИмяBatФайла, "cp866");
		ЗаписьТекста.Записать(СтрокаКоманды);
		ЗаписьТекста.Закрыть();
		ФайлыКУдалению.Добавить(ИмяBatФайла);
		СтрокаЗапуска = ИмяBatФайла;
	КонецЕсли;	
	
	КодВозврата = Неопределено;
	Попытка
		ЗапуститьПриложение(СтрокаЗапуска,,Истина,КодВозврата);
	Исключение
		УдалитьВременныеФайлы(ФайлыКУдалению);
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Ошибка при вызове ImageMagick с командной строкой:
			|%1
			|(%2)'"),
			СтрокаКоманды,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
	УдалитьВременныеФайлы(ФайлыКУдалению);
	
	// Успех.
	Если КодВозврата = 0 Тогда
		Возврат КодВозврата;
	КонецЕсли;
	
	// Не ImageMagick.
	Если КодВозврата = Неопределено Тогда
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Нет кода возврата при вызове ImageMagick с командной строкой:
			|%1
			|Возможно, указанный путь не является путем к ImageMagick.'"),
			СтрокаКоманды);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Предупреждение.
	Если КодВозврата >= 300 
		И КодВозврата < 400 Тогда
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Предупреждение %1 при вызове ImageMagick с командной строкой:
			|%2
			|Подробности см. в документации к ImageMagick.'"),
			КодВозврата,
			СтрокаКоманды);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с картинками'"),
			УровеньЖурналаРегистрации.Предупреждение,,,
			ТекстПредупреждения);
		Возврат КодВозврата;
	КонецЕсли;
	
	// Ошибка ОС или иного приложения.
	Если КодВозврата < 300 Тогда
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Ошибка %1 при вызове ImageMagick с командной строкой:
			|%2
			|Возможно, нарушена структура командной строки.'"),
			КодВозврата,
			СтрокаКоманды);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Ошибка ImageMagick.
	ТекстИсключения = СтрШаблон(НСтр("ru = 'Ошибка %1 при вызове ImageMagick с командной строкой:
		|%2
		|Подробности см. в документации к ImageMagick.'"),
		КодВозврата,
		СтрокаКоманды);
	ВызватьИсключение ТекстИсключения;
	
КонецФункции  

// Преобразует pdf в массив png
// 
// Параметры:
//  ИмяФайлаPdf  - Строка
//  ВременнаяПапкаДляРазархивирования  -Строка
//  DPI - число
// 
// Возвращаемое значение:
//  Массив - Преобразовать pdf в png
Функция ПреобразоватьPdfВPng(ИмяФайлаPdf, ВременнаяПапкаДляРазархивирования, DPI = 0) Экспорт
	
	Если DPI = 0 Тогда
		DPI = 150;
	КонецЕсли;	
	
	МассивПутейPng = Новый Массив;
	                  ПолучитьИмяВременногоФайла("png");
	ПутьНовогоФайла = ВременнаяПапкаДляРазархивирования + ПолучитьРазделительПути() + "res.png";
	ФайлыКУдалению = Новый Массив;
	
	Параметры = СтрШаблон("convert -strip -density DPI -quality 0 %1 %2",
		ИмяФайлаPdf,
		ПутьНовогоФайла);
	Параметры = СтрЗаменить(Параметры, "DPI", Строка(DPI));	
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению);
	
	МассивФайлов = НайтиФайлы(ВременнаяПапкаДляРазархивирования, "res*.png");
	
	МассивПутей = Новый Массив;
	МассивСтруктур = Новый Массив;
	
	// отсортируем по дате
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПутьФайла = Файл.ПолноеИмя;
		
		СтруктураФайла = Новый Структура("ПутьФайла, ИмяБезРасширения");
		СтруктураФайла.ПутьФайла = ПутьФайла;
		СтруктураФайла.ИмяБезРасширения = Файл.ИмяБезРасширения;
		
		МассивСтруктур.Добавить(СтруктураФайла);
		
	КонецЦикла;	
	
	СортироватьМассивПоЧислам(МассивСтруктур, МассивПутей);
	
	Для Каждого ПутьФайла Из МассивПутей Цикл
		МассивПутейPng.Добавить(ПутьФайла);
	КонецЦикла;	
	
	Возврат МассивПутейPng;

КонецФункции 

// Определяет, является ли переданная строка числом
//
// Параметры:
//   СтрокаСимволов - Строка - строка символов
//
// Возвращаемое значение:
//   Булево - возвращает Истина, если строка является числом
//
Функция ЭтоЧисло(СтрокаСимволов)
	
	СтрокаСимволов = СокрЛП(СтрокаСимволов);
	
	Если Не ЗначениеЗаполнено(СтрокаСимволов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДлинаСтроки = СтрДлина(СтрокаСимволов);
	
	Для ТекущийСимвол = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(СтрокаСимволов, ТекущийСимвол);
		
		Если КодСимвола < 48 Или КодСимвола > 57 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура УдалитьВременныеФайлы(ФайлыКУдалению)
	
	Если ФайлыКУдалению = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ФайлКУдалению Из ФайлыКУдалению Цикл
		УдалитьФайлы(ФайлКУдалению);
	КонецЦикла;
	
КонецПроцедуры

Процедура СортироватьМассивПоЧислам(МассивСтруктур, МассивПутей)
	
	ПараметрыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("ПутьФайла");
	ТаблицаФайлов.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));
	
	Для Каждого СтруктураФайла Из МассивСтруктур Цикл
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.ПутьФайла = СтруктураФайла.ПутьФайла;
		
		ИмяБезРасширения = СтруктураФайла.ИмяБезРасширения;
		
		Номер = 0;
		СтрокаНомера = "";
		
		ТекПоз = СтрДлина(ИмяБезРасширения);
		Пока ТекПоз > 1 Цикл
			Символ = Сред(ИмяБезРасширения, ТекПоз, 1);
			Если Не ЭтоЧисло(Символ) Тогда
				Прервать;
			КонецЕсли;	
			СтрокаНомера = Символ + СтрокаНомера;
			ТекПоз = ТекПоз - 1;
		КонецЦикла;	
		
		Попытка
			Номер = Число(СтрокаНомера);
		Исключение
		КонецПопытки;	
		
		НоваяСтрока.Номер = Номер;
		
	КонецЦикла;		
	
	ТаблицаФайлов.Сортировать("Номер Возр");  
	
	МассивПутей.Очистить();
	
	Для Каждого Стр Из ТаблицаФайлов Цикл
		МассивПутей.Добавить(Стр.ПутьФайла);
	КонецЦикла;	
	
КонецПроцедуры	

