//++ РС Консалт: Трофимов Евгений 08.02.2023 Задача 23710
//e1cib/data/Документ.Задание?ref=ba9df9b91fdc6f184025abfa4761a13d
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" 
		И ПараметрыВыполненияКоманды.Источник.Модифицированность = Истина Тогда
		
		ПоказатьПредупреждение(,"Нужно записать изменения в документе");
		Возврат;
		
	КонецЕсли;

	ФормаЗаполняемогоДокумента = ПолучитьФорму(
		"Документ.ПроизводствоБезЗаказа.ФормаОбъекта",,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	ДанныеФормы = ФормаЗаполняемогоДокумента.Объект;
	ЗаполнитьФормуНаСервере(ДанныеФормы, ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, ФормаЗаполняемогоДокумента.Объект);
	ФормаЗаполняемогоДокумента.Открыть();
	ФормаЗаполняемогоДокумента.ОбновитьВидимостьЭлементовТабличнойЧасти("ВыходныеИзделия", "Получатель");
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 08.02.2023 Задача 23710
//e1cib/data/Документ.Задание?ref=ba9df9b91fdc6f184025abfa4761a13d
&НаСервере
Процедура ЗаполнитьФормуНаСервере(ДанныеФормы, СсылкаНаДокументОснование)
	УстановитьПривилегированныйРежим(Истина);
	оДок = Документы.ПроизводствоБезЗаказа.СоздатьДокумент();
	оДок.Заполнить(СсылкаНаДокументОснование);
	ЗначениеВДанныеФормы(оДок, ДанныеФормы);
КонецПроцедуры

