
&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриАктивизацииЯчейки")
Процедура РСК_ТоварыПриАктивизацииЯчейки(Элемент)

	Если Не Элемент.ТекущийЭлемент = Элементы.ТоварыШтрихкод Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ТоварыШтрихкод.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;

	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",   ТекущиеДанные.Номенклатура);
	Структура.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	Структура.Вставить("Упаковка",       ТекущиеДанные.Упаковка);
	#Вставка
	//++ РС Консалт: Минаков А.С. Задача 20226
	Структура.Вставить("Серия",       ТекущиеДанные.Серия);
	//++ РС Консалт: Минаков А.С. Задача 20226
	#КонецВставки

	Элементы.ТоварыШтрихкод.СписокВыбора.ЗагрузитьЗначения(РозничныеПродажиВызовСервера.ПолучитьШтрихкодыНоменклатуры(Структура));

КонецПроцедуры
