
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	АдресХранилища = ПодготовитьДанныеКСохранению(ПараметрКоманды);
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	
	НачатьПолучениеФайлаССервера(АдресХранилища, ""+ПараметрКоманды+".xml",ПараметрыДиалога);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеКСохранению(ВариантМакета)

	оВариантМакета = ВариантМакета.ПолучитьОбъект();
	
	Возврат ПоместитьВоВременноеХранилище(
		ОбщегоНазначения.ЗначениеВСтрокуXML(оВариантМакета.Макет.Получить()), 
		Новый УникальныйИдентификатор
	);
	

КонецФункции // ПодготовитьДанныеКСохранению()
