
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура РСК_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	#Вставка
	//++РС Консалт: Минаков А.С. Задача 17205
	Если СтрНайти(Список.ТекстЗапроса, "И &КонстантаВариантПриемки В (&ВариантыПриемкиПоНакладнаяПоЗаказу)") Тогда
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
		"И &КонстантаВариантПриемки В (&ВариантыПриемкиПоНакладнаяПоЗаказу)",
		"И (ПриобретениеТоваровУслуг.ВариантПриемкиТоваров В (&ВариантыПриемкиПоНакладнаяПоЗаказу) ИЛИ &КонстантаВариантПриемки В (&ВариантыПриемкиПоНакладнаяПоЗаказу))")
	Иначе
		ВызватьИсключение("Расширение ""РСК"" устарело. Требуется обновить документ ""Поступление товаров на склад""")
	КонецЕсли;
	//++РС Консалт: Минаков А.С. Задача 17205
	#КонецВставки
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Партнер",		Параметры.Партнер);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Контрагент",	Параметры.Контрагент);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Соглашение",	Параметры.Соглашение);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация",	Параметры.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Договор",		Параметры.Договор);

	Если ЗначениеЗаполнено(Параметры.Склад) Тогда
		Склады = ЗначениеНастроекПовтИсп.ИерархияГрупп(Параметры.Склад);
		Склады.Добавить(Справочники.Склады.ПустаяСсылка());

		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "БезОтбораПоСкладу", Ложь);
	Иначе
		Склады = Новый Массив;

		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "БезОтбораПоСкладу", Истина);
	КонецЕсли;
	
	Склады.Добавить(Параметры.Склад);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Склады", Склады);
	
	ХозяйственныеОперацииСоглашения = Новый Массив;
	ХозяйственныеОперацииСоглашения.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
	ХозяйственныеОперацииСоглашения.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
	ХозяйственныеОперацииСоглашения.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);

	ХозяйственныеОперацииДоговора = Новый Массив;
	ХозяйственныеОперацииДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
	ХозяйственныеОперацииДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки);
	ХозяйственныеОперацииДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути);
	ХозяйственныеОперацииДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки);
	ХозяйственныеОперацииДоговора.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ХозяйственнаяОперация",
	Параметры.ХозяйственнаяОперация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ХозяйственныеОперацииДоговора",
	ХозяйственныеОперацииДоговора);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ХозяйственныеОперацииСоглашения",
	ХозяйственныеОперацииСоглашения);

	ВариантыПриемкиПоЗаказу = Новый Массив;
	ВариантыПриемкиПоЗаказу.Добавить(Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ВариантыПриемкиПоЗаказу",
	ВариантыПриемкиПоЗаказу);

	ВариантыПриемкиПоДоговоруПоЗаказу = Новый Массив;
	ВариантыПриемкиПоДоговоруПоЗаказу.Добавить(Перечисления.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ВариантыПриемкиПоДоговоруПоЗаказу",
	ВариантыПриемкиПоДоговоруПоЗаказу);

	ВариантыПриемкиПоНакладнаяПоЗаказу = Новый Массив;
	ВариантыПриемкиПоНакладнаяПоЗаказу.Добавить(Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ВариантыПриемкиПоНакладнаяПоЗаказу",
	ВариантыПриемкиПоНакладнаяПоЗаказу);

	ВариантыПриемкиПоНакладнаяБезЗаказа = Новый Массив;
	ВариантыПриемкиПоНакладнаяБезЗаказа.Добавить(Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным);
	ВариантыПриемкиПоНакладнаяБезЗаказа.Добавить(Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ВариантыПриемкиПоНакладнаяБезЗаказа",
	ВариантыПриемкиПоНакладнаяБезЗаказа);

	ВариантыПриемкиПоСоглашению = Новый Массив;
	ВариантыПриемкиПоСоглашению.Добавить(Перечисления.ВариантыПриемкиТоваров.МожетПроисходитьБезЗаказовИНакладных);
	ВариантыПриемкиПоСоглашению.Добавить(Перечисления.ВариантыПриемкиТоваров.НеРазделенаПоЗаказамИНакладным);
	ВариантыПриемкиПоСоглашению.Добавить(Перечисления.ВариантыПриемкиТоваров.НеРазделенаПоНакладным);

	ВариантыПриемкиПоДоговору = Новый Массив;
	ВариантыПриемкиПоДоговору.Добавить(Перечисления.ВариантыПриемкиТоваров.ПоДоговорамБезЗаказовИНакладных);
	ВариантыПриемкиПоДоговору.Добавить(Перечисления.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных);
	ВариантыПриемкиПоДоговору.Добавить(Перечисления.ВариантыПриемкиТоваров.ПоДоговорамПослеНакладных);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ВариантыПриемкиПоСоглашению",
	ВариантыПриемкиПоСоглашению);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ВариантыПриемкиПоДоговору",
	ВариантыПриемкиПоДоговору);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"КонстантаВариантПриемки",
	Константы.ВариантПриемкиТоваров.Получить());

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ИспользоватьТоварыВПутиОтПоставщиков",
	ПолучитьФункциональнуюОпцию("ИспользоватьТоварыВПутиОтПоставщиков"));

КонецПроцедуры
