//++ РС Консалт: Трофимов Евгений 08.02.2023 Задача 23710
//e1cib/data/Документ.Задание?ref=ba9df9b91fdc6f184025abfa4761a13d
&НаКлиенте
Процедура ОбновитьВидимостьЭлементовТабличнойЧасти(ИмяТЧ, ИмяСклад) Экспорт
	Для Каждого Стр Из Объект[ИмяТЧ] Цикл
		ТекущаяСтрока = Элементы[ИмяТЧ].ДанныеСтроки(Стр.ПолучитьИдентификатор());
		
		#Область КодПроцедуры_ТаблицаНоменклатураПриИзменении
		СтруктураДействий = Новый Структура;
		
		ДобавитьВСтруктуруДействияПриИзмененииНоменклатуры(
			ИмяТЧ, ТекущаяСтрока, ЭтаФорма, СтруктураДействий,, ИмяТЧ = "МатериалыИРаботы");
			
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТЧ, ЭтаФорма, СтруктураДействий);
		
		ДобавитьВСтруктуруДействияПоСериям(СтруктураДействий, ТекущаяСтрока[ИмяСклад], ПараметрыУказанияСерий[ИмяТЧ]);
		
		Если ИмяТЧ = "ВыходныеИзделия" Тогда
			СтруктураЗаполненияСпецификации = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыДействияПроверитьЗаполнитьСпецификацию(
				Объект, ТекущаяСтрока, ПараметрыВыбораСпецификаций);
			СтруктураДействий.Вставить("ПроверитьЗаполнитьСпецификацию", СтруктураЗаполненияСпецификации);
		КонецЕсли;
		
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		Если ИмяТЧ = "ВыходныеИзделия" Или ИмяТЧ = "ПобочныеИзделия" Тогда
			ОграничитьТипПолучателя(ИмяТЧ, ТекущаяСтрока);
		КонецЕсли;
		#КонецОбласти
		
	КонецЦикла;
КонецПроцедуры // ОбновитьВидимостьЭлементовТабличнойЧасти()
