//++ РС Консалт: Трофимов Евгений 08.02.2023 Задача 23710
//e1cib/data/Документ.Задание?ref=ba9df9b91fdc6f184025abfa4761a13d
&НаКлиенте
Процедура ОбновитьВидимостьЭлементовТабличнойЧасти(ИмяТЧ, ИмяСклад) Экспорт
	Для Каждого Стр Из Объект[ИмяТЧ] Цикл
		ТекущаяСтрока = Элементы[ИмяТЧ].ДанныеСтроки(Стр.ПолучитьИдентификатор());
		
		#Область КодПроцедуры_ТаблицаНоменклатураПриИзменении
		СтруктураДействий = Новый Структура;
		
		ДобавитьВСтруктуруДействияПриИзмененииНоменклатуры(
			ИмяТЧ, ТекущаяСтрока, ЭтаФорма, СтруктураДействий,, ИмяТЧ = "МатериалыИРаботы");
			
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТЧ, ЭтаФорма, СтруктураДействий);
		
		ДобавитьВСтруктуруДействияПоСериям(СтруктураДействий, ТекущаяСтрока[ИмяСклад], ПараметрыУказанияСерий[ИмяТЧ]);
		
		Если ИмяТЧ = "ВыходныеИзделия" Тогда
			СтруктураЗаполненияСпецификации = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыДействияПроверитьЗаполнитьСпецификацию(
				Объект, ТекущаяСтрока, ПараметрыВыбораСпецификаций);
			СтруктураДействий.Вставить("ПроверитьЗаполнитьСпецификацию", СтруктураЗаполненияСпецификации);
		КонецЕсли;
		
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		Если ИмяТЧ = "ВыходныеИзделия" Или ИмяТЧ = "ПобочныеИзделия" Тогда
			ОграничитьТипПолучателя(ИмяТЧ, ТекущаяСтрока);
		КонецЕсли;
		#КонецОбласти
		
	КонецЦикла;
КонецПроцедуры // ОбновитьВидимостьЭлементовТабличнойЧасти()

&НаКлиенте
Процедура РСК_МатериалыИРаботыРСК_ОсновнаяКомплектующаяПриИзмененииВместо(Элемент)
	
	//++ РС Консалт: Минаков А.С. Задача 25314
	ТекущиеДанные = Элементы.МатериалыИРаботы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено 
		Или Не ТекущиеДанные.РСК_ОсновнаяКомплектующая Тогда
		Возврат
	КонецЕсли; 
	
	НомерГруппыЗатрат = ТекущиеДанные.НомерГруппыЗатрат;
	
	СтрокаПродукции = Объект.ВыходныеИзделия.НайтиСтроки(Новый Структура("НомерГруппыЗатрат", НомерГруппыЗатрат));
	Если СтрокаПродукции.Количество() Тогда
		Если Не ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СтрокаПродукции[0].Номенклатура, "ВестиУчетПоГТД") Тогда
			ТекущиеДанные.РСК_ОсновнаяКомплектующая = Ложь;
			Сообщить("Для продукции """ + СтрокаПродукции[0].Номенклатура + """ не ведется учет по ГТД. Указание основной комплектующей не требуется")
		КонецЕсли;
		Если Не ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВестиУчетПоГТД") Тогда
			ТекущиеДанные.РСК_ОсновнаяКомплектующая = Ложь;
			Сообщить("Для комплектующей """ + СтрокаПродукции[0].Номенклатура + """ не ведется учет по ГТД. Её невозможно указать в качестве основной комплектующей")
		КонецЕсли
	Иначе
		ТекущиеДанные.РСК_ОсновнаяКомплектующая = Ложь;
		Сообщить("Для группы затрат """ + ТекущиеДанные.ГруппаЗатрат + """ не требуется указание основной комплектующей")
	КонецЕсли
	//++ РС Консалт: Минаков А.С. Задача 25314
	
КонецПроцедуры
