
//++ РС Консалт: Трофимов Евгений 12.07.2022 Задача 18725
//e1cib/data/Документ.Задание?ref=82a4670c1ac44f3949c1b038bf806fda
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПоиска = Новый Структура("Номер,Дата");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, Параметры);
	
	Проформы.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресХраненияПроформ));

	Строки = Проформы.НайтиСтроки(СтруктураПоиска);
	Если Строки.Количество() > 0 Тогда
		Элементы.Проформы.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 12.07.2022 Задача 18725
//e1cib/data/Документ.Задание?ref=82a4670c1ac44f3949c1b038bf806fda
&НаКлиенте
Процедура ПроформыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = Элементы.Проформы.ДанныеСтроки(ВыбраннаяСтрока);
	РезультатВыбора = Новый Структура("Номер,Дата");
	ЗаполнитьЗначенияСвойств(РезультатВыбора, ДанныеСтроки);
	Закрыть(РезультатВыбора);
КонецПроцедуры
