
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.РСК_ВариантыМакетовПечатныхФорм.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	ТипМакета = "MXL";
	
	ПараметрыОткрытия = Новый Структура;
	//ПараметрыОткрытия.Вставить("ИмяОбъектаМетаданныхМакета", ТекущиеДанные.ИмяОбъектаМетаданныхМакета);
	ПараметрыОткрытия.Вставить("ТипМакета", ТипМакета);
	ПараметрыОткрытия.Вставить("ВариантМакета", ПараметрКоманды);
	ПараметрыОткрытия.Вставить("ТабличныйДокумент", ПолучитьТабДок(ПараметрКоманды));
	
	Если ТипМакета = "MXL" Тогда
		ПараметрыОткрытия.Вставить("ИмяДокумента", РСК_ВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Наименование"));
		ПараметрыОткрытия.Вставить("Редактирование", Истина);
		ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДок(ВариантМакета)
	
	оВариантМакета = ВариантМакета.ПолучитьОбъект();
	
	Возврат оВариантМакета.Макет.Получить();

КонецФункции // ПолучитьТабДок()
