
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.ТекстЗапроса = ПолучитьТекстЗапроса();
	Список.Параметры.УстановитьЗначениеПараметра("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	Список.Параметры.УстановитьЗначениеПараметра("ВидАдрес", РСК_ПовтИсп.Получить_Справочники_ВидыКонтактнойИнформации_АдресКонтактногоЛица());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапроса()

	Текст = 
		"ВЫБРАТЬ
		|	СправочникКонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	СправочникКонтактныеЛицаПартнеров.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникКонтактныеЛицаПартнеров.Владелец КАК Владелец,
		|	СправочникКонтактныеЛицаПартнеров.Наименование КАК Наименование,
		|	ЕСТЬNULL(КонтактТелефон.Представление, """") КАК Телефон,
		|	ЕСТЬNULL(КонтактАдрес.Представление, """") КАК Адрес,
		|	СправочникКонтактныеЛицаПартнеров.РСК_ДокументУЛ КАК ДокументУЛ,
		|	СправочникКонтактныеЛицаПартнеров.ДополнительнаяИнформация КАК ДокументПП
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК СправочникКонтактныеЛицаПартнеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактТелефон
		|		ПО СправочникКонтактныеЛицаПартнеров.Ссылка = КонтактТелефон.Ссылка
		|			И (КонтактТелефон.Вид = &ВидТелефон)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактАдрес
		|		ПО СправочникКонтактныеЛицаПартнеров.Ссылка = КонтактАдрес.Ссылка
		|			И (КонтактАдрес.Вид = &ВидАдрес)";
	
	Возврат Текст;

КонецФункции // ПолучитьТекстЗапроса()
