
&НаСервере
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура КонтрактФильтрПриИзмененииНаСервере()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Контракт", КонтрактФильтр, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(КонтрактФильтр));
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура КонтрактФильтрПриИзменении(Элемент)
	КонтрактФильтрПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура КонтрактФильтрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("реа_ДляВыдачи", Истина);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	Оповещение = Новый ОписаниеОповещения("КонтрактОбработкаВыбора", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора", ПараметрыФормы,,ЭтотОбъект.УникальныйИдентификатор,,,Оповещение);	
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура КонтрактОбработкаВыбора(Результат, ДополнительныеПараметры) Экспорт
	КонтрактФильтр = Результат;
	КонтрактФильтрПриИзмененииНаСервере();			
КонецПроцедуры
