
&НаКлиенте
Процедура РСК_ПриОткрытииПосле(Отказ)
	
	ПодключитьОбработчикОжидания("ДобавлениеКастомныхЭлементов",0.5,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеКастомныхЭлементов() Экспорт
	ДобавлениеКастомныхЭлементовНаСервере();
КонецПроцедуры // ДобавлениеКастомныхЭлементов()

&НаСервере
Процедура ДобавлениеКастомныхЭлементовНаСервере()

	ПолеВвода = Элементы.Добавить(
		"РСК_ОсновноеТранспортноеСредство",    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		ЭтаФорма);	      //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = "Основное транспортное средство";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "Объект.РСК_ОсновноеТранспортноеСредство";

КонецПроцедуры // ДобавлениеКастомныхЭлементовНаСервере()
