
&ИзменениеИКонтроль("СоздатьНовоеПисьмо")
Процедура РСК_СоздатьНовоеПисьмо(ПараметрыОтправкиПисьма, ОповещениеОЗакрытииФормы)

	ПараметрыОтправки = ПараметрыОтправкиПисьма();
	Если ПараметрыОтправкиПисьма <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыОтправки, ПараметрыОтправкиПисьма, Истина);
	КонецЕсли;

	СведенияДляОтправки = РаботаСПочтовымиСообщениямиВызовСервера.СведенияДляОтправки(ПараметрыОтправки);
	#Вставка 
	Если ПараметрыОтправки.Свойство("ДополнительныеПараметры") тогда
		Если ПараметрыОтправки.Свойство("Предмет") тогда
			ПараметрыОтправки.Предмет = ПараметрыОтправки.ДополнительныеПараметры.Предмет;	
		КонецЕсли;   
		Если ПараметрыОтправки.Получатель.Количество() = 0 тогда    
			НовСтр = ПараметрыОтправки.Получатель.Добавить();
			НовСтр.Значение = ПараметрыОтправкиПисьма.ДополнительныеПараметры.ПараметрыСообщения.КонтактныеДанныеЧека;          
			НовСтр.Представление = НовСТр.Значение;     
		КонецЕсли;  
		ПараметрыОтправки.Отправитель = РСК_ВызовСервера.ПолучитьУчетнуюЗапись(ПараметрыОтправки.ДополнительныеПараметры.Предмет);
	КонецЕсли;
	#КонецВставки
	ПараметрыОтправки.Вставить("ПоказыватьДиалогВыбораФорматаСохраненияВложений", СведенияДляОтправки.ПоказыватьДиалогВыбораФорматаСохраненияВложений);
	ПараметрыОтправки.Вставить("ОповещениеОЗакрытииФормы", ОповещениеОЗакрытииФормы);

	Если ТипЗнч(ПараметрыОтправки.Получатель) = Тип("Строка") Тогда
		ПараметрыОтправки.Получатель = СписокПолучателейИзСтроки(ПараметрыОтправки.Получатель);
	КонецЕсли;

	Если СведенияДляОтправки.ЕстьДоступныеУчетныеЗаписиДляОтправки Тогда
		СоздатьНовоеПисьмоПроверкаУчетнойЗаписиВыполнена(Истина, ПараметрыОтправки);
	Иначе
		ОбработчикРезультата = Новый ОписаниеОповещения("СоздатьНовоеПисьмоПроверкаУчетнойЗаписиВыполнена", ЭтотОбъект, ПараметрыОтправки);
		Если СведенияДляОтправки.ДоступноПравоДобавленияУчетныхЗаписей Тогда
			ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.ПомощникНастройкиУчетнойЗаписи", 
			Новый Структура("КонтекстныйРежим", Истина), , , , , ОбработчикРезультата);
		Иначе
			ТекстСообщения = НСтр("ru = 'Для отправки письма требуется настройка учетной записи электронной почты.
			|Обратитесь к администратору.';
			|en = 'Cannot send mail because the account is not configured.
			|Please contact the administrator.'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочтыЗавершение", ЭтотОбъект, ОбработчикРезультата);
			ПоказатьПредупреждение(ОписаниеОповещения, ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
