
&ИзменениеИКонтроль("ПослеЗаписиДвиженийДокумента")
Процедура РСК_ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ)

	//++ НЕ УТ
	КонтролироватьЛимиты =
	ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствБюджетирования")
	И ((ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
	И Документ.Статус <> Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена
	#Вставка 
	//++ Конарев снятие контроля лимитов для заявок, связанных с ДО
	И НЕ ИнтеграцияС1СДокументооборот3.ЕстьСвязанныйОбъектДО(Документ.Ссылка)
	#КонецВставки
	И Не Документ.СверхЛимита)
	Или
	(ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаКомандировку")
	И (Документ.Статус <> Перечисления.СтатусыЗаявокСотрудников.Отклонена
	И Документ.Статус <> Перечисления.СтатусыЗаявокСотрудников.Отозвана)
	И Документ.ВыдачаПодОтчет.Количество()
	И Не Документ.СверхЛимита));

	Если КонтролироватьЛимиты Тогда
		Ошибки = Неопределено;
		НарушеныТолькоИнформационныеЛимиты = Ложь;
		ЗаявкаПроходитПоЛимитамБюджетирования(Документ, Ошибки, НарушеныТолькоИнформационныеЛимиты);
			
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);

		Если ЗначениеЗаполнено(Ошибки) И Не НарушеныТолькоИнформационныеЛимиты Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если (ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
		Или ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаКомандировку"))
		И Документ.Закрыта Тогда
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ЗакрытьЗаявки(Документ.Ссылка, Истина);
	КонецЕсли;
	//-- НЕ УТ
	Возврат;

КонецПроцедуры
