//РСК+ Кикинева А.Г. заявка 255873 заполнение  документа по основным полям  реквизитов документа
&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура РСК_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Командировочные расходы");
	ТекущийОбъект.ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Безналичная;
	Если ТекущийОбъект.ЖелательнаяДатаПлатежа = Дата("00010101") Тогда
		ТекущийОбъект.ЖелательнаяДатаПлатежа = Дата(ТекущийОбъект.ДатаНачала-48*3600);
	КонецЕсли;     
	
	Если ТекущийОбъект.ФормаОплатыЗаявки=Перечисления.ФормыОплаты.Безналичная Тогда   
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка,
		|	БанковскиеСчетаОрганизаций.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|ГДЕ
		|	НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
		|	И НЕ БанковскиеСчетаОрганизаций.Закрыт
		|	И БанковскиеСчетаОрганизаций.Владелец = &Организация
		|	И БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = &Валюта
		|	И НЕ БанковскиеСчетаОрганизаций.ЭтоГруппа
		|	И БанковскиеСчетаОрганизаций.Наименование ПОДОБНО &ОсновнойСчет
		|"); 
		
		Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("Валюта", ТекущийОбъект.Валюта);
		Наименование = "ОСН";
		Запрос.УстановитьПараметр("ОсновнойСчет", "%"+Наименование+"%");  
		
		Результат = Запрос.Выполнить();   
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();     
			Выборка.Следующий(); 
			ТекущийОбъект.БанковскийСчет = Выборка.Ссылка;  
		КонецЕсли;
	КонецЕсли;  
	Если НЕ ТекущийОбъект.СписокФизЛиц Тогда		
		ТекущийОбъект.ЛицевойСчет = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(ТекущийОбъект.Сотрудник, ТекущийОбъект.Валюта);
		Если  ТекущийОбъект.ВыдачаПодОтчет.Количество()= 0 Тогда
			НоваяСтрока = ТекущийОбъект.ВыдачаПодОтчет.Добавить();
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = ТекущийОбъект.СтатьяДвиженияДенежныхСредств;
			НоваяСтрока.Сумма = ТекущийОбъект.ПредполагаемаяСуммаРасходов;              
		Конецесли;  
	КонецЕсли;	
			
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСотрудниковНаСервере")
Процедура РСК_ЗаполнитьСотрудниковНаСервере()
	
	МассивСотрудников = Объект.КомандируемыеСотрудники.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	МассивСотрудников = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(МассивСотрудников);
	
	Объект.ВыдачаПодОтчет.Очистить();  
	#Удаление
	Для каждого СотрудникСсылка Из МассивСотрудников Цикл
		Объект.ВыдачаПодОтчет.Добавить().Сотрудник = СотрудникСсылка;
	КонецЦикла; 
	#КонецУдаления
	#Вставка   
	Для каждого СотрудникСсылка Из МассивСотрудников Цикл
		СтрокаСотрудник = Объект.ВыдачаПодОтчет.Добавить();
		СтрокаСотрудник.Сотрудник = СотрудникСсылка; 
		СтрокаСотрудник.ЛицевойСчет = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(СотрудникСсылка, Объект.Валюта);
		СтрокаСотрудник.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Командировочные расходы");
	КонецЦикла;
	#КонецВставки
    	
КонецПроцедуры
//РСК+ Кикинева А.Г. заявка 255873 