&НаСервере
Процедура РСК_ПослеЗаписиНаСервереПеред(ТекущийОбъект, ПараметрыЗаписи) 
	
	Объект.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Командировочные расходы");
	Объект.ФормаОплатыЗаявки=Перечисления.ФормыОплаты.Безналичная;   
	Объект.ЖелательнаяДатаПлатежа=Дата(Объект.ДатаНачала-24*60*60);
	
	Если Объект.ФормаОплатыЗаявки=Перечисления.ФормыОплаты.Безналичная Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка,
		|	БанковскиеСчетаОрганизаций.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|ГДЕ
		|	НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
		|	И НЕ БанковскиеСчетаОрганизаций.Закрыт
		|	И БанковскиеСчетаОрганизаций.Владелец = &Организация
		|	И БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = &Валюта
		|	И НЕ БанковскиеСчетаОрганизаций.ЭтоГруппа
		|	И БанковскиеСчетаОрганизаций.Наименование ПОДОБНО &ОсновнойСчет
		|"); 
		
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
		Наименование="ОСН";
		Запрос.УстановитьПараметр("ОсновнойСчет", "%"+Наименование+"%");  
		
		Результат = Запрос.Выполнить();   
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();     
			Выборка.Следующий(); 
			Объект.БанковскийСчет=Выборка.Ссылка;  
		КонецЕсли;
	КонецЕсли; 
	Объект.ЛицевойСчет=Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(Объект.Сотрудник, Объект.Валюта);
	
	Если  Объект.ВыдачаПодОтчет.Количество()=0 Тогда
		НоваяСтрока = Объект.ВыдачаПодОтчет.Добавить();
		НоваяСтрока.СтатьяДвиженияДенежныхСредств=Объект.СтатьяДвиженияДенежныхСредств;
		НоваяСтрока.Сумма=Объект.ПредполагаемаяСуммаРасходов;              
	Конецесли;  
    
КонецПроцедуры
