
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	ЭО = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.Использование = Истина;
	ЭО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РСК_ДокументОснованиеОтчетПоВыдаче");
	ЭО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭО.ПравоеЗначение = ПредопределенноеЗначение("Документ.РСК_ОтчетПоВыдачеТСР.ПустаяСсылка");
	
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки", НастройкиКомпоновки);
	ОткрытьФорму(
		"Документ.РеализацияТоваровУслуг.ФормаСписка", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
КонецПроцедуры
