&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСхемуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСхемуНаСервере()
	
	Если Объект.СхемаКолонок.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РСК_КолонкиИмпорта.Ссылка КАК КолонкаИмпорта
			|ИЗ
			|	Справочник.РСК_КолонкиИмпорта КАК РСК_КолонкиИмпорта
			|ГДЕ
			|	НЕ РСК_КолонкиИмпорта.ПометкаУдаления";
		
		Объект.СхемаКолонок.Загрузить(Запрос.Выполнить().Выгрузить());
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

