//++ РС Консалт: Тарасов Михаил 20.02.2023 Задача 23959
//e1cib/data/Документ.Задание?ref=b9f22338004dbaef43605cf6e10c83d6

&ИзменениеИКонтроль("ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрам")
Функция РСК_ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрам(Форма)

	ВариантРасчетаЦен = Форма.ВариантРасчетаЦен;

	Если ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникНоменклатураОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена,
		|	&РСК_ДоступноАналогов КАК РСК_ДоступноАналогов,
		#КонецВставки

		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
		|	0 КАК Цена,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка) КАК ВидЦены,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникНоменклатура1
		|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА  
		|	СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА
		#КонецВставки

		|ГДЕ

		|	&ОтборНоменклатурыПоГруппе
		|	И &ОтборНоменклатурыПоСегменту

		|";

	ИначеЕсли ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.ВидЦенВШапке Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникНоменклатураОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена, 
		|	&РСК_ДоступноАналогов КАК РСК_ДоступноАналогов,
		#КонецВставки

		|	&ВидыЦен КАК ВидЦены,

		|	ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,

		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ВЫБОР
		|			КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|							ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникНоменклатура1

		|	СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА

		|	СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА
		|	СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА
		|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА 
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА
		|	СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА
		#КонецВставки

		|ГДЕ

		|	&ОтборНоменклатурыПоГруппе
		|	И &ОтборНоменклатурыПоСегменту

		|";

	ИначеЕсли ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.ВидЦенВШапкеУточненныеЦеныПоНоменклатуре Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникНоменклатураОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена, 
		|	&РСК_ДоступноАналогов КАК РСК_ДоступноАналогов,
		#КонецВставки

		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
		|	КОНЕЦ КАК Упаковка,

		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|			ТОГДА ИндивидуальныеЦеныНоменклатуры.ВидЦены
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
		|	КОНЕЦ КАК ВидЦены,

		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|				ТОГДА ИндивидуальныеЦеныНоменклатуры.Цена * ВЫБОР
		|						КОГДА &Валюта <> ИндивидуальныеЦеныНоменклатуры.Валюта
		|							ТОГДА ВЫБОР
		|									КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель, 0) > 0
		|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель, 0) > 0
		|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|										ТОГДА КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						ИНАЧЕ 1
		|					КОНЕЦ
		|			ИНАЧЕ ЦеныНоменклатуры.Цена * ВЫБОР
		|				КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
		|					ТОГДА ВЫБОР
		|							КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
		|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
		|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|								ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
		|							ИНАЧЕ 0
		|						КОНЕЦ
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|			КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии / 
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|			ТОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
		|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
		|	КОНЕЦ КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,

		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,

		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно / 
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|			ТОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
		|		ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1)
		|	КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникНоменклатура1

		|	СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА
		|	СОЕДИНЕНИЕ &ИндивидуальныеЦеныНоменклатуры ПО ИСТИНА

		|	СОЕДИНЕНИЕ &КурсВалютыИндивидуальныеЦены ПО ИСТИНА
		|	СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА
		|	СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА

		|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА 
		|	СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА
		#КонецВставки

		|ГДЕ

		|	&ОтборНоменклатурыПоГруппе
		|	И &ОтборНоменклатурыПоСегменту

		|";

	КонецЕсли;


	ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатуры.Упаковка",
	"ЦеныНоменклатуры.Номенклатура"));
	ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки3",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ИндивидуальныеЦеныНоменклатуры.Упаковка",
	"ИндивидуальныеЦеныНоменклатуры.Номенклатура"));

	Возврат ШаблонТекстаЗапроса;

КонецФункции 

&ИзменениеИКонтроль("ШаблонТекстаЗапросаСпискаХарактеристикПоПараметрам")
Функция РСК_ШаблонТекстаЗапросаСпискаХарактеристикПоПараметрам(Форма)

	ВариантРасчетаЦен = Форма.ВариантРасчетаЦен;

	Если ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.БезЦен Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникХарактеристикиОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена,
		|	&РСК_ДоступноАналогов КАК РСК_ДоступноАналогов,
		#КонецВставки

		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,

		|	ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка) КАК ВидЦены,

		|	0 КАК Цена,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникХарактеристики1
		|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА 
		|	СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА
		#КонецВставки

		|ГДЕ

		|	&ОтборХарактеристикПоВладельцу
		|	И &ОтборХарактеристикПоСегменту

		|";

	ИначеЕсли ВариантРасчетаЦен = Перечисления.ВариантыРасчетаЦенПоСоглашениямСКлиентами.ВидЦенВШапке Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникХарактеристикиОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена, 
		|	&РСК_ДоступноАналогов КАК РСК_ДоступноАналогов, 
		#КонецВставки

		|	&ВидыЦен КАК ВидЦены,

		|	ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,

		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ВЫБОР
		|			КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|							ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникХарактеристики1

		|	СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА

		|	СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА
		|	СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА
		|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА   
		|	СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА
		#КонецВставки

		|ГДЕ

		|	&ОтборХарактеристикПоВладельцу
		|	И &ОтборХарактеристикПоСегменту

		|";

	Иначе

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникХарактеристикиОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена, 
		|	&РСК_ДоступноАналогов КАК РСК_ДоступноАналогов,
		#КонецВставки

		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
		|	КОНЕЦ КАК Упаковка,

		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|			ТОГДА ИндивидуальныеЦеныНоменклатуры.ВидЦены
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
		|	КОНЕЦ КАК ВидЦены,


		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
		|				ТОГДА ИндивидуальныеЦеныНоменклатуры.Цена * ВЫБОР
		|						КОГДА &Валюта <> ИндивидуальныеЦеныНоменклатуры.Валюта
		|							ТОГДА ВЫБОР
		|									КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель, 0) > 0
		|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель, 0) > 0
		|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|										ТОГДА КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель)
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						ИНАЧЕ 1
		|					КОНЕЦ
		|			ИНАЧЕ ЦеныНоменклатуры.Цена * ВЫБОР
		|				КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
		|					ТОГДА ВЫБОР
		|							КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
		|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
		|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|								ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
		|							ИНАЧЕ 0
		|						КОНЕЦ
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|			КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникХарактеристики1

		|		СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА
		|		СОЕДИНЕНИЕ &ИндивидуальныеЦеныНоменклатуры ПО ИСТИНА

		|		СОЕДИНЕНИЕ &КурсВалютыИндивидуальныеЦены ПО ИСТИНА
		|		СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА
		|		СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА

		|		СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА 
		|	СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА
		#КонецВставки

		|ГДЕ

		|	&ОтборХарактеристикПоВладельцу
		|	И &ОтборХарактеристикПоСегменту

		|";

	КонецЕсли;

	ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатуры.Упаковка",
	"ЦеныНоменклатуры.Номенклатура"));
	ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки3",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ИндивидуальныеЦеныНоменклатуры.Упаковка",
	"ИндивидуальныеЦеныНоменклатуры.Номенклатура"));

	Возврат ШаблонТекстаЗапроса;

КонецФункции

&ИзменениеИКонтроль("ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрамСоглашенияСПоставщиком")
Функция РСК_ШаблонТекстаЗапросаСпискаНоменклатурыПоПараметрамСоглашенияСПоставщиком(ВариантРасчетаЦенПоставщика)

	Если ВариантРасчетаЦенПоставщика = "БезЦен" Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникНоменклатураОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена,
		#КонецВставки

		|	0 КАК Цена,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникНоменклатура1
		|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА 
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА  
		#КонецВставки

		|ГДЕ

		|	&ОтборНоменклатурыПоГруппе
		|	И &ОтборНоменклатурыПоСегменту

		|";

	ИначеЕсли ВариантРасчетаЦенПоставщика = "ЦеныПоСоглашению" Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникНоменклатураОбщиеПоля, 
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена,
		#КонецВставки

		|	ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Цена, 0) * ВЫБОР
		|			КОГДА &Валюта <> ЦеныНоменклатурыПоставщиков.Валюта
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|							ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,
		|	ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникНоменклатура1

		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
		|				&ЦеныНоменклатурыПоставщиковСрезПоследнихНаДату,
		|					ВидЦеныПоставщика = &ВидЦеныПоставщика
		|					И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					{(Номенклатура).* КАК Номенклатура}
		|			) КАК ЦеныНоменклатурыПоставщиков
		|		ПО (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика = &ВидЦеныПоставщика)
		|			И (ЦеныНоменклатурыПоставщиков.Номенклатура = СправочникНоменклатура.Ссылка)
		|			И (ЦеныНоменклатурыПоставщиков.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))

		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаЦены
		|		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатурыПоставщиков.Валюта)

		|		СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА
		|		СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА 
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА  
		#КонецВставки

		|ГДЕ

		|	&ОтборНоменклатурыПоГруппе
		|	И &ОтборНоменклатурыПоСегменту

		|";

	КонецЕсли;

	ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатурыПоставщиков.Упаковка",
	"ЦеныНоменклатурыПоставщиков.Номенклатура"));

	Возврат ШаблонТекстаЗапроса;

КонецФункции

&ИзменениеИКонтроль("ШаблонТекстаЗапросаСпискаХарактеристикПоПараметрамСоглашенияСПоставщиком")
Функция РСК_ШаблонТекстаЗапросаСпискаХарактеристикПоПараметрамСоглашенияСПоставщиком(ВариантРасчетаЦенПоставщика)

	Если ВариантРасчетаЦенПоставщика = "БезЦен" Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникХарактеристикиОбщиеПоля,
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена,
		#КонецВставки

		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
		|	0 КАК Цена,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникХарактеристики1
		|	СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА 
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА  
		#КонецВставки

		|ГДЕ

		|	&ОтборХарактеристикПоВладельцу
		|	И &ОтборХарактеристикПоСегменту

		|";

	ИначеЕсли ВариантРасчетаЦенПоставщика = "ЦеныПоСоглашению" Тогда

		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ

		|	&СправочникХарактеристикиОбщиеПоля, 
		#Вставка     
		|	&РСК_ИмеетсяЗамена КАК РСК_ИмеетсяЗамена,
		#КонецВставки

		|	ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
		|	ВЫРАЗИТЬ((ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Цена, 0) КАК ЧИСЛО(31,2))) * ВЫБОР
		|			КОГДА &Валюта <> ЦеныНоменклатурыПоставщиков.Валюта
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
		|								И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
		|							ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,

		|	ЕСТЬNULL(ЦеныНоменклатурыПоставщиков.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,

		|	ВЫРАЗИТЬ(&ВсеОстаткиВНаличии / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК ЧИСЛО(15, 3)) КАК ВНаличииОстаток,
		|	&ВсеОстаткиВНаличии КАК ВНаличииВБазовыхЕдиницах,
		|	ВЫРАЗИТЬ(&ВсеОстаткиДоступно / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК ЧИСЛО(15, 3)) КАК Доступно

		|ИЗ

		|	&СправочникХарактеристики1

		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
		|				&ЦеныНоменклатурыПоставщиковСрезПоследнихНаДату,
		|					ВидЦеныПоставщика = &ВидЦеныПоставщика
		|					И Номенклатура = &Номенклатура
		|			) КАК ЦеныНоменклатурыПоставщиков
		|		ПО (ЦеныНоменклатурыПоставщиков.ВидЦеныПоставщика = &ВидЦеныПоставщика)
		|			И (ЦеныНоменклатурыПоставщиков.Номенклатура = &Номенклатура)
		|			И (ЦеныНоменклатурыПоставщиков.Характеристика = ХарактеристикиНоменклатуры.Ссылка)

		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаЦены
		|		ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатурыПоставщиков.Валюта)

		|		СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА
		|		СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА  
		#Вставка     
		|	СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА  
		#КонецВставки

		|ГДЕ

		|	&ОтборХарактеристикПоВладельцу
		|	И &ОтборХарактеристикПоСегменту

		|";

	КонецЕсли;

	ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЦеныНоменклатурыПоставщиков.Упаковка",
	"ЦеныНоменклатурыПоставщиков.Номенклатура"));

	Возврат ШаблонТекстаЗапроса;

КонецФункции

&ИзменениеИКонтроль("ПараметрыШаблонаТекстаЗапроса")
Функция РСК_ПараметрыШаблонаТекстаЗапроса()

	ПараметрыШаблона = Новый Массив();

	ПараметрыШаблона.Добавить("&СправочникНоменклатура1");
	ПараметрыШаблона.Добавить("&СправочникХарактеристики1");
	ПараметрыШаблона.Добавить("&СправочникНоменклатураКонтрагентов1");

	ПараметрыШаблона.Добавить("&СправочникНоменклатураОбщиеПоля,");
	ПараметрыШаблона.Добавить("&СправочникХарактеристикиОбщиеПоля,");
	ПараметрыШаблона.Добавить("&СправочникНоменклатураКонтрагентовОбщиеПоля,");

	ПараметрыШаблона.Добавить("&ОтборНоменклатурыПоГруппе");
	ПараметрыШаблона.Добавить("И &ОтборНоменклатурыПоЦене1");
	ПараметрыШаблона.Добавить("И &ОтборНоменклатурыПоЦене25");
	ПараметрыШаблона.Добавить("И &ОтборНоменклатурыПоСегменту");

	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &КурсВалютыСоглашения ПО ИСТИНА");
	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &КурсВалютыИндивидуальныеЦены ПО ИСТИНА");
	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА");
	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА");

	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА");
	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &ИндивидуальныеЦеныНоменклатуры ПО ИСТИНА");

	ПараметрыШаблона.Добавить("&ЦеныНоменклатурыПоставщиковСрезПоследнихНаДату");

	ПараметрыШаблона.Добавить("&ОтборХарактеристикПоВладельцу");
	ПараметрыШаблона.Добавить("И &ОтборХарактеристикПоСегменту");

	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА");
	ПараметрыШаблона.Добавить("&ВсеОстаткиВНаличии");
	ПараметрыШаблона.Добавить("&ВсеОстаткиДоступно");

	ПараметрыШаблона.Добавить("&ВариантРасчетаЦеныНабора");
	ПараметрыШаблона.Добавить("&НаборСодержитТовары");
	ПараметрыШаблона.Добавить("&НаборСодержитУслуги");
	#Вставка     
	ПараметрыШаблона.Добавить("&РСК_ИмеетсяЗамена");   
	ПараметрыШаблона.Добавить("&РСК_ДоступноАналогов");
	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА");
	ПараметрыШаблона.Добавить("СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА");
	#КонецВставки

	Возврат ПараметрыШаблона;

КонецФункции

&ИзменениеИКонтроль("ПодстрокаЗаменыПараметраШаблонаТекстаЗапроса")
Функция РСК_ПодстрокаЗаменыПараметраШаблонаТекстаЗапроса(ПодстрокаПоиска, ПараметрыЗамены)

	ТипСписка = ПараметрыЗамены.ТипСписка;
	НесколькоСкладов = ПараметрыЗамены.НесколькоСкладов;
	НесколькоВидовЦен = ПараметрыЗамены.НесколькоВидовЦен;
	ЕстьЦеныВБудущем = ПараметрыЗамены.ЕстьЦеныВБудущем;
	ИспользоватьХарактеристикиНоменклатуры = ПараметрыЗамены.ИспользоватьХарактеристикиНоменклатуры;
	ОтображатьОстаткиПоНазначению = ПараметрыЗамены.ОтображатьОстаткиПоНазначению;
	РежимПодбораБезСуммовыхПараметров = ПараметрыЗамены.РежимПодбораБезСуммовыхПараметров;
	ОтображатьОстаткиНаСкладах = ПараметрыЗамены.ОтображатьОстаткиНаСкладах;
	ЕстьЦеныНоменклатурыПоставщиковВБудущем = ПараметрыЗамены.ЕстьЦеныНоменклатурыПоставщиковВБудущем;
	ИспользоватьКомплекты = ПараметрыЗамены.ИспользоватьКомплекты;
	ИспользуетсяЦенообразование25 = ПараметрыЗамены.ИспользуетсяЦенообразование25;
	НеИспользоватьВидыЦенПоУсловиюПродаж = ПараметрыЗамены.НеИспользоватьВидыЦенПоУсловиюПродаж;

	Если ПодстрокаПоиска = "&СправочникНоменклатура1" Тогда

		Если ИспользоватьКомплекты Тогда
			ПодстрокаЗамены = "
			|	Справочник.Номенклатура КАК СправочникНоменклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
			|		ПО ВариантыКомплектацииНоменклатуры.Владелец = СправочникНоменклатура.Ссылка
			|		И ВариантыКомплектацииНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		И ВариантыКомплектацииНоменклатуры.Основной
			|";
		Иначе
			ПодстрокаЗамены = "
			|	Справочник.Номенклатура КАК СправочникНоменклатура";
		КонецЕсли;

	ИначеЕсли ПодстрокаПоиска = "&СправочникХарактеристики1" Тогда

		Если ИспользоватьКомплекты Тогда
			ПодстрокаЗамены = "
			|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
			|		ПО ВариантыКомплектацииНоменклатуры.Владелец = &Номенклатура
			|		И ВариантыКомплектацииНоменклатуры.Характеристика = ХарактеристикиНоменклатуры.Ссылка
			|		И ВариантыКомплектацииНоменклатуры.Основной
			|";
		Иначе
			ПодстрокаЗамены = "
			|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры";
		КонецЕсли;

	ИначеЕсли ПодстрокаПоиска = "&СправочникНоменклатураКонтрагентов1" Тогда

		ПодстрокаЗамены = "
		|	Справочник.НоменклатураКонтрагентов КАК СправочникНоменклатураКонтрагентов
		|";

	ИначеЕсли ПодстрокаПоиска = "&СправочникНоменклатураОбщиеПоля," Тогда

		ПодстрокаЗамены = "
		|	СправочникНоменклатура.Ссылка КАК Ссылка,
		|	СправочникНоменклатура.Артикул КАК Артикул,
		|	СправочникНоменклатура.Код КАК Код,
		|	СправочникНоменклатура.Наименование КАК Наименование,
		|	СправочникНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникНоменклатура.Родитель КАК Родитель,
		|	СправочникНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	СправочникНоменклатура.Ссылка КАК Номенклатура,
		|	СправочникНоменклатура.Ссылка КАК ЭлементСписка,
		|	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	
		|	ВЫБОР КОГДА СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) ТОГДА
		|		ЕСТЬNULL(&ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка))
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
		|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
		|	&НаборСодержитТовары КАК СодержитТовары,
		|	&НаборСодержитУслуги КАК СодержитУслуги,
		|	
		|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СправочникНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	СправочникНоменклатура.Качество КАК Качество,
		|	СправочникНоменклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|			ТОГДА ИСТИНА
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)) И ЕСТЬNULL(&НаборСодержитТовары, ЛОЖЬ) И Не ЕСТЬNULL(&НаборСодержитУслуги, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТовар,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|			ТОГДА ИСТИНА
		|		КОГДА СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)) И ЕСТЬNULL(&НаборСодержитУслуги, ЛОЖЬ) И НЕ ЕСТЬNULL(&НаборСодержитТовары, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслуга,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
		|			ТОГДА СправочникНоменклатура.ВидНоменклатуры
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
		|			ТОГДА СправочникНоменклатура.Ссылка
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
		|			ТОГДА СправочникНоменклатура.ВладелецХарактеристик
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ КАК ВладелецХарактеристик,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ХарактеристикиИспользуются,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.ЭтоГруппа
		|			ТОГДА ВЫБОР
		|					КОГДА СправочникНоменклатура.ПометкаУдаления
		|						ТОГДА 13
		|					ИНАЧЕ 12
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СправочникНоменклатура.ЕстьТоварыДругогоКачества
		|					ТОГДА 4 + ВЫБОР
		|							КОГДА СправочникНоменклатура.ПометкаУдаления
		|								ТОГДА 1
		|							ИНАЧЕ 0
		|						КОНЕЦ + ВЫБОР
		|							КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|								ТОГДА 0
		|							ИНАЧЕ 2
		|						КОНЕЦ
		|				ИНАЧЕ -1 + ВЫБОР
		|						КОГДА СправочникНоменклатура.ПометкаУдаления
		|							ТОГДА 1
		|						ИНАЧЕ 0
		|					КОНЕЦ + ВЫБОР
		|						КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|							ТОГДА 1
		|						ИНАЧЕ 3
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ИндексКартинки,
		|";

	ИначеЕсли ПодстрокаПоиска = "&СправочникХарактеристикиОбщиеПоля," Тогда

		Если ИспользуетсяЦенообразование25 Тогда
			ПодстрокаЗамены = "
			|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
			|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
			|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
			|	ИСТИНА КАК ХарактеристикиИспользуются,
			|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(&ТипНоменклатуры КАК Перечисление.ТипыНоменклатуры) КАК ТипНоменклатуры,
			|	
			|	ВЫБОР
			|		КОГДА ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры).НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
			|		ИНАЧЕ ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования
			|	КОНЕЦ КАК ХарактеристикаЦО,
			|	
			|	ВЫБОР КОГДА &ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) ТОГДА
			|		ЕСТЬNULL(&ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка))
			|	ИНАЧЕ
			|		ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
			|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
			|	&НаборСодержитТовары КАК СодержитТовары,
			|	&НаборСодержитУслуги КАК СодержитУслуги,
			|	
			|	ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры) КАК ВидНоменклатуры,
			|	ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.УпаковкиЕдиницыИзмерения) КАК ЕдиницаИзмерения,
			|	&ВладелецХарактеристик,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.ПометкаУдаления
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИндексКартинки,
			|";
		Иначе
			ПодстрокаЗамены = "
			|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
			|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
			|	ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
			|	ИСТИНА КАК ХарактеристикиИспользуются,
			|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(&ТипНоменклатуры КАК Перечисление.ТипыНоменклатуры) КАК ТипНоменклатуры,
			|	
			|	ВЫБОР КОГДА &ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) ТОГДА
			|		ЕСТЬNULL(&ВариантРасчетаЦеныНабора, ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка))
			|	ИНАЧЕ
			|		ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)
			|	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
			|	&НаборСодержитТовары КАК СодержитТовары,
			|	&НаборСодержитУслуги КАК СодержитУслуги,
			|	
			|	ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры) КАК ВидНоменклатуры,
			|	ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.УпаковкиЕдиницыИзмерения) КАК ЕдиницаИзмерения,
			|	&ВладелецХарактеристик,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.ПометкаУдаления
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИндексКартинки,
			|";
		КонецЕсли;
	ИначеЕсли ПодстрокаПоиска = "&СправочникНоменклатураКонтрагентовОбщиеПоля," Тогда

		ПодстрокаЗамены = "
		|	СправочникНоменклатураКонтрагентов.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникНоменклатураКонтрагентов.Предопределенный КАК Предопределенный,
		|	СправочникНоменклатураКонтрагентов.Владелец КАК Владелец,
		|	СправочникНоменклатураКонтрагентов.Родитель КАК Родитель,
		|	СправочникНоменклатураКонтрагентов.ЭтоГруппа КАК ЭтоГруппа,
		|	СправочникНоменклатураКонтрагентов.Наименование КАК Наименование,
		|	СправочникНоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
		|	СправочникНоменклатураКонтрагентов.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	СправочникНоменклатураКонтрагентов.Номенклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
		|	СправочникНоменклатураКонтрагентов.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	СправочникНоменклатураКонтрагентов.Характеристика КАК Характеристика,
		|	СправочникНоменклатураКонтрагентов.Упаковка КАК Упаковка,
		|	СправочникНоменклатураКонтрагентов.Артикул КАК Артикул,
		|	СправочникНоменклатураКонтрагентов.Код КАК Код,
		|	СправочникНоменклатураКонтрагентов.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатураКонтрагентов.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТовар,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатураКонтрагентов.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслуга,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатураКонтрагентов.ЭтоГруппа
		|			ТОГДА ВЫБОР
		|					КОГДА СправочникНоменклатураКонтрагентов.ПометкаУдаления
		|						ТОГДА 13
		|					ИНАЧЕ 12
		|				КОНЕЦ
		|	КОНЕЦ КАК ИндексКартинки,
		|";

	ИначеЕсли ПодстрокаПоиска = "&ОтборНоменклатурыПоГруппе" Тогда

		ПодстрокаЗамены = "
		|	НЕ СправочникНоменклатура.ЭтоГруппа
		|";

	ИначеЕсли ПодстрокаПоиска = "&ЦеныНоменклатурыПоставщиковСрезПоследнихНаДату" Тогда

		ПодстрокаЗамены = ?(ЕстьЦеныНоменклатурыПоставщиковВБудущем, "&Дата", "");

	ИначеЕсли ПодстрокаПоиска = "И &ОтборНоменклатурыПоЦене1" Тогда

		Если Не РежимПодбораБезСуммовыхПараметров Тогда
			ПодстрокаЗамены = "
			|	И (ВЫБОР
			|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|		КОНЕЦ ИЛИ ВЫБОР
			|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
			|			ТОГДА СоглашениеТовары.Цена * ВЫБОР
			|					КОГДА &Валюта <> СоглашениеТовары.Ссылка.Валюта
			|						ТОГДА ВЫБОР
			|								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|									ТОГДА КурсыСрезПоследнихВалютаСоглашения.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаСоглашения.КурсЗнаменатель)
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|					ИНАЧЕ 1
			|				КОНЕЦ
			|		КОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
			|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|					КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|							И СоглашениеТовары.ВидЦены ЕСТЬ Не NULL 
			|						ТОГДА СоглашениеТовары.ВидЦены
			|					КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|							Или СоглашениеТовары.ВидЦены ЕСТЬ NULL )
			|							И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ Не NULL 
			|							И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|						ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
			|					КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|							Или СоглашениеТовары.ВидЦены ЕСТЬ NULL )
			|							И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL 
			|								Или СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
			|							И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|						ТОГДА СоглашениеШапка.ВидЦен
			|				КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
			|				И ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) > 0
			|			ТОГДА ЦеныНоменклатуры.Цена * ВЫБОР
			|					КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
			|						ТОГДА ВЫБОР
			|								КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|										И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|									ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
			|								ИНАЧЕ 0
			|							КОНЕЦ
			|					ИНАЧЕ 1
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ <> 0 ИЛИ &ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих))
			|";
		Иначе
			ПодстрокаЗамены = "";
		КонецЕсли;

	ИначеЕсли ПодстрокаПоиска = "И &ОтборНоменклатурыПоЦене25" Тогда

		Если Не РежимПодбораБезСуммовыхПараметров Тогда
			ПодстрокаЗамены = "
			|	И (ВЫБОР
			|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|		КОНЕЦ ИЛИ ВЫБОР
			|			КОГДА ЕСТЬNULL(ИндивидуальныеЦеныНоменклатуры.Цена, 0) > 0
			|				ТОГДА ИндивидуальныеЦеныНоменклатуры.Цена * ВЫБОР
			|						КОГДА &Валюта <> ИндивидуальныеЦеныНоменклатуры.Валюта
			|							ТОГДА ВЫБОР
			|									КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель, 0) > 0
			|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель, 0) > 0
			|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|											И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|										ТОГДА КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаИндивидуальныеЦены.КурсЗнаменатель)
			|									ИНАЧЕ 0
			|								КОНЕЦ
			|						ИНАЧЕ 1
			|					КОНЕЦ
			|			ИНАЧЕ ЦеныНоменклатуры.Цена * ВЫБОР
			|				КОГДА &Валюта <> ЦеныНоменклатуры.Валюта
			|					ТОГДА ВЫБОР
			|							КОГДА ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель, 0) > 0
			|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаЦены.КурсЧислитель, 0) > 0
			|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель, 0) > 0
			|									И ЕСТЬNULL(КурсыСрезПоследнихВалютаДокумента.КурсЧислитель, 0) > 0
			|								ТОГДА КурсыСрезПоследнихВалютаЦены.КурсЧислитель * КурсыСрезПоследнихВалютаДокумента.КурсЗнаменатель / (КурсыСрезПоследнихВалютаДокумента.КурсЧислитель * КурсыСрезПоследнихВалютаЦены.КурсЗнаменатель)
			|							ИНАЧЕ 0
			|						КОНЕЦ
			|					ИНАЧЕ 1
			|				КОНЕЦ
			|			КОНЕЦ <> 0 ИЛИ &ВариантРасчетаЦеныНабора = ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих))
			|";

		Иначе
			ПодстрокаЗамены = "";
		КонецЕсли;

	ИначеЕсли ПодстрокаПоиска = "&ВариантРасчетаЦеныНабора" Тогда

		ПодстрокаЗамены = ?(ИспользоватьКомплекты,
		"ВариантыКомплектацииНоменклатуры.ВариантРасчетаЦеныНабора",
		"ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка)");

	ИначеЕсли ПодстрокаПоиска = "&НаборСодержитТовары" Тогда

		ПодстрокаЗамены = ?(ИспользоватьКомплекты,
		"ВариантыКомплектацииНоменклатуры.СодержитТовары",
		"Ложь");

	ИначеЕсли ПодстрокаПоиска = "&НаборСодержитУслуги" Тогда

		ПодстрокаЗамены = ?(ИспользоватьКомплекты,
		"ВариантыКомплектацииНоменклатуры.СодержитУслуги",
		"Ложь");

	ИначеЕсли ПодстрокаПоиска = "И &ОтборНоменклатурыПоСегменту" Тогда

		ПодстрокаЗамены = "
		|{ГДЕ
		|	(1 В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			1
		|		ИЗ
		|			РегистрСведений.НоменклатураСегмента КАК Сегменты
		|		ГДЕ
		|			Сегменты.Номенклатура = СправочникНоменклатура.Ссылка
		|			И Сегменты.Сегмент = &СегментНоменклатуры))}
		|";

	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыДокумента ПО ИСТИНА" Тогда

		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(, Валюта = &Валюта
		|				И БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаДокумента
		|	ПО (ИСТИНА)
		|";

	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыСоглашения ПО ИСТИНА" Тогда

		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаСоглашения
		|	ПО (КурсыСрезПоследнихВалютаСоглашения.Валюта = СоглашениеТовары.Ссылка.Валюта)
		|";

	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыЦены ПО ИСТИНА" Тогда

		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаЦены
		|	ПО (КурсыСрезПоследнихВалютаЦены.Валюта = ЦеныНоменклатуры.Валюта)
		|";

	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &КурсВалютыИндивидуальныеЦены ПО ИСТИНА" Тогда

		ПодстрокаЗамены = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(,
		|				БазоваяВалюта В (ВЫБРАТЬ
		|					БазоваяВалютаПоУмолчанию.Значение КАК Значение
		|				ИЗ
		|					Константа.БазоваяВалютаПоУмолчанию КАК БазоваяВалютаПоУмолчанию)) КАК КурсыСрезПоследнихВалютаИндивидуальныеЦены
		|	ПО (КурсыСрезПоследнихВалютаИндивидуальныеЦены.Валюта = ИндивидуальныеЦеныНоменклатуры.Валюта)
		|";

	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &ИндивидуальныеЦеныНоменклатуры ПО ИСТИНА" Тогда

		Если ТипСписка = "СписокНоменклатура" Тогда

			ПодстрокаЗамены = "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
			|			{УсловиеОтбораПоДате},
			|			{УсловиеОтбораПоВидуЦен}
			|				И ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
			|			{(Номенклатура).* КАК Номенклатура}
			|		) КАК ИндивидуальныеЦеныНоменклатуры
			|	ПО (ИндивидуальныеЦеныНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка)
			|		И (ИндивидуальныеЦеныНоменклатуры.ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
			|		И (ИндивидуальныеЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
			|		И (ИндивидуальныеЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))";

		ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда

			ПодстрокаЗамены = "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
			|			{УсловиеОтбораПоДате},
			|			{УсловиеОтбораПоВидуЦен}
			|				И Номенклатура = &Номенклатура
			|			{(ХарактеристикаЦО).* КАК ХарактеристикаЦО}
			|		) КАК ИндивидуальныеЦеныНоменклатуры
			|	ПО (ИндивидуальныеЦеныНоменклатуры.Номенклатура = &Номенклатура)
			|		И (ИндивидуальныеЦеныНоменклатуры.ХарактеристикаЦО = ВЫБОР
			|			КОГДА ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры).НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
			|				ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
			|			ИНАЧЕ ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования
			|		КОНЕЦ)
			|		И (ИндивидуальныеЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
			|		И (ИндивидуальныеЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
			|";

		КонецЕсли;

		УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "КОНЕЦПЕРИОДА(&Дата, День)", "");
		УсловиеОтбораПоВидуЦен = "ВидЦены = &ВидЦенИндивидуальный";

		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоДате}", УсловиеОтбораПоДате);
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоВидуЦен}", УсловиеОтбораПоВидуЦен);

	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &ЦеныНоменклатуры ПО ИСТИНА" Тогда

		Если ИспользуетсяЦенообразование25 Тогда

			Если ТипСписка = "СписокНоменклатура" Тогда

				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
				|			{(Номенклатура).* КАК Номенклатура}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка)
				|		И (ЦеныНоменклатуры.ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
				|		И (ЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
				|		И (ЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))";

			ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда

				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И Номенклатура = &Номенклатура
				|			{(ХарактеристикаЦО).* КАК ХарактеристикаЦО}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = &Номенклатура)
				|		И (ЦеныНоменклатуры.ХарактеристикаЦО = ВЫБОР
				|			КОГДА ВЫРАЗИТЬ(&ВидНоменклатуры КАК Справочник.ВидыНоменклатуры).НастройкиКлючаЦенПоХарактеристике = ЗНАЧЕНИЕ(Перечисление.ВариантОтбораДляКлючаЦен.НеИспользовать)
				|				ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
				|			ИНАЧЕ ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования
				|		КОНЕЦ)
				|		И (ЦеныНоменклатуры.СерияЦО = ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка))
				|		И (ЦеныНоменклатуры.УпаковкаЦО = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
				|";

			КонецЕсли;

			УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "КОНЕЦПЕРИОДА(&Дата, День)", "");
			Если НеИспользоватьВидыЦенПоУсловиюПродаж Тогда
				УсловиеОтбораПоВидуЦен = ?(НесколькоВидовЦен, "ВидЦены В (&ВидыЦен)", "ВидЦены = &ВидыЦен");
			Иначе
				УсловиеОтбораПоВидуЦен = "ВидЦены = &ВидЦенОсновной";
			КонецЕсли;

			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоДате}", УсловиеОтбораПоДате);
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоВидуЦен}", УсловиеОтбораПоВидуЦен);

		Иначе

			Если ТипСписка = "СписокНоменклатура" Тогда

				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|			{(Номенклатура).* КАК Номенклатура}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка)
				|		И (ЦеныНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))";

			ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда

				ПодстрокаЗамены = "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|			{УсловиеОтбораПоДате},
				|			{УсловиеОтбораПоВидуЦен}
				|				И Номенклатура = &Номенклатура
				|			{(Характеристика).* КАК Характеристика}
				|		) КАК ЦеныНоменклатуры
				|	ПО (ЦеныНоменклатуры.Номенклатура = &Номенклатура)
				|		И (ЦеныНоменклатуры.Характеристика = ХарактеристикиНоменклатуры.Ссылка)
				|";

			КонецЕсли;

			УсловиеОтбораПоДате = ?(ЕстьЦеныВБудущем, "КОНЕЦПЕРИОДА(&Дата, День)", "");
			УсловиеОтбораПоВидуЦен = ?(НесколькоВидовЦен, "ВидЦены В (&ВидыЦен)", "ВидЦены = &ВидыЦен");

			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоДате}", УсловиеОтбораПоДате);
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "{УсловиеОтбораПоВидуЦен}", УсловиеОтбораПоВидуЦен);
		КонецЕсли;


	ИначеЕсли ПодстрокаПоиска = "&ОтборХарактеристикПоВладельцу" Тогда

		ПодстрокаЗамены = "
		|	ХарактеристикиНоменклатуры.Владелец = &ВладелецХарактеристик
		|";

	ИначеЕсли ПодстрокаПоиска = "И &ОтборХарактеристикПоСегменту" Тогда

		ПодстрокаЗамены = "
		|{ГДЕ
		|	(1 В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			1
		|		ИЗ
		|			РегистрСведений.НоменклатураСегмента КАК Сегменты
		|		ГДЕ
		|			Сегменты.Характеристика = ХарактеристикиНоменклатуры.Ссылка
		|			И Сегменты.Номенклатура = &НоменклатураСегмента
		|			И Сегменты.Сегмент = &СегментНоменклатуры))}
		|";

	ИначеЕсли ПодстрокаПоиска = "&ВсеОстаткиВНаличии" Тогда

		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "0";
		Иначе

			Если ОтображатьОстаткиПоНазначению Тогда
				ПодстрокаЗамены = "ЕСТЬNULL(ВсеОстатки.Запас, 0)";
			Иначе
				ПодстрокаЗамены = "ЕСТЬNULL(ВсеОстатки.ВНаличии, 0)";
			КонецЕсли;

		КонецЕсли;

	ИначеЕсли ПодстрокаПоиска = "&ВсеОстаткиДоступно" Тогда

		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "0";
		Иначе

			ПодстрокаЗамены = "ЕСТЬNULL(ВсеОстатки.Свободно, 0)";

		КонецЕсли;

	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &ВсеОстатки ПО ИСТИНА" Тогда

		Если Не ОтображатьОстаткиНаСкладах Тогда
			ПодстрокаЗамены = "
			|";
		Иначе

			Если НесколькоСкладов Тогда

				Если ТипСписка = "СписокНоменклатура" Или ТипСписка = "СписокНоменклатураПартнера" Тогда

					ПодстрокаЗамены = "
					|	ЛЕВОЕ СОЕДИНЕНИЕ(
					|		ВЫБРАТЬ
					|			РаспределениеЗапасов.Номенклатура    КАК Номенклатура,
					|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
					|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
					|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
					|		ИЗ
					|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
					|		ГДЕ
					|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
					|			И РаспределениеЗапасов.Назначение = &Назначение
					|			И РаспределениеЗапасов.Склад В(&Склад)
					|		СГРУППИРОВАТЬ ПО
					|			РаспределениеЗапасов.Номенклатура
					|	) КАК ВсеОстатки
					|	ПО 
					|		(ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка)
					|";

				ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда

					ПодстрокаЗамены = "
					|	ЛЕВОЕ СОЕДИНЕНИЕ(
					|		ВЫБРАТЬ
					|			РаспределениеЗапасов.Характеристика  КАК Характеристика,
					|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
					|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
					|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
					|		ИЗ
					|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
					|		ГДЕ
					|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
					|			И РаспределениеЗапасов.Назначение = &Назначение
					|			И РаспределениеЗапасов.Склад В(&Склад)
					|			И РаспределениеЗапасов.Номенклатура = &Номенклатура
					|		СГРУППИРОВАТЬ ПО
					|			РаспределениеЗапасов.Характеристика
					|	) КАК ВсеОстатки
					|	ПО 
					|		(ВсеОстатки.Характеристика = ХарактеристикиНоменклатуры.Ссылка)
					|";

				КонецЕсли;

			Иначе

				Если ТипСписка = "СписокНоменклатура" Или ТипСписка = "СписокНоменклатураПартнера" Тогда

					Если ИспользоватьХарактеристикиНоменклатуры Тогда

						ПодстрокаЗамены = "
						|	ЛЕВОЕ СОЕДИНЕНИЕ(
						|		ВЫБРАТЬ
						|			РаспределениеЗапасов.Номенклатура    КАК Номенклатура,
						|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
						|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
						|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
						|		ИЗ
						|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
						|		ГДЕ
						|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						|			И РаспределениеЗапасов.Назначение = &Назначение
						|			И РаспределениеЗапасов.Склад = &Склад

						|		СГРУППИРОВАТЬ ПО
						|			РаспределениеЗапасов.Номенклатура
						|	) КАК ВсеОстатки
						|	ПО 
						|		(ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка)
						|";

					Иначе

						ПодстрокаЗамены = "
						|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ВсеОстатки
						|		ПО ВсеОстатки.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
						|		И ВсеОстатки.Назначение = &Назначение
						|		И ВсеОстатки.Склад = &Склад
						|		И ВсеОстатки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
						|		И ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка
						|";

					КонецЕсли;

				ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда

					ПодстрокаЗамены = "
					|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК ВсеОстатки
					|		ПО ВсеОстатки.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
					|		И ВсеОстатки.Назначение = &Назначение
					|		И ВсеОстатки.Склад = &Склад
					|		И ВсеОстатки.Номенклатура = &Номенклатура
					|		И ВсеОстатки.Характеристика = ХарактеристикиНоменклатуры.Ссылка
					|";

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		ТекстНазначение = ?(ОтображатьОстаткиПоНазначению, "&Назначение", "ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)");
		ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "&Назначение", ТекстНазначение);
	#Вставка     
	ИначеЕсли ПодстрокаПоиска = "&РСК_ИмеетсяЗамена" Тогда
	
		Если ТипСписка = "СписокНоменклатура" Тогда
			
			ПодстрокаЗамены = "ВЫБОР
			|		КОГДА СправочникНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ НЕ РСК_ЗапросЗамен.ПриемникНоменклатура ЕСТЬ NULL
			|	КОНЕЦ"; 
			
		ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
			
			ПодстрокаЗамены = "НЕ РСК_ЗапросЗамен.ПриемникНоменклатура ЕСТЬ NULL";
			
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "&РСК_ДоступноАналогов" Тогда
		
		ПодстрокаЗамены = "ЕСТЬNULL(РСК_ЗапросАналогов.РСК_ДоступноАналогов, 0)";	
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &РСК_СоединениеЗамена ПО ИСТИНА" Тогда 
		
		Если ТипСписка = "СписокНоменклатура" Тогда  
			
			ПодстрокаЗамены = "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РСК_АналогиИЗамены.ИсточникНоменклатура КАК ИсточникНоменклатура,
			|	МАКСИМУМ(РСК_АналогиИЗамены.ПриемникНоменклатура) КАК ПриемникНоменклатура
			|ИЗ
			|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|ГДЕ
			|	РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Замена)
			|	И РСК_АналогиИЗамены.ПриемникНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	РСК_АналогиИЗамены.ИсточникНоменклатура) КАК РСК_ЗапросЗамен
			|	ПО СправочникНоменклатура.Ссылка = РСК_ЗапросЗамен.ИсточникНоменклатура";
			
		ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда  
			
			ПодстрокаЗамены = "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РСК_АналогиИЗамены.ИсточникХарактеристика КАК ИсточникХарактеристика,
			|	МАКСИМУМ(РСК_АналогиИЗамены.ПриемникНоменклатура) КАК ПриемникНоменклатура
			|ИЗ
			|	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|ГДЕ
			|	РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Замена)   
			|	И РСК_АналогиИЗамены.ИсточникНоменклатура = &Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	РСК_АналогиИЗамены.ИсточникХарактеристика) КАК РСК_ЗапросЗамен
			|ПО ХарактеристикиНоменклатуры.Ссылка = РСК_ЗапросЗамен.ИсточникХарактеристика";
			
		КонецЕсли;
		
	ИначеЕсли ПодстрокаПоиска = "СОЕДИНЕНИЕ &РСК_СоединениеАналог ПО ИСТИНА" Тогда	
		
		Если ТипСписка = "СписокНоменклатура" Тогда
			
			ПодстрокаЗамены = "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	ТаблицаАналогов.Номенклатура КАК Номенклатура,
			|	СУММА(РаспределениеЗапасов.Свободно) КАК РСК_ДоступноАналогов
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ВременнаТаблицаАналогов.Номенклатура КАК Номенклатура,
			|		ВременнаТаблицаАналогов.АналогНоменклатура КАК АналогНоменклатура,
			|		ВременнаТаблицаАналогов.АналогХарактеристика КАК АналогХарактеристика
			|	ИЗ
			|		(ВЫБРАТЬ
			|			РСК_АналогиИЗамены.ПриемникНоменклатура КАК Номенклатура,
			|			РСК_АналогиИЗамены.ИсточникНоменклатура КАК АналогНоменклатура,
			|			РСК_АналогиИЗамены.ИсточникХарактеристика КАК АналогХарактеристика
			|		ИЗ
			|			РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|		ГДЕ
			|			РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			РСК_АналогиИЗамены.ИсточникНоменклатура,
			|			РСК_АналогиИЗамены.ПриемникНоменклатура,
			|			РСК_АналогиИЗамены.ПриемникХарактеристика
			|		ИЗ
			|			РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|		ГДЕ
			|			РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			РСК_АналогиИЗамены.ИсточникНоменклатура,
			|			РСК_АналогиИЗамены1.ИсточникНоменклатура,
			|			РСК_АналогиИЗамены1.ИсточникХарактеристика
			|		ИЗ
			|			РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены1
			|				ПО РСК_АналогиИЗамены.ПриемникНоменклатура = РСК_АналогиИЗамены1.ПриемникНоменклатура
			|					И РСК_АналогиИЗамены.ПриемникХарактеристика = РСК_АналогиИЗамены1.ПриемникХарактеристика
			|					И РСК_АналогиИЗамены.ПриемникСерия = РСК_АналогиИЗамены1.ПриемникСерия
			|					И РСК_АналогиИЗамены.ВидСвязи = РСК_АналогиИЗамены1.ВидСвязи
			|		ГДЕ
			|			РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
			|			И НЕ(РСК_АналогиИЗамены.ИсточникНоменклатура = РСК_АналогиИЗамены1.ИсточникНоменклатура
			|						И РСК_АналогиИЗамены.ИсточникХарактеристика = РСК_АналогиИЗамены1.ИсточникХарактеристика
			|						И РСК_АналогиИЗамены.ИсточникСерия = РСК_АналогиИЗамены1.ИсточникСерия)) КАК ВременнаТаблицаАналогов) КАК ТаблицаАналогов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
			|		ПО (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
			|			И (РаспределениеЗапасов.Назначение = &Назначение)
			|			И (РаспределениеЗапасов.Склад = &Склад)
			|			И (РаспределениеЗапасов.Номенклатура = ТаблицаАналогов.АналогНоменклатура)
			|			И (РаспределениеЗапасов.Характеристика = ТаблицаАналогов.АналогХарактеристика)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаАналогов.Номенклатура) КАК РСК_ЗапросАналогов
			|ПО СправочникНоменклатура.Ссылка = РСК_ЗапросАналогов.Номенклатура";
			
		ИначеЕсли ТипСписка = "СписокХарактеристики" Тогда
			
			ПодстрокаЗамены = "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	ТаблицаАналогов.Характеристика КАК Характеристика,
			|	СУММА(РаспределениеЗапасов.Свободно) КАК РСК_ДоступноАналогов
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ВременнаТаблицаАналогов.Характеристика КАК Характеристика,
			|		ВременнаТаблицаАналогов.АналогНоменклатура КАК АналогНоменклатура,
			|		ВременнаТаблицаАналогов.АналогХарактеристика КАК АналогХарактеристика
			|	ИЗ
			|		(ВЫБРАТЬ
			|			РСК_АналогиИЗамены.ПриемникХарактеристика КАК Характеристика,
			|			РСК_АналогиИЗамены.ИсточникНоменклатура КАК АналогНоменклатура,
			|			РСК_АналогиИЗамены.ИсточникХарактеристика КАК АналогХарактеристика
			|		ИЗ
			|			РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|		ГДЕ
			|			РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
			|			И РСК_АналогиИЗамены.ПриемникНоменклатура = &Номенклатура
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			РСК_АналогиИЗамены.ИсточникХарактеристика,
			|			РСК_АналогиИЗамены.ПриемникНоменклатура,
			|			РСК_АналогиИЗамены.ПриемникХарактеристика
			|		ИЗ
			|			РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|		ГДЕ
			|			РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
			|			И РСК_АналогиИЗамены.ИсточникНоменклатура = &Номенклатура
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			РСК_АналогиИЗамены.ИсточникХарактеристика,
			|			РСК_АналогиИЗамены1.ИсточникНоменклатура,
			|			РСК_АналогиИЗамены1.ИсточникХарактеристика
			|		ИЗ
			|			РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены1
			|				ПО РСК_АналогиИЗамены.ПриемникНоменклатура = РСК_АналогиИЗамены1.ПриемникНоменклатура
			|					И РСК_АналогиИЗамены.ПриемникХарактеристика = РСК_АналогиИЗамены1.ПриемникХарактеристика
			|					И РСК_АналогиИЗамены.ПриемникСерия = РСК_АналогиИЗамены1.ПриемникСерия
			|					И РСК_АналогиИЗамены.ВидСвязи = РСК_АналогиИЗамены1.ВидСвязи
			|		ГДЕ
			|			РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
			|			И РСК_АналогиИЗамены.ИсточникНоменклатура = &Номенклатура
			|			И НЕ(РСК_АналогиИЗамены.ИсточникНоменклатура = РСК_АналогиИЗамены1.ИсточникНоменклатура
			|						И РСК_АналогиИЗамены.ИсточникХарактеристика = РСК_АналогиИЗамены1.ИсточникХарактеристика
			|						И РСК_АналогиИЗамены.ИсточникСерия = РСК_АналогиИЗамены1.ИсточникСерия)) КАК ВременнаТаблицаАналогов) КАК ТаблицаАналогов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
			|		ПО (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
			|			И (РаспределениеЗапасов.Назначение = &Назначение)
			|			И (РаспределениеЗапасов.Склад = &Склад)
			|			И (РаспределениеЗапасов.Номенклатура = ТаблицаАналогов.АналогНоменклатура)
			|			И (РаспределениеЗапасов.Характеристика = ТаблицаАналогов.АналогХарактеристика)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаАналогов.Характеристика) КАК РСК_ЗапросАналогов
			|ПО ХарактеристикиНоменклатуры.Ссылка = РСК_ЗапросАналогов.Характеристика";
			
		КонецЕсли;
		
		Если НесколькоСкладов Тогда
			ПодстрокаЗамены = СтрЗаменить(ПодстрокаЗамены, "= &Склад", "В(&Склад)");
		КонецЕсли;
		
	#КонецВставки

	КонецЕсли;

	Возврат ПодстрокаЗамены;

КонецФункции

//-- КонецЗадачи 23959
