
&После("ОбработкаЗаполнения")
Процедура РСК_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17531
//e1cib/data/Документ.Задание?ref=bb163964a2ac42cd49116e65acb2bf5c
	Если РСК_ВызовСервера.ЕстьРоль("РСК_МенеджерПоВыдачеТСР") Тогда
		РСК_ВыдачаТСР = Истина;
		
		//Если НЕ ЗначениеЗаполнено(Приоритет) Тогда
		//	Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний", Истина);
		//КонецЕсли;
	//++ РС Консалт: Трофимов Евгений 13.10.2022 Тикет 20965
	//e1cib/data/Документ.Задание?ref=bdc83380f664d5bb4898b38b648fea97
	//5. При создании Задания и при открытии формы Выбор транспорта для
	//создания заданий на перевозку - при установке типа исполнителя перевозки 
	//по умолчанию ставить "Перевозчик"
	Иначе
		ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
	//-- КонецТикета 20965
	КонецЕсли;
//-- КонецЗадачи 17531	
КонецПроцедуры

&После("ПередЗаписью")
Процедура РСК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьВесОбъемПоУпаковкам();
	ИзменитьСтатусНаОтгруженВАктахТСР();
	//++ РС Консалт: Минаков А.С. Задача 20226
	ПроверитьЗаполнениеНакладных(Отказ)
	//++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 18.11.2022 Задача 21979
//e1cib/data/Документ.Задание?ref=960157bd91fdb1dd40c034a9ff351dad
Процедура ПересчитатьВесОбъемПоУпаковкам() Экспорт

	Если НЕ РСК_ВыдачаТСР Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Распоряжения.Распоряжение КАК Распоряжение,
		|	Распоряжения.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ Распоряжения
		|ИЗ
		|	&Распоряжения КАК Распоряжения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Распоряжения.Распоряжение КАК Распоряжение,
		|	Распоряжения.КлючСвязи КАК КлючСвязи,
		|	ПоручениеЭкспедитору.РСК_Номенклатура КАК Номенклатура,
		|	ПоручениеЭкспедитору.РСК_Количество КАК КоличествоУпаковок,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка
		|ИЗ
		|	Распоряжения КАК Распоряжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ПО Распоряжения.Распоряжение = ПоручениеЭкспедитору.Ссылка";
	
	Запрос.УстановитьПараметр("Распоряжения", Распоряжения.Выгрузить(,"Распоряжение,КлючСвязи"));
	ТаблицаУпаковок = Запрос.Выполнить().Выгрузить();
	ТаблицаВесОбъем = РСК_ВызовСервера.ПолучитьВГХпоДаннымУпаковкиИзТаблицы(ТаблицаУпаковок);
	Фильтр = Новый Структура("Номенклатура,КоличествоУпаковок,Упаковка");
	Для Каждого Стр Из Распоряжения Цикл
		СтрокаУпаковки = ТаблицаУпаковок.Найти(Стр.Распоряжение,"Распоряжение");
		Если СтрокаУпаковки = Неопределено Тогда
			Стр.Вес = 0;
			Стр.Объем = 0;
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Фильтр, СтрокаУпаковки);
		ВесОбъем = ТаблицаВесОбъем.НайтиСтроки(Фильтр)[0];
		Стр.Вес = ВесОбъем.Вес / 1000;
		Стр.Объем = ВесОбъем.Объем;
	КонецЦикла;
	
	Для Каждого Стр Из Маршрут Цикл
		ТаблицаМаршрута = Распоряжения.Выгрузить(Новый Структура("КлючСвязи", Стр.КлючСвязи));
		Стр.Вес = ТаблицаМаршрута.Итог("Вес");
		Стр.Объем = ТаблицаМаршрута.Итог("Объем");
	КонецЦикла;
	
	Вес = Распоряжения.Итог("Вес");
	Объем = Распоряжения.Итог("Объем");
	
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17531
//e1cib/data/Документ.Задание?ref=bb163964a2ac42cd49116e65acb2bf5c
Процедура ИзменитьСтатусНаОтгруженВАктахТСР()

	Если НЕ РСК_ВыдачаТСР Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыЗаданийНаПеревозку.Отправлено Тогда
		
		ИзменяемыеСтатусыАктов = Новый Массив;
		ИзменяемыеСтатусыАктов.Добавить(Перечисления.РСК_СтатусыАктовВыдачи.ПустаяСсылка());
		ИзменяемыеСтатусыАктов.Добавить(Перечисления.РСК_СтатусыАктовВыдачи.Создан);
		ИзменяемыеСтатусыАктов.Добавить(Перечисления.РСК_СтатусыАктовВыдачи.Подготовлен);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПоручениеЭкспедитору.Ссылка КАК Акт
			|ИЗ
			|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
			|ГДЕ
			|	ПоручениеЭкспедитору.Ссылка В(&МассивАктов)
			|	И ПоручениеЭкспедитору.РСК_СтатусАктаВыдачиТСР В(&ИзменяемыеСтатусыАктов)
			|	И НЕ ПоручениеЭкспедитору.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("МассивАктов", Распоряжения.Выгрузить().ВыгрузитьКолонку("Распоряжение"));
		Запрос.УстановитьПараметр("ИзменяемыеСтатусыАктов", ИзменяемыеСтатусыАктов);
	
		МассивАктов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Акт");
		
		Для Каждого Акт Из МассивАктов Цикл
			оАкт = Акт.ПолучитьОбъект();
			оАкт.РСК_СтатусАктаВыдачиТСР = Перечисления.РСК_СтатусыАктовВыдачи.Отгружен;
			оАкт.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеНакладных(Отказ)
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	Если РСК_ВыдачаТСР Тогда
		Возврат
	КонецЕсли;	
	
	Если Не Статус = Перечисления.СтатусыЗаданийНаПеревозку.Отправлено
		И Не Статус = Перечисления.СтатусыЗаданийНаПеревозку.Закрыто Тогда
		Возврат
	КонецЕсли;	
	
	Для Каждого СтрокаТч Из Распоряжения Цикл
		Если Не ЗначениеЗаполнено(СтрокаТч.РСК_Накладная) Тогда
			ОбщегоНазначения.СообщитьПользователю("Для " + СтрокаТч.Распоряжение + " не указана накладная", СтрокаТч.Распоряжение,,, Отказ)
		КонецЕсли
	КонецЦикла
	//++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры	

&После("ПриЗаписи")
Процедура РСК_ПриЗаписи(Отказ)
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	РСК_ВызовСервера.ЗапускВыполненияФоновогоИсключенияРасходногоОрдера(Ссылка)
	//++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура РСК_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	Перем ПометитьНеДоставленные;
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("ПометитьНеДоставленные", ПометитьНеДоставленные)
		И ПометитьНеДоставленные Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ДатаОтгрузки = ?(ЗначениеЗаполнено(ДатаВремяРейсаПланС), НачалоДня(ДатаВремяРейсаПланС), НачалоДня(ТекущаяДата()));
		
		МассивРаспоряжений = Новый Массив;
		МассивНакладных = Новый Массив; 
		Для Каждого СтрокаТч Из Маршрут Цикл
			Если Не СтрокаТч.Доставлено Тогда
				НайденныеСтроки = Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаТч.КлючСвязи));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					МассивРаспоряжений.Добавить(НайденнаяСтрока.Распоряжение);
					
					Если ЗначениеЗаполнено(НайденнаяСтрока.РСК_Накладная) Тогда
						МассивНакладных.Добавить(НайденнаяСтрока.РСК_Накладная)
					КонецЕсли
				КонецЦикла
			КонецЕсли
		КонецЦикла;
		
		Для Каждого Накладная Из МассивНакладных Цикл
			ДокументОбъект = Накладная.ПолучитьОбъект();
			ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
			ДокументОбъект.УстановитьПометкуУдаления(Истина)
		КонецЦикла;
			
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ордер,
		|	ЕСТЬNULL(ОтборРазмещениеТоваров.Ссылка, ЗНАЧЕНИЕ(Документ.ОтборРазмещениеТоваров.ПустаяСсылка)) КАК Отбор
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
		|		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = ОтборРазмещениеТоваров.Распоряжение
		|			И (НЕ ОтборРазмещениеТоваров.ПометкаУдаления)
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение В(&Распоряжения)
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ЗаданиеНаПеревозку = &Ссылка");
		
		Запрос.УстановитьПараметр("Распоряжения", МассивРаспоряжений);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДокументОбъект = Выборка.Ордер.ПолучитьОбъект();
			ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
			
			Если Не Выборка.Отбор.Пустая() Тогда
				ДокументОбъект = Выборка.Отбор.ПолучитьОбъект();
				ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольПриПроведении", Истина);
				ДокументОбъект.УстановитьПометкуУдаления(Истина);
			КонецЕсли	
			
		КонецЦикла;
		
		Для Каждого Накладная Из МассивНакладных Цикл
			
			НовыйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
			НовыйОрдер.Заполнить(Неопределено);
			НовыйОрдер.Дата = ДатаОтгрузки;
			Если СкладыСервер.ИспользоватьАдресноеХранение(НовыйОрдер.Склад, НовыйОрдер.Помещение, НовыйОрдер.Дата) Тогда
				НовыйОрдер.ЗонаПриемки = Справочники.СкладскиеЯчейки.ЗонаПриемкиПоУмолчанию(НовыйОрдер.Склад, НовыйОрдер.Помещение, НовыйОрдер.ЗонаПриемки)
			КонецЕсли; 
			НовыйОрдер.СкладскаяОперация = Перечисления.СкладскиеОперации.ВозвратНеПринятыхТоваров;
			НовыйОрдер.ХозяйственнаяОперация = Накладная.ХозяйственнаяОперация;
			
			Если ТипЗнч(Накладная) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				НовыйОрдер.Склад = Накладная.Склад;
				НовыйОрдер.Отправитель = Накладная.Партнер
			ИначеЕсли ТипЗнч(Накладная) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
				НовыйОрдер.Склад = Накладная.СкладПолучатель;
				НовыйОрдер.Отправитель = Накладная.СкладОтправитель
			КонецЕсли;
			
			Для Каждого СтрокаТч Из Накладная.Товары Цикл
				ЗаполнитьЗначенияСвойств(НовыйОрдер.Товары.Добавить(), СтрокаТч)
			КонецЦикла;	
			
			Попытка
				Если НовыйОрдер.ПроверитьЗаполнение() Тогда
					НовыйОрдер.Записать(РежимЗаписиДокумента.Проведение)
				Иначе
					НовыйОрдер.Записать()
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + НовыйОрдер.Ссылка, НовыйОрдер.Ссылка)
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать приходный ордер по накладной " + Накладная + " по причине " + ОписаниеОшибки(), Накладная) 
			КонецПопытки			
			
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь)
	КонецЕсли
	//++ РС Консалт: Минаков А.С. Задача 20226

КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура РСК_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//++ РС Консалт: Трофимов Евгений 01.11.2022 Тикет 21573
	//e1cib/data/Документ.Задание?ref=8cabafb2e2bb17df406f974e2f52c112
	Если РСК_ВызовСервера.ЕстьРоль("РСК_МенеджерПоВыдачеТСР") Тогда
		РеквизитПриоритет = ПроверяемыеРеквизиты.Найти("Приоритет");
		Если РеквизитПриоритет <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитПриоритет);
		КонецЕсли;
			
	КонецЕсли;
	//-- КонецТикета 21573	
КонецПроцедуры

