Функция СведенияОВнешнейОбработке() Экспорт

	ДанныеДляРег = Новый Структура();
	ДанныеДляРег.Вставить("Наименование", "Ввод аналогов и замен");
	ДанныеДляРег.Вставить("БезопасныйРежим", Истина);
	ДанныеДляРег.Вставить("Версия", "1.0");
	ДанныеДляРег.Вставить("Информация", "Обработка для ввода аналогов и замен");
	ДанныеДляРег.Вставить("Вид", "ДополнительнаяОбработка");

	ТабЗнКоманды = Новый ТаблицаЗначений;
	ТабЗнКоманды.Колонки.Добавить("Идентификатор");
	ТабЗнКоманды.Колонки.Добавить("Использование");
	ТабЗнКоманды.Колонки.Добавить("Представление");

	НовСтрока = ТабЗнКоманды.Добавить();
	НовСтрока.Идентификатор = "РСК_ВводАналоговИЗамен";
	НовСтрока.Использование = "ОткрытиеФормы";
	НовСтрока.Представление = "Ввод аналогов и замен";
	ДанныеДляРег.Вставить("Команды", ТабЗнКоманды);

	Возврат ДанныеДляРег;

КонецФункции