
&ИзменениеИКонтроль("ТекстЗапросаОМенеджерах")
Функция РСК_ТекстЗапросаОМенеджерах(НомерПоследнегоПакета, Запрос)

	НомерПоследнегоПакета = НомерПоследнегоПакета + 1;

	СхемаДляОтбораПользователей = Отчеты.СравнительныйАнализПоказателейРаботыМенеджеров.ПолучитьМакет("СхемаДляОтбораПользователей");

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаДляОтбораПользователей, КомпоновщикНастроек.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ТекстЗапроса = МакетКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Запрос;

	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;

	НайденнаяПозицияИЗ = СтрНайти(ТекстЗапроса,"ИЗ");
	Если НайденнаяПозицияИЗ <> 0 Тогда
		ТекстЗапроса = Лев(ТекстЗапроса,НайденнаяПозицияИЗ - 1) + "  ПОМЕСТИТЬ ОтборПоМенеджерам
		|  " + Прав(ТекстЗапроса,СтрДлина(ТекстЗапроса) - НайденнаяПозицияИЗ + 1);

	КонецЕсли;

	НомерПоследнегоПакета = НомерПоследнегоПакета + 1;
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	|ПОМЕСТИТЬ ОбъектыРасчетовМенеджеров
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ 
	#Удаление
	|	ОбъектыРасчетов.Менеджер В (ВЫБРАТЬ Менеджер ИЗ ОтборПоМенеджерам)
	#КонецУдаления
	#Вставка                                      
	//+РС Консалт Михайлов А.М. 13 октября 2022 г. 18:07:08                  
	//при таком отборе выше- отбирает все объекты расчетов (т.к. поле выбрано Ссылка в запросе)
	|	ОбъектыРасчетов.Менеджер В (ВЫБРАТЬ Ссылка ИЗ ОтборПоМенеджерам)
	//-РС Консалт Михайлов А.М. 13 октября 2022 г. 18:07:13 
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;

КонецФункции

&Вместо("ТекстЗапросаОПрибыли")
Функция РСК_ТекстЗапросаОПрибыли(СоответствиеЗапросыДанные, НомерПоследнегоПакета, СтруктураПериодовФормированияОтчета)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(СоответствиеЗапросыДанные, НомерПоследнегоПакета, СтруктураПериодовФормированияОтчета);
	Возврат Результат;
КонецФункции
