
&НаСервере
&После("ПриСозданииНаСервере")
Процедура РСК_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТипыСертификатовКПечати") Тогда 
		Если ЗначениеЗаполнено(Параметры.ТипыСертификатовКПечати) Тогда
			ВидыСертификатов.Загрузить(РСК_Сервер.ПроизвестиЧтениеТаблицыИзXMLСервер(Параметры.ТипыСертификатовКПечати));		
		Иначе
			ИнициализироватьСписокТиповСертификатов();		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ИнициализироватьСписокТиповСертификатов()
	
	НоваяСтрока = ВидыСертификатов.Добавить();
	НоваяСтрока.ТипСертификата = НСтр("ru = 'РУ';
	|en = 'Registration certificate'"); 
	НоваяСтрока = ВидыСертификатов.Добавить();
	НоваяСтрока.ТипСертификата = НСтр("ru = 'Технический паспорт';
	|en = 'Technical passport'"); 
	НоваяСтрока = ВидыСертификатов.Добавить();
	НоваяСтрока.ТипСертификата = НСтр("ru = 'Инструкция по применению';
	|en = 'Instructions for use'"); 
	НоваяСтрока = ВидыСертификатов.Добавить();
	НоваяСтрока.ТипСертификата = НСтр("ru = 'Гарантийный талон';
	|en = 'Warranty card'");
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПриЗакрытии")
Процедура РСК_ПриЗакрытии(ЗавершениеРаботы)

	Если СохранитьПараметры И НЕ ЗавершениеРаботы Тогда

		СтруктураПараметров = ИзменяемыеРеквизиты(ЭтаФорма);
		#Вставка
		СтруктураПараметров.Вставить("РСК_СертификатыКПечати",XMLСтрокаТиповСертификатов());
		#КонецВставки
		ОповеститьОВыборе(СтруктураПараметров);

	КонецЕсли;

КонецПроцедуры 

&НаСервере
Функция XMLСтрокаТиповСертификатов() 
	Возврат РСК_Сервер.ПроизвестиЗаписьТаблицыВXMLСервер(ВидыСертификатов.Выгрузить());	
КонецФункции