
&После("ПередЗаписью")
Процедура РСК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	УдалитьПустыхИсполнителей();
	
	//++ РС Консалт: Трофимов Евгений 10.01.2023 Задача 22873
	//e1cib/data/Документ.Задание?ref=a228da5aa43829244389d2f8624bf3c6
	ДобавитьИсполнителяПриПеремещении();                  
	//-- КонецЗадачи 22873	
	
КонецПроцедуры

//Швыряева Инна: почему в Отборах появляется второй Исполнитель, если исполнитель фактически был один?
//++ РС Консалт: Трофимов Евгений 24.12.2022 Задача 22673
//e1cib/data/Документ.Задание?ref=9101d1f9ae8437de4cf0d52d47dd0665
Процедура УдалитьПустыхИсполнителей()

	тзИсполнители = Исполнители.Выгрузить();
	УдаляемыеСтроки = Новый Массив;
	Для Каждого Стр Из тзИсполнители Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			УдаляемыеСтроки.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		тзИсполнители.Удалить(УдаляемаяСтрока);
	КонецЦикла;                                
	Исполнители.Загрузить(тзИсполнители);
	
	Если Исполнители.Количество() > 0 И НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Исполнители[0].Исполнитель;
	КонецЕсли;

КонецПроцедуры

//Швыряева Инна: Если отбор - является перемещением между ячейками, то в список исполнителей добавлять исполнителя из вкладки «Основное»
//++ РС Консалт: Трофимов Евгений 10.01.2023 Задача 22873
//e1cib/data/Документ.Задание?ref=a228da5aa43829244389d2f8624bf3c6
Процедура ДобавитьИсполнителяПриПеремещении()

	Если ВидОперации <> Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение
		ИЛИ НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат;
	КонецЕсли;
	
	Если Исполнители.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НС = Исполнители.Добавить();
	НС.Исполнитель = Исполнитель;
	
КонецПроцедуры
