// служебная функция получения значения реквизита объекта (выполняется на сервере)
&НаСервере
Функция ЗначениеРеквизита(Объект,ИмяРеквизита);
    Возврат Объект[ИмяРеквизита];
КонецФункции
// обработчик события «ПриИзменении» поля «Контрагент» в табличном поле «Контрагенты»

&НаКлиенте
Процедура САВ_ТоварыНоменклатураПриИзмененииПосле(Элемент)

КонецПроцедуры



Функция ТекстНоменклатуры(Ном)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
		|	НП.Ссылка КАК Номенклатура	
		|ИЗ Справочник.НоменклатураКонтрагентов КАК НП
		|ГДЕ 
		|	НП.Владелец=&Партнер 
		|И НП.Номенклатура=&Номенклатура";

	Запрос.УстановитьПараметр("Партнер",Объект.Клиент);
	Запрос.УстановитьПараметр("Номенклатура",Ном);
	Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
	
	Возврат Результат.Номенклатура;
Иначе
	Возврат "";
КонецЕсли;

		
	КонецФункции

&НаСервере
	Процедура САВ_НоменклатураПартнераЗаполнитьПослеНаСервере()
		
	КонецПроцедуры

&НаКлиенте
	Процедура САВ_НоменклатураПартнераЗаполнитьПосле(Команда)

	КонецПроцедуры

&НаСервере
&После("НастроитьЭлементыФормы")
	Процедура РСК_НастроитьЭлементыФормы()
		//Элементы.ТоварыНоменклатураПокупателяПредставление.Видимость   = Истина; 
		//Элементы.ТоварыНоменклатураПокупателяПредставление.ТолькоПросмотр=Ложь;
		//Элементы.ТоварыНоменклатураПокупателяПредставление.Доступность=Истина; 
		//
		//Элементы.ТоварыЗапросСрокПоставкиПредставление.Видимость = Истина;
		//Элементы.ТоварыЗапросСрокПоставкиПредставление.ТолькоПросмотр=Ложь;
		//Элементы.ТоварыЗапросСрокПоставкиПредставление.Доступность=Истина; 
	КонецПроцедуры

&НаКлиенте
Процедура РСК_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)

	
	КонецПроцедуры
	
	Процедура УстановитьДатуДействия() 
		Если Объект.Статус = Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует Тогда
		объект.СрокДействия=ТекущаяДата();
		Если НЕ Объект.Сделка=Неопределено Тогда
		ВидСделки=Объект.Сделка.ВидСделки;      
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	СЖ.СрокЖизни
			|ИЗ
			|  	Справочник.СрокЖизниКП КАК СЖ
			|ГДЕ
			|	СЖ.ВидСделокСКлиентом=&ВСК";
			Запрос.УстановитьПараметр("ВСК",Объект.Сделка.ВидСделки);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Объект.СрокДействия=ТекущаяДата()+Рез.СрокЖизни*24*3600;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
				
			
		
		
		
	КонецПроцедуры

&НаКлиенте
Процедура РСК_СтатусПриИзмененииПосле(Элемент)
	Если Элемент.ТекстРедактирования="Действует" Тогда 
		УстановитьДатуДействия(); 
	КонецЕсли;
	
	КонецПроцедуры
	
	