 
//++ РС Консалт: Минаков А.С.: Неисправность из-за режима совместимости  
&ИзменениеИКонтроль("ОсобенностиУчетаОтКоторыхЗависятРеквизитыСерий")
Функция РСК_ОсобенностиУчетаОтКоторыхЗависятРеквизитыСерий()

	ОсобенностиУчетаОтКоторыхЗависятРеквизитыСерий = Новый Массив;

	ОписанияИспользованияРеквизитовСерии = Справочники.ВидыНоменклатуры.ОписанияИспользованияРеквизитовСерии();

	Для Каждого Описания из ОписанияИспользованияРеквизитовСерии Цикл

		Если Не ПустаяСтрока(Описания.ОсобенностиУчета) Тогда

			ИменаОсобенностей = СтрРазделить(Описания.ОсобенностиУчета, ",");

			Для Каждого ИмяОсобенности из ИменаОсобенностей Цикл
				
				#Вставка
				//++ РС Консалт: Минаков А.С.: Неисправность из-за режима совместимости 
				Если ИмяОсобенности = "ПродукцияМаркируемаяДляГИСМ" Тогда
					ЗначениеПеречисления = Неопределено
				Иначе
					//++ РС Консалт: Минаков А.С.: Неисправность из-за режима совместимости 
					#КонецВставки
					ЗначениеПеречисления = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры." + ИмяОсобенности);
					#Вставка
					//++ РС Консалт: Минаков А.С.: Неисправность из-за режима совместимости 
				КонецЕсли;
				//++ РС Консалт: Минаков А.С.: Неисправность из-за режима совместимости 
				#КонецВставки

				Если ОсобенностиУчетаОтКоторыхЗависятРеквизитыСерий.Найти(ЗначениеПеречисления) = Неопределено Тогда
					ОсобенностиУчетаОтКоторыхЗависятРеквизитыСерий.Добавить(ЗначениеПеречисления);
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	Возврат ОсобенностиУчетаОтКоторыхЗависятРеквизитыСерий;

КонецФункции