
Процедура СверитьДокументы(ПараметрыСверки, ИмяВремФ) Экспорт
	
	#Область Настройки
	
	ПараметрыЗначение = ЗначениеИзСтрокиВнутр(ПараметрыСверки);
	
	СписокДокументов = ПараметрыЗначение.СписокДокументов;
	СписокРегистров = ПараметрыЗначение.СписокРегистров;
	
	Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", ПараметрыЗначение.Организация);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыЗначение.НачалоПериода);	
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыЗначение.КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Реамед", реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("Реамед"));
	Запрос.УстановитьПараметр("Аудиотехник", реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("Аудиотехник"));
	Запрос.УстановитьПараметр("КонтрагентВладимирРП", реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("РС_Контрагент", "Продажа в розницу - Владимир"));
	Запрос.УстановитьПараметр("СкладБольницаСА", реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("РС_Склад", "Больница СА"));
	Запрос.УстановитьПараметр("СтатьяИзлишки", реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("РС_Статья", "Излишки"));
	Запрос.УстановитьПараметр("СтатьяВнутрПередача", реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("РС_Статья", "Перечисление денежных средств на другой счет"));
	Запрос.УстановитьПараметр("СтатьяНедостачиПриИнвентаризации", реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("РС_Статья", "Недостачи при инвентаризации"));
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(ПараметрыЗначение.ДатаОстатков, ВидГраницы.Включая));
	
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("КонтрагентИНН", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("КонтрагентКПП", ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("КонтрагентЮридическоеФизическоеЛицо", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("КонтрагентНаименование", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("КонтрагентНаименованиеПолное", ОбщегоНазначения.ОписаниеТипаСтрока(270));
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("Многострочный", Новый ОписаниеТипов("Булево")); 
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("ВидНоменклатуры");
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("НомерБаза");
	ПараметрыЗначение.ТаблицаСверки.Колонки.Добавить("ТаблицаТоваров");
	
	ПараметрыЗначение.ТаблицаХозрасчетный.Колонки.Добавить("КонтрагентИНН", ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ПараметрыЗначение.ТаблицаХозрасчетный.Колонки.Добавить("КонтрагентКПП", ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ПараметрыЗначение.ТаблицаХозрасчетный.Колонки.Добавить("КонтрагентЮридическоеФизическоеЛицо", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ПараметрыЗначение.ТаблицаХозрасчетный.Колонки.Добавить("КонтрагентНаименование", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ПараметрыЗначение.ТаблицаХозрасчетный.Колонки.Добавить("КонтрагентНаименованиеПолное", ОбщегоНазначения.ОписаниеТипаСтрока(270));
	
	МассивКонтрагенты = ПараметрыЗначение.МассивКонтрагенты;
	МассивДоговоры = ПараметрыЗначение.МассивДоговоры;
	МассивСуммы = ПараметрыЗначение.МассивСуммы;
	МассивТовары = ПараметрыЗначение.МассивТовары;
	
	ПоГТД = ПараметрыЗначение.ПоГТД;
	ПоТоварам = ПараметрыЗначение.ПоТоварам;
	
	ТекстЗапроса = ПолучитьТекстЗапроса(СписокДокументов);
	ТекстЗапросаТовары = ПолучитьТекстЗапросаТовары(СписокДокументов); 
	ТекстЗапросаРегистры = ПолучитьТекстЗапросаРегистры(СписокРегистров);
	
	ЗапросТоварыДекларации = Новый Запрос(
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТаможеннаяДекларацияИмпортТовары.Номенклатура) КАК Номенклатура,
	|	ТаможеннаяДекларацияИмпортТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(ТаможеннаяДекларацияИмпортТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортТовары.Ссылка.Проведен
	|	И УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТаможеннаяДекларацияИмпортТовары.ДокументПоступления) = &ГУИД
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаможеннаяДекларацияИмпортТовары.Номенклатура,
	|	ТаможеннаяДекларацияИмпортТовары.НомерГТД.Код");
	
	ОстаткиДеклараций = Новый Соответствие;
	
	#КонецОбласти
	
	#Область Документы
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		
		Запрос.Текст = ТекстЗапроса;
		
		Пакеты = Запрос.ВыполнитьПакет(); 
				
		Если ПоТоварам Тогда
			Если ЗначениеЗаполнено(ТекстЗапросаТовары) Тогда
				Запрос.Текст = ТекстЗапросаТовары;
				ТаблицаТовары = Запрос.Выполнить().Выгрузить();
				Если Не ПоГТД Тогда
					ТаблицаТовары.Свернуть("ГУИД, ГУИДНоменклатура, Наименование, НаименованиеПолное, Заказ, ВидНоменклатуры", "КоличествоПосле, КоличествоДо")
				КонецЕсли
			КонецЕсли
		КонецЕсли;	

		Для Сч = 0 По Пакеты.ВГраница() Цикл
			
			РезультатЗапроса = Пакеты.Получить(Сч);
			
			Выборка = РезультатЗапроса.Выбрать();	
			НомерСтроки = 0;
			ТекущийДокумент = "";
			ТекущийТип = "";
			ТекущийПрефикс = "";
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ТипДокумента = "КомплектацияНоменклатуры" Тогда
					Если ТекущийДокумент = Выборка.ГУИД 
						И ТекущийТип = Выборка.ТипДокументаЕРП
						И ТекущийПрефикс = Выборка.Префикс Тогда	
						НомерСтроки = НомерСтроки + 1
					Иначе
						НомерСтроки = 1;
						ТекущийДокумент = Выборка.ГУИД;
						ТекущийТип = Выборка.ТипДокументаЕРП;
						ТекущийПрефикс = Выборка.Префикс;
					КонецЕсли
				Иначе
					Если ТекущийДокумент = Выборка.ГУИД 
						И ТекущийТип = Выборка.ТипДокументаЕРП Тогда	
						НомерСтроки = НомерСтроки + 1
					Иначе
						НомерСтроки = 1;
						ТекущийДокумент = Выборка.ГУИД;
						ТекущийТип = Выборка.ТипДокументаЕРП;
					КонецЕсли
				КонецЕсли;
				
				НоваяСтрока = ПараметрыЗначение.ТаблицаСверки.Добавить();
				НоваяСтрока.ГУИД = Выборка.ГУИД;
				НоваяСтрока.ТипДокумента = Выборка.ТипДокумента;
				НоваяСтрока.ТипДокументаЕРП = Выборка.ТипДокументаЕРП;
				НоваяСтрока.ДатаЕРП = Выборка.Дата;
				НоваяСтрока.ПроведенЕРП = Выборка.Проведен;
				
				Если ТекущийТип = "ПорчаТоваров" Тогда
					НомерБаза = Лев(Выборка.Номер, 2) + Выборка.Префикс;// + Сред(Выборка.Номер, 5);
					НоваяСтрока.НомерБаза = НомерБаза;
					НоваяСтрока.ВидНоменклатуры = Выборка.ВидНоменклатуры.Наименование;
					//ДлинаНомера = СтрДлина(Формат(НомерСтроки, "ЧГ=0"));	
					//НоваяСтрока.НомерЕРП = Лев(НомерБаза, 5) + Сред(Выборка.Номер, 6 + ДлинаНомера) + НомерСтроки;	
				ИначеЕсли ТекущийТип = "ОприходованиеИзлишковТоваров" И Выборка.ТипДокумента = "КомплектацияНоменклатуры" Тогда
					НомерБаза = Лев(Выборка.Номер, 2) + "ОТ" + Сред(Выборка.Номер, 5);
					НоваяСтрока.НомерЕРП = НомерБаза;
					НоваяСтрока.ВидНоменклатуры = Выборка.ВидНоменклатуры.Наименование;
					//ДлинаНомера = СтрДлина(Формат(НомерСтроки, "ЧГ=0"));	
					//НоваяСтрока.НомерЕРП = Лев(НомерБаза, 5) + Сред(Выборка.Номер, 6 + ДлинаНомера) + НомерСтроки
				ИначеЕсли ТекущийТип = "СписаниеНедостачТоваров" И Выборка.ТипДокумента = "КомплектацияНоменклатуры" Тогда
					НомерБаза = Лев(Выборка.Номер, 2) + "СТ" + Сред(Выборка.Номер, 5);
					НоваяСтрока.НомерЕРП = НомерБаза;
					НоваяСтрока.ВидНоменклатуры = Выборка.ВидНоменклатуры.Наименование;
					//ДлинаНомера = СтрДлина(Формат(НомерСтроки, "ЧГ=0"));	
					//НоваяСтрока.НомерЕРП = Лев(НомерБаза, 5) + Сред(Выборка.Номер, 6 + ДлинаНомера) + НомерСтроки
				ИначеЕсли ТекущийТип = "ПриобретениеТоваровУслуг" И Выборка.Многострочный Тогда
					НомерБаза = Лев(Выборка.Номер, 2) + "ПТ" + Сред(Выборка.Номер, 5);
					ДлинаНомера = СтрДлина(Формат(НомерСтроки, "ЧГ=0"));	
					НоваяСтрока.НомерЕРП = Лев(НомерБаза, 5) + Сред(Выборка.Номер, 6 + ДлинаНомера) + НомерСтроки;
					НоваяСтрока.Многострочный = Истина
				ИначеЕсли ТекущийТип = "СписаниеБезналичныхДенежныхСредств" И Выборка.ТипДокумента = "КорректировкаДолга" Тогда
					НомерБаза = Лев(Выборка.Номер, 2) + "КВ" + Сред(Выборка.Номер, 5);
					ДлинаНомера = СтрДлина(Формат(НомерСтроки, "ЧГ=0"));	
					НоваяСтрока.НомерЕРП = Лев(НомерБаза, 5) + Сред(Выборка.Номер, 6 + ДлинаНомера) + НомерСтроки;
					НоваяСтрока.Многострочный = Истина;
					
					НомерБаза = Лев(Выборка.Номер, 2) + "ЗА" + Сред(Выборка.Номер, 5); 
					ДлинаНомера = СтрДлина(Формат(НомерСтроки, "ЧГ=0"));	
					
					НоваяСтрока = ПараметрыЗначение.ТаблицаСверки.Добавить();
					НоваяСтрока.ГУИД = Выборка.ГУИД;
					НоваяСтрока.ТипДокумента = Выборка.ТипДокумента;
					НоваяСтрока.ТипДокументаЕРП = Выборка.ТипДокументаЕРП;
					НоваяСтрока.ДатаЕРП = Выборка.Дата;
					НоваяСтрока.ПроведенЕРП = Выборка.Проведен;
					НоваяСтрока.НомерЕРП = Лев(НомерБаза, 5) + Сред(Выборка.Номер, 6 + ДлинаНомера) + НомерСтроки;	
					НоваяСтрока.Многострочный = Истина	
				Иначе
					НоваяСтрока.НомерЕРП = ПреобразоватьНомер(Выборка.Номер, Выборка.ТипДокументаЕРП, Выборка.ТипДокумента)
				КонецЕсли; 
				
				Если Не МассивКонтрагенты.Найти(НоваяСтрока.ТипДокумента) = Неопределено Тогда
					Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
						НоваяСтрока.КонтрагентЕРП = Выборка.Контрагент;
						НоваяСтрока.КонтрагентНаименование = Выборка.КонтрагентНаименование;
						НоваяСтрока.КонтрагентИНН = Выборка.КонтрагентИНН;
						НоваяСтрока.КонтрагентКПП = Выборка.КонтрагентКПП;
						НоваяСтрока.КонтрагентЮридическоеФизическоеЛицо = ЗначениеПеречисления(Выборка.КонтрагентЮридическоеФизическоеЛицо);
						НоваяСтрока.КонтрагентНаименованиеПолное = Выборка.КонтрагентНаименованиеПолное
					КонецЕсли
				КонецЕсли;
				
				Если Не МассивДоговоры.Найти(НоваяСтрока.ТипДокумента) = Неопределено Тогда
					НоваяСтрока.ДоговорЕРП = СокрЛП(Выборка.Договор);
					ПреобразоватьДоговор(НоваяСтрока, Выборка, "ДоговорЕРП")
				КонецЕсли;
				
				Если Не МассивСуммы.Найти(НоваяСтрока.ТипДокумента) = Неопределено Тогда
					НоваяСтрока.СуммаДокументаЕРП = Выборка.СуммаДокумента	
				КонецЕсли;
				
				Попытка
					НоваяСтрока.ЭтоФизЛицо = Выборка.ЭтоФизЛицо
				Исключение
				КонецПопытки;
				
				Если ПоТоварам Тогда
					Если Не МассивТовары.Найти(НоваяСтрока.ТипДокумента) = Неопределено Тогда
						
						Если ПоГТД И НоваяСтрока.ТипДокументаЕРП = "ПриобретениеТоваровУслуг" И ЗначениеЗаполнено(Выборка.ЗаказДата) Тогда
							СтруктураПоиска = Новый Структура("ГУИД, Заказ", Выборка.ГУИД, Выборка.ЗаказДата)
						ИначеЕсли НоваяСтрока.ТипДокументаЕРП = "ПорчаТоваров" Тогда
							СтруктураПоиска = Новый Структура("ГУИД, Заказ, ВидНоменклатуры", Выборка.ГУИД, Выборка.Префикс, Выборка.ВидНоменклатуры)
						ИначеЕсли НоваяСтрока.ТипДокумента = "КомплектацияНоменклатуры"
							И (НоваяСтрока.ТипДокументаЕРП = "ОприходованиеИзлишковТоваров" Или НоваяСтрока.ТипДокументаЕРП = "СписаниеНедостачТоваров") Тогда
							СтруктураПоиска = Новый Структура("ГУИД, ВидНоменклатуры", Выборка.ГУИД, Выборка.ВидНоменклатуры)
						Иначе
							СтруктураПоиска = Новый Структура("ГУИД", Выборка.ГУИД)
						КонецЕсли;
						
						НайденныеСтроки = ТаблицаТовары.НайтиСтроки(СтруктураПоиска);
						
						Если ПоГТД И НоваяСтрока.ТипДокументаЕРП = "ПриобретениеТоваровУслуг" Тогда						
							
							ТаблицаНомераГТД = ОстаткиДеклараций.Получить(Выборка.ГУИД);
							Если ТаблицаНомераГТД = Неопределено Тогда
								ЗапросТоварыДекларации.УстановитьПараметр("ГУИД", Выборка.ГУИД);
								ТаблицаНомераГТД = ЗапросТоварыДекларации.Выполнить().Выгрузить()
							КонецЕсли;
							
							Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
								СтруктураПоиска = Новый Структура("Номенклатура", НайденнаяСтрока.ГУИДНоменклатура);
								НайденныеСтрокиГТД = ТаблицаНомераГТД.НайтиСтроки(СтруктураПоиска);
								ОсталосьРаспределить = НайденнаяСтрока.КоличествоПосле;
								Для Каждого НайденнаяСтрокаГТД Из НайденныеСтрокиГТД Цикл
									
									Если ОсталосьРаспределить <= 0 Тогда
										Прервать
									КонецЕсли;
									
									Распределить = Мин(ОсталосьРаспределить, НайденнаяСтрокаГТД.Количество);
									
									НоваяСтрокаТовары = ТаблицаТовары.Добавить();
									ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, НайденнаяСтрока);
									НоваяСтрокаТовары.КоличествоПосле = Распределить;
									НоваяСтрокаТовары.НомерГТД = НайденнаяСтрокаГТД.НомерГТД;
									
									НайденнаяСтрока.КоличествоПосле = НайденнаяСтрока.КоличествоПосле - Распределить;
									НайденнаяСтрокаГТД.Количество = НайденнаяСтрокаГТД.Количество - Распределить;
									Если НайденнаяСтрока.КоличествоПосле <= 0 Тогда
										ТаблицаТовары.Удалить(НайденнаяСтрока)	
									КонецЕсли;
									Если НайденнаяСтрокаГТД.Количество <= 0 Тогда
										ТаблицаНомераГТД.Удалить(НайденнаяСтрокаГТД)	
									КонецЕсли;
									ОсталосьРаспределить = ОсталосьРаспределить - Распределить
									
								КонецЦикла
								
							КонецЦикла;
							
							ОстаткиДеклараций.Вставить(Выборка.ГУИД, ТаблицаНомераГТД);
							
							Если ЗначениеЗаполнено(Выборка.ЗаказДата) Тогда
								СтруктураПоиска = Новый Структура("ГУИД, Заказ", Выборка.ГУИД, Выборка.ЗаказДата)
							Иначе
								СтруктураПоиска = Новый Структура("ГУИД", Выборка.ГУИД)
							КонецЕсли;
							НайденныеСтроки = ТаблицаТовары.НайтиСтроки(СтруктураПоиска)
						КонецЕсли;	
						
						ТаблицаТоваров = Новый ТаблицаЗначений;
						ТаблицаТоваров.Колонки.Добавить("Номенклатура");
						ТаблицаТоваров.Колонки.Добавить("ГУИДНоменклатура");
						ТаблицаТоваров.Колонки.Добавить("Наименование");
						ТаблицаТоваров.Колонки.Добавить("НаименованиеПолное");
						ТаблицаТоваров.Колонки.Добавить("КоличествоПосле");
						ТаблицаТоваров.Колонки.Добавить("КоличествоДо");
						Если ПоГТД Тогда
							ТаблицаТоваров.Колонки.Добавить("НомерГТД")
						КонецЕсли;

						Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							ЗаполнитьЗначенияСвойств(ТаблицаТоваров.Добавить(), НайденнаяСтрока)
						КонецЦикла; 
						НоваяСтрока.ТаблицаТоваров = ТаблицаТоваров 
					КонецЕсли
				КонецЕсли;	
				
			КонецЦикла
		КонецЦикла
	КонецЕсли;
	
	#КонецОбласти	
	
	#Область Хзрасчетный
	
	Если ЗначениеЗаполнено(ТекстЗапросаРегистры) Тогда
		
		Запрос.Текст = ТекстЗапросаРегистры;	

		Пакеты = Запрос.ВыполнитьПакет();
		
		Для Сч = 0 По Пакеты.ВГраница() Цикл
			
			РезультатЗапроса = Пакеты.Получить(Сч);
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НоваяСтрока = ПараметрыЗначение.ТаблицаХозрасчетный.Добавить();
				НоваяСтрока.ТипДокумента = Выборка.ТипДокумента;
				
				Если НоваяСтрока.ТипДокумента = "ХозрасчетныйТовары" Тогда
					
					НоваяСтрока.ГУИД = Выборка.ГУИД;				
					НоваяСтрока.Номенклатура = Выборка.Наименование;
					НоваяСтрока.Наименование = Выборка.Наименование;
					НоваяСтрока.НаименованиеПолное = Выборка.НаименованиеПолное;
					НоваяСтрока.КоличествоЕРП = Выборка.Количество
					
				ИначеЕсли НоваяСтрока.ТипДокумента = "ХозрасчетныйРасчеты" Тогда
					
					НоваяСтрока.Валюта = Выборка.Валюта;
					НоваяСтрока.Договор = СокрЛП(Выборка.Договор);
					НоваяСтрока.СуммаЕРП = Выборка.Сумма;
					
					НоваяСтрока.Контрагент = Выборка.Контрагент;
					НоваяСтрока.КонтрагентНаименование = Выборка.КонтрагентНаименование;
					НоваяСтрока.КонтрагентИНН = Выборка.КонтрагентИНН;
					НоваяСтрока.КонтрагентКПП = Выборка.КонтрагентКПП;
					НоваяСтрока.КонтрагентЮридическоеФизическоеЛицо = ЗначениеПеречисления(Выборка.КонтрагентЮридическоеФизическоеЛицо);
					НоваяСтрока.КонтрагентНаименованиеПолное = Выборка.КонтрагентНаименованиеПолное;
					
					ПреобразоватьДоговор(НоваяСтрока, Выборка, "Договор")
					
				КонецЕсли	
				
			КонецЦикла
		КонецЦикла
	КонецЕсли;
	
	#КонецОбласти
	
	ЗначениеВФайл(ИмяВремФ, ПараметрыЗначение)
	
КонецПроцедуры

Процедура ПреобразоватьДоговор(Строка, Выборка, ИмяРеквизита)
	
	Если ЗначениеЗаполнено(Выборка.Заказ) Тогда
		Префикс = Выборка.Префикс;
		Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Заказ, "Номер"), Истина, Истина);
		Дата = Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Заказ, "Дата"), "ДФ=d.M.yy");
		
		Строка[ИмяРеквизита] = Строка[ИмяРеквизита] + "(" + Префикс + " " + Номер + " " + Дата + ")"	
	КонецЕсли
	
КонецПроцедуры

Функция ПреобразоватьНомер(Номер, ТипДокументаЕРП, ТипДокумента)
	
	НовыйНомер = Номер;
	Если ТипДокумента = "ПоступлениеТоваровУслуг" И ТипДокументаЕРП = "ПриобретениеУслугПрочихАктивов" Тогда
		НовыйНомер = Лев(Номер, 2) + "ПУ" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "ПоступлениеДопРасходов" И ТипДокументаЕРП = "ПриобретениеУслугПрочихАктивов" Тогда
		НовыйНомер = Лев(Номер, 2) + "ДР" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "ПоступлениеДопРасходов" И ТипДокументаЕРП = "ПриобретениеТоваровУслуг" Тогда
		НовыйНомер = Лев(Номер, 2) + "ДР" + Сред(Номер, 5)
	ИначеЕсли ТипДокументаЕРП = "ПередачаТоваровМеждуОрганизациями" Тогда
		НовыйНомер = Лев(Номер, 2) + "ИК" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "РеализацияТоваровУслуг" И ТипДокументаЕРП = "РеализацияУслугПрочихАктивов" Тогда
		НовыйНомер = Лев(Номер, 2) + "РУ" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "РеализацияТоваровУслуг" И ТипДокументаЕРП = "КорректировкаРеализации" Тогда
		НовыйНомер = Лев(Номер, 2) + "КР" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "СписаниеТоваров" И ТипДокументаЕРП = "КорректировкаРеализации" Тогда
		НовыйНомер = Лев(Номер, 2) + "КР" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "ОприходованиеТоваров" И ТипДокументаЕРП = "КорректировкаРеализации" Тогда
		НовыйНомер = Лев(Номер, 2) + "КР" + Сред(Номер, 5)
	ИначеЕсли ТипДокументаЕРП = "ВозвратТоваровМеждуОрганизациями" Тогда
		НовыйНомер = Лев(Номер, 2) + "ИК" + Сред(Номер, 5)	
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтПокупателя" И ТипДокументаЕРП = "КорректировкаРеализации" Тогда
		НовыйНомер = Лев(Номер, 2) + "КР" + Сред(Номер, 5) 
	ИначеЕсли ТипДокументаЕРП = "ОперацияПоЯндексКассе" Тогда
		НовыйНомер = Лев(Номер, 2) + "ЯК00" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "КорректировкаДолга" И ТипДокументаЕРП = "КорректировкаЗадолженности" Тогда
		НовыйНомер = Лев(Номер, 2) + "СЗ" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "КорректировкаДолга" И ТипДокументаЕРП = "ВзаимозачетЗадолженности" Тогда
		НовыйНомер = Лев(Номер, 2) + "ВЗ" + Сред(Номер, 5)
	ИначеЕсли ТипДокумента = "СчетФактураПолученный" И ТипДокументаЕРП = "СчетФактураВыданный" Тогда
		НовыйНомер = Лев(Номер, 2) + "ИК" + Сред(Номер, 5)	
	КонецЕсли; 
	
	Возврат НовыйНомер
	
КонецФункции

Процедура ЗарегатьДокументы(ПарамДляПередачи, КодПлана) Экспорт
	
	МассивДокументов = ЗначениеИзСтрокиВнутр(ПарамДляПередачи);
	
	МассивЗарегать = Новый Массив;
	Для Каждого Стр Из МассивДокументов Цикл	
		Док = Документы[Стр.ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.ГУИД));
		Если ОбщегоНазначения.СсылкаСуществует(Док) Тогда
			ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(Док.ПолучитьОбъект(), "ОбменУправлениеПредприятиемБухгалтерияПредприятия3", Неопределено)			
		КонецЕсли
	КонецЦикла
	
КонецПроцедуры	

Функция ПолучитьТекстЗапроса(СписокДокументов)
	
	ИтоговыйТекстЗапроса = "";
	
	Для Каждого Документ Из СписокДокументов Цикл 
		
		ТекстЗапроса = "";
		Выполнить("ТекстЗапроса_" + Документ + "(ТекстЗапроса)");
		
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			Если ЗначениеЗаполнено(ИтоговыйТекстЗапроса) Тогда
				ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + 
				"
				|;
				|"
			КонецЕсли;
			
			ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + ТекстЗапроса
			
		КонецЕсли
		
	КонецЦикла;
	
	Возврат ИтоговыйТекстЗапроса
	
КонецФункции

Функция ПолучитьТекстЗапросаТовары(СписокДокументов)
	
	ИтоговыйТекстЗапроса = "";
	
	Для Каждого Документ Из СписокДокументов Цикл 
		
		ТекстЗапроса = "";
		Выполнить("ТекстЗапросаТовары_" + Документ + "(ТекстЗапроса)");
		
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			Если ЗначениеЗаполнено(ИтоговыйТекстЗапроса) Тогда
				ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + 
				"
				|ОБЪЕДИНИТЬ ВСЕ
				|"
			КонецЕсли;
			
			ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + ТекстЗапроса
			
		КонецЕсли
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИтоговыйТекстЗапроса) Тогда
		ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса +	 
		"
		|УПОРЯДОЧИТЬ ПО
		|	Заказ"
	КонецЕсли;	
	
	Возврат ИтоговыйТекстЗапроса
	
КонецФункции
  
Функция ПолучитьТекстЗапросаРегистры(СписокРегистров)
	
	ИтоговыйТекстЗапроса = "";
	
	Для Каждого Регистр Из СписокРегистров Цикл 
		
		ТекстЗапроса = "";
		Выполнить("ТекстЗапроса_" + Регистр + "(ТекстЗапроса)");
		
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			Если ЗначениеЗаполнено(ИтоговыйТекстЗапроса) Тогда
				ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + 
				"
				|;
				|"
			КонецЕсли;
			
			ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + ТекстЗапроса
			
		КонецЕсли
		
	КонецЦикла;
	
	Возврат ИтоговыйТекстЗапроса
	
КонецФункции

Функция ЗначениеПеречисления(Значение)
	
	ОбъектМД = Значение.Метаданные();
	
	МенеджерПеречисления = Перечисления[ОбъектМД.Имя];
	ИндексЗначения = МенеджерПеречисления.Индекс(Значение);
	
	ИмяПеречисления = ОбъектМД.ЗначенияПеречисления.Получить(ИндексЗначения).Имя;
	
	Возврат ИмяПеречисления
	
Конецфункции	

#Область ТекстыЗапросов

Процедура ТекстЗапроса_АвансовыйОтчет(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""АвансовыйОтчет"" КАК ТипДокумента,
	|	""АвансовыйОтчет"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ЕСТЬNULL(ТоварыУслуги.Сумма, 0) + ЕСТЬNULL(Расходы.Сумма, 0) + ЕСТЬNULL(ОплатыПоставщикам.Сумма, 0) КАК СуммаДокумента
	|ИЗ
	|	Документ.АвансовыйОтчет КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА Товары.Ссылка.ЦенаВключаетНДС
	|						ТОГДА Товары.Сумма
	|					ИНАЧЕ Товары.Сумма + Товары.СуммаНДС
	|				КОНЕЦ) КАК Сумма,
	|			Товары.Ссылка.АвансовыйОтчет КАК АвансовыйОтчет
	|		ИЗ
	|			Документ.ПриобретениеТоваровУслуг.Товары КАК Товары
	|		ГДЕ
	|			НЕ Товары.Ссылка.АвансовыйОтчет = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|			И Товары.Ссылка.АвансовыйОтчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			И Товары.Ссылка.АвансовыйОтчет.Организация = &Организация
	|			И Товары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Товары.Ссылка.АвансовыйОтчет) КАК ТоварыУслуги
	|		ПО (ТоварыУслуги.АвансовыйОтчет = ДанныеДокумента.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(АвансовыйОтчетПрочиеРасходы.Сумма) КАК Сумма,
	|			АвансовыйОтчетПрочиеРасходы.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.АвансовыйОтчет.ПрочиеРасходы КАК АвансовыйОтчетПрочиеРасходы
	|		ГДЕ
	|			АвансовыйОтчетПрочиеРасходы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			И АвансовыйОтчетПрочиеРасходы.Ссылка.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			АвансовыйОтчетПрочиеРасходы.Ссылка) КАК Расходы
	|		ПО (Расходы.Ссылка = ДанныеДокумента.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(АвансовыйОтчетОплатаПоставщикам.Сумма) КАК Сумма,
	|			АвансовыйОтчетОплатаПоставщикам.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчетОплатаПоставщикам
	|		ГДЕ
	|			АвансовыйОтчетОплатаПоставщикам.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			И АвансовыйОтчетОплатаПоставщикам.Ссылка.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			АвансовыйОтчетОплатаПоставщикам.Ссылка) КАК ОплатыПоставщикам
	|		ПО (ОплатыПоставщикам.Ссылка = ДанныеДокумента.Ссылка)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация"	
	
КонецПроцедуры	

Процедура ТекстЗапроса_ПоступлениеТоваровУслуг(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ПоступлениеТоваровУслуг"" КАК ТипДокумента,
	|	""ПриобретениеТоваровУслуг"" КАК ТипДокументаЕРП,
	|	ДанныеДокумента.Ссылка.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка) И НЕ ДанныеДокумента.Ссылка.Валюта.Код = ""643"" КАК Многострочный,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ЗаказПоставщику
	|	КОНЕЦ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ЗаказПоставщику.Дата
	|	КОНЕЦ КАК ЗаказДата, 
	|	""ЗП"" КАК Префикс,
	|	ДанныеДокумента.Ссылка.Номер КАК Номер,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка.Контрагент) КАК Контрагент,
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование КАК Договор,
	|	СУММА(ДанныеДокумента.СуммаСНДС) КАК СуммаДокумента
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Ссылка.Организация = &Организация
	|	И НЕ ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
	|	И (НЕ(ДанныеДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|					ИЛИ ДанныеДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ИЛИ НЕ ДанныеДокумента.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ЗаказПоставщику
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ЗаказПоставщику.Дата
	|	КОНЕЦ,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Проведен,
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка.Контрагент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ПоступлениеТоваровУслуг"",
	|	""ПриобретениеУслугПрочихАктивов"",
	|	ЛОЖЬ,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка.Контрагент),
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование,
	|	СУММА(ДанныеДокумента.СуммаСНДС)
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Ссылка.Организация = &Организация
	|	И НЕ ДанныеДокумента.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Проведен,
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка.Контрагент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ПоступлениеТоваровУслуг"",
	|	""ПередачаТоваровМеждуОрганизациями"",
	|	ЛОЖЬ,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеДокумента.Организация.ИНН = Контрагенты.ИНН
	|			И ДанныеДокумента.Организация.КПП = Контрагенты.КПП
	|			И ДанныеДокумента.Организация.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|			И (НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович"")
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.ОрганизацияПолучатель = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДокумента,
	|	ГУИД,
	|	ТипДокументаЕРП,
	|	ЗаказДата"
	
КонецПроцедуры	

Процедура ТекстЗапроса_ПоступлениеДопРасходов(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ПоступлениеДопРасходов"" КАК ТипДокумента,
	|	""ПриобретениеТоваровУслуг"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Ссылка.Номер КАК Номер,
	|	ДанныеДокумента.Ссылка.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка.Контрагент) КАК Контрагент,
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование КАК Договор,
	|	NULL КАК Заказ,
	|	СУММА(ДанныеДокумента.СуммаСНДС) КАК СуммаДокумента
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Ссылка.Организация = &Организация
	|	И НЕ ДанныеДокумента.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
	|	И ДанныеДокумента.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	И (ДанныеДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ИЛИ ДанныеДокумента.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Проведен,
	|	ДанныеДокумента.Ссылка.Контрагент,
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ПоступлениеДопРасходов"",
	|	""ПриобретениеУслугПрочихАктивов"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка.Контрагент),
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование,
	|	NULL,
	|	СУММА(ДанныеДокумента.СуммаСНДС)
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Ссылка.Организация = &Организация
	|	И ДанныеДокумента.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Проведен,
	|	ДанныеДокумента.Ссылка.Контрагент,
	|	ДанныеДокумента.Ссылка.Контрагент.Наименование,
	|	ДанныеДокумента.Ссылка.Контрагент.ИНН,
	|	ДанныеДокумента.Ссылка.Контрагент.КПП,
	|	ДанныеДокумента.Ссылка.Контрагент.ЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Ссылка.Контрагент.НаименованиеПолное,
	|	ДанныеДокумента.Ссылка.Договор.Наименование"	
	
КонецПроцедуры	

Процедура ТекстЗапроса_КорректировкаПоступления(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""КорректировкаПоступления"" КАК ТипДокумента,
	|	""КорректировкаПриобретения"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Контрагент) КАК Контрагент,
	|	ДанныеДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументОснование.ЗаказПоставщику
	|	КОНЕЦ КАК Заказ,
	|	""ЗП"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаПриобретения КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация"	
	
КонецПроцедуры	

Процедура ТекстЗапроса_ГТДИмпорт(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ГТДИмпорт"" КАК ТипДокумента,
	|	""ТаможеннаяДекларацияИмпорт"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Контрагент) КАК Контрагент,
	|	ДанныеДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование КАК Договор,
	|	NULL КАК Заказ,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация"	
	
КонецПроцедуры	

Процедура ТекстЗапроса_ВозвратТоваровПоставщику(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ВозвратТоваровПоставщику"" КАК ТипДокумента,
	|	""ВозвратТоваровПоставщику"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Контрагент) КАК Контрагент,
	|	ДанныеДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументПоступления.ЗаказПоставщику
	|	КОНЕЦ КАК Заказ,
	|	""ЗП"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВозвратТоваровПоставщику"",
	|	""ВозвратТоваровМеждуОрганизациями"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеДокумента.ОрганизацияПолучатель.ИНН = Контрагенты.ИНН
	|			И ДанныеДокумента.ОрганизацияПолучатель.КПП = Контрагенты.КПП
	|			И ДанныеДокумента.ОрганизацияПолучатель.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|			И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация"	
	
КонецПроцедуры

Процедура ТекстЗапроса_СчетФактураПолученный(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""СчетФактураПолученный"" КАК ТипДокумента,
	|	""СчетФактураПолученный"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Контрагент) КАК Контрагент,
	|	ДанныеДокумента.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Контрагент.КПП КАК КонтрагентКПП,
	|	ДанныеДокумента.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	ДанныеДокумента.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ДанныеДокументаДокументыОснования.ДокументОснование.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокументаДокументыОснования.ДокументОснование.ЗаказПоставщику
	|	КОНЕЦ КАК Заказ,
	|	""ЗП"" КАК Префикс,
	|	ДанныеДокумента.Договор.Наименование КАК Договор
	|ИЗ
	|	Документ.СчетФактураПолученный КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК ДанныеДокументаДокументыОснования
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументаДокументыОснования.Ссылка
	|			И (ДанныеДокументаДокументыОснования.НомерСтроки = 1)
	|			И (ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (ДанныеДокумента.Организация = &Организация)
	|			И (НЕ ТИПЗНАЧЕНИЯ(ДанныеДокументаДокументыОснования.ДокументОснование) В (ТИП(Документ.ПоступлениеУслугПоАренде), ТИП(Документ.ВыкупАрендованныхОС)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""СчетФактураПолученный"",
	|	""СчетФактураВыданный"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.ДатаВыставления,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.Договор.Наименование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ДанныеДокументаДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|				ПО ПередачаТоваровМеждуОрганизациями.Организация.ИНН = Контрагенты.ИНН
	|					И ПередачаТоваровМеждуОрганизациями.Организация.КПП = Контрагенты.КПП
	|					И ПередачаТоваровМеждуОрганизациями.Организация.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|					И (НЕ Контрагенты.ПометкаУдаления)
	|					И (НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович"")
	|			ПО ДанныеДокументаДокументыОснования.ДокументОснование = ПередачаТоваровМеждуОрганизациями.Ссылка
	|				И (ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель = &Организация)
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументаДокументыОснования.Ссылка
	|			И (ДанныеДокументаДокументыОснования.НомерСтроки = 1)
	|			И (ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""СчетФактураПолученный"",
	|	""СчетФактураВыданный"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.ДатаВыставления,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.Договор.Наименование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ДанныеДокументаДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваровМеждуОрганизациями
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|				ПО ВозвратТоваровМеждуОрганизациями.Организация.ИНН = Контрагенты.ИНН
	|					И ВозвратТоваровМеждуОрганизациями.Организация.КПП = Контрагенты.КПП
	|					И ВозвратТоваровМеждуОрганизациями.Организация.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|					И (НЕ Контрагенты.ПометкаУдаления)
	|					И (НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович"")
	|			ПО ДанныеДокументаДокументыОснования.ДокументОснование = ВозвратТоваровМеждуОрганизациями.Ссылка
	|				И (ВозвратТоваровМеждуОрганизациями.ОрганизацияПолучатель = &Организация)
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументаДокументыОснования.Ссылка
	|			И (ДанныеДокументаДокументыОснования.НомерСтроки = 1)
	|			И (ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода)"
		
КонецПроцедуры

Процедура ТекстЗапроса_ОприходованиеТоваров(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ОприходованиеТоваров"" КАК ТипДокумента,
	|	""ОприходованиеИзлишковТоваров"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ ДанныеДокумента.СтатьяДоходов = &СтатьяИзлишки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ОприходованиеТоваров"",
	|	""КорректировкаРеализации"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Проведен
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Ссылка.Организация = &Организация
	|	И ДанныеДокумента.НаДоходыРасходы
	|	И (ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ДанныеДокумента.Ссылка.ДокументОснование КАК Документ.РеализацияТоваровУслуг).ВернутьМногооборотнуюТару, ЛОЖЬ))"
	
КонецПроцедуры	

Процедура ТекстЗапроса_ПеремещениеТоваров(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ПеремещениеТоваров"" КАК ТипДокумента,
	|	""ПеремещениеТоваров"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И (ДанныеДокумента.СкладОтправитель В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ДополнительныеСведения.Объект КАК Объект
	|				ИЗ
	|					РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|				ГДЕ
	|					ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|					И ДополнительныеСведения.Значение = ИСТИНА)
	|			ИЛИ ДанныеДокумента.СкладПолучатель В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ДополнительныеСведения.Объект КАК Объект
	|				ИЗ
	|					РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|				ГДЕ
	|					ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|					И ДополнительныеСведения.Значение = ИСТИНА))
	|	И НЕ(ДанныеДокумента.СкладОтправитель В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						ДополнительныеСведения.Объект КАК Объект
	|					ИЗ
	|						РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|					ГДЕ
	|						ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|						И ДополнительныеСведения.Значение = ИСТИНА)
	|				И ДанныеДокумента.СкладПолучатель В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						ДополнительныеСведения.Объект КАК Объект
	|					ИЗ
	|						РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|					ГДЕ
	|						ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|						И ДополнительныеСведения.Значение = ИСТИНА))"	
	
КонецПроцедуры

Процедура ТекстЗапроса_КомплектацияНоменклатуры(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Вл.ТипДокумента КАК ТипДокумента,
	|	Вл.ТипДокументаЕРП КАК ТипДокументаЕРП,
	|	Вл.ГУИД КАК ГУИД,
	|	Вл.Номер КАК Номер,
	|	Вл.Дата КАК Дата,
	|	Вл.Проведен КАК Проведен,
	|	Вл.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Вл.Префикс КАК Префикс
	|ИЗ
	|	(ВЫБРАТЬ
	|		""КомплектацияНоменклатуры"" КАК ТипДокумента,
	|		""СборкаТоваров"" КАК ТипДокументаЕРП,
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|		ДанныеДокумента.Номер КАК Номер,
	|		ДанныеДокумента.Дата КАК Дата,
	|		ДанныеДокумента.Проведен КАК Проведен,
	|		"""" КАК ВидНоменклатуры,
	|		NULL КАК Префикс
	|	ИЗ
	|		Документ.СборкаТоваров КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Организация = &Организация
	|		И ДанныеДокумента.Ссылка В
	|				(ВЫБРАТЬ
	|					ВложенныйЗапрос.Ссылка КАК Ссылка
	|				ИЗ
	|					(ВЫБРАТЬ
	|						СборкаТоваров.Ссылка КАК Ссылка,
	|						СборкаТоваров.Номенклатура КАК Номенклатура,
	|						СборкаТоваров.Количество КАК Количество
	|					ИЗ
	|						Документ.СборкаТоваров КАК СборкаТоваров
	|					ГДЕ
	|						СборкаТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И СборкаТоваров.Организация = &Организация
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						СборкаТоваров.Ссылка,
	|						СборкаТоваров.Номенклатура,
	|						-СборкаТоваров.Количество
	|					ИЗ
	|						Документ.СборкаТоваров.Товары КАК СборкаТоваров
	|					ГДЕ
	|						СборкаТоваров.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И СборкаТоваров.Ссылка.Организация = &Организация) КАК ВложенныйЗапрос
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.Ссылка,
	|					ВложенныйЗапрос.Номенклатура
	|				ИМЕЮЩИЕ
	|					НЕ СУММА(ВложенныйЗапрос.Количество) = 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""КомплектацияНоменклатуры"",
	|		""ОприходованиеИзлишковТоваров"",
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен,
	|		ДанныеДокумента.Номенклатура.ВидНоменклатуры,
	|		NULL КАК Префикс
	|	ИЗ
	|		Документ.ОприходованиеИзлишковТоваров.Товары КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Организация = &Организация
	|		И ДанныеДокумента.Ссылка.СтатьяДоходов = &СтатьяИзлишки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Номенклатура.ВидНоменклатуры,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""КомплектацияНоменклатуры"",
	|		""СписаниеНедостачТоваров"",
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен,
	|		ДанныеДокумента.Номенклатура.ВидНоменклатуры,
	|		NULL КАК Префикс
	|	ИЗ
	|		Документ.СписаниеНедостачТоваров.Товары КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Организация = &Организация
	|		И ДанныеДокумента.Ссылка.СтатьяРасходов = &СтатьяНедостачиПриИнвентаризации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Номенклатура.ВидНоменклатуры,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""КомплектацияНоменклатуры"",
	|		""ПорчаТоваров"",
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен,
	|		ДанныеДокумента.Номенклатура.ВидНоменклатуры,
	|		""ПО"" КАК Префикс 
	|	ИЗ
	|		Документ.ПорчаТоваров.Товары КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Организация = &Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Номенклатура.ВидНоменклатуры,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""КомплектацияНоменклатуры"",
	|		""ПорчаТоваров"",
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен,
	|		ДанныеДокумента.НоменклатураОприходование.ВидНоменклатуры,
	|		""ПС"" КАК Префикс 
	|	ИЗ
	|		Документ.ПорчаТоваров.Товары КАК ДанныеДокумента
	|	ГДЕ
	|		ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДанныеДокумента.Ссылка.Организация = &Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.НоменклатураОприходование.ВидНоменклатуры,
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Ссылка.Номер,
	|		ДанныеДокумента.Ссылка.Дата,
	|		ДанныеДокумента.Ссылка.Проведен) КАК Вл
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДокумента,
	|	ГУИД,
	|	ТипДокументаЕРП,
	|	Префикс"	
	
КонецПроцедуры

Процедура ТекстЗапроса_СписаниеТоваров(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""СписаниеТоваров"" КАК ТипДокумента,
	|	""СписаниеНедостачТоваров"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен
	|ИЗ
	|	Документ.СписаниеНедостачТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ ДанныеДокумента.СтатьяРасходов = &СтатьяНедостачиПриИнвентаризации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СписаниеТоваров"",
	|	""КорректировкаРеализации"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Ссылка.Номер,
	|	ДанныеДокумента.Ссылка.Дата,
	|	ДанныеДокумента.Ссылка.Проведен
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Ссылка.Организация = &Организация
	|	И ДанныеДокумента.НаДоходыРасходы
	|	И (ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ДанныеДокумента.Ссылка.ДокументОснование КАК Документ.РеализацияТоваровУслуг).ВернутьМногооборотнуюТару, ЛОЖЬ))"
	
КонецПроцедуры

Процедура ТекстЗапроса_ТребованиеНакладная(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ТребованиеНакладная"" КАК ТипДокумента,
	|	""ВнутреннееПотребление"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию)"	
	
КонецПроцедуры

Процедура ТекстЗапроса_ПередачаМатериаловВЭксплуатацию(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ПередачаМатериаловВЭксплуатацию"" КАК ТипДокумента,
	|	""ВнутреннееПотребление"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию)"	
	
КонецПроцедуры

Процедура ТекстЗапроса_РеализацияТоваровУслуг(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"" КАК ТипДокумента,
	|	""РеализацияТоваровУслуг"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ(ДанныеДокумента.Организация = &Аудиотехник И ДанныеДокумента.Контрагент = &КонтрагентВладимирРП И ДанныеДокумента.Склад = &СкладБольницаСА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"",
	|	""РеализацияУслугПрочихАктивов"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"",
	|	""ПередачаТоваровМеждуОрганизациями"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеДокумента.ОрганизацияПолучатель.ИНН = Контрагенты.ИНН
	|			И ДанныеДокумента.ОрганизацияПолучатель.КПП = Контрагенты.КПП
	|			И ДанныеДокумента.ОрганизацияПолучатель.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|			И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"",
	|	""КорректировкаРеализации"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументОснование.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара)"	
	
КонецПроцедуры

Процедура ТекстЗапроса_ВводНачальныхОстатков(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ВводНачальныхОстатков"" КАК ТипДокумента,
	|	""ВводОстатковВзаиморасчетов"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковАвансовКлиентов)
	|				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковЗадолженностиКлиентов)
	|			ТОГДА ВЫБОР
	|					КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|						ТОГДА ВЫБОР
	|								КОГДА ДанныеДокумента.Организация = &Реамед
	|									ТОГДА ""Договор-оферты (сайт)""
	|								ИНАЧЕ ""Без договора""
	|							КОНЕЦ
	|					КОГДА дРасчетыСПартнерами.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|							И НЕ ЕСТЬNULL(дРасчетыСПартнерами.ОбъектРасчетов.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ дРасчетыСПартнерами.Договор.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ дРасчетыСПартнерами.Договор.Наименование
	|	КОНЕЦ КАК Договор,
	|	дРасчетыСПартнерами.Сумма КАК СуммаДокумента
	|ИЗ
	|	Документ.ВводОстатковВзаиморасчетов КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводОстатковВзаиморасчетов.РасчетыСПартнерами КАК дРасчетыСПартнерами
	|		ПО ДанныеДокумента.Ссылка = дРасчетыСПартнерами.Ссылка
	|			И (ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (ДанныеДокумента.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковАвансовКлиентов)
	|						ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковЗадолженностиКлиентов)
	|					ТОГДА ВЫБОР
	|							КОГДА дРасчетыСПартнерами.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|								ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|							КОГДА дРасчетыСПартнерами.Контрагент ССЫЛКА Справочник.Организации
	|								ТОГДА Контрагенты.ИНН = дРасчетыСПартнерами.Контрагент.ИНН
	|										И Контрагенты.КПП = дРасчетыСПартнерами.Контрагент.КПП
	|										И Контрагенты.ЮридическоеФизическоеЛицо = дРасчетыСПартнерами.Контрагент.ЮридическоеФизическоеЛицо
	|										И НЕ Контрагенты.ПометкаУдаления
	|										И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|							ИНАЧЕ дРасчетыСПартнерами.Контрагент = Контрагенты.Ссылка
	|						КОНЕЦ
	|				ИНАЧЕ дРасчетыСПартнерами.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)"	
	
КонецПроцедуры

Процедура ТекстЗапроса_КорректировкаРеализации(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""КорректировкаРеализации"" КАК ТипДокумента,
	|	""КорректировкаРеализации"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументОснование.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара)
	|	И НЕ ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)"	
	
КонецПроцедуры

Процедура ТекстЗапроса_СписаниеСРасчетногоСчета(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""СписаниеСРасчетногоСчета"" КАК ТипДокумента,
	|	""СписаниеБезналичныхДенежныхСредств"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен
	|		И ДанныеДокумента.ПроведеноБанком КАК Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета)) КАК ЭтоФизЛицо,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета))
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета))
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо.Наименование
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо, ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)) КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК тРасшифровкаПлатежа
	|		ПО ДанныеДокумента.Ссылка = тРасшифровкаПлатежа.Ссылка
	|			И (тРасшифровкаПлатежа.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
	|						ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию)
	|					ТОГДА ДанныеДокумента.БанковскийСчетПолучатель.Владелец.ИНН = Контрагенты.ИНН
	|							И ДанныеДокумента.БанковскийСчетПолучатель.Владелец.КПП = Контрагенты.КПП
	|							И ДанныеДокумента.БанковскийСчетПолучатель.Владелец.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|							И НЕ Контрагенты.ПометкаУдаления
	|							И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|				КОГДА ЕСТЬNULL(тРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств, ЛОЖЬ) = &СтатьяВнутрПередача
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация"	
	
КонецПроцедуры

Процедура ТекстЗапроса_ПоступлениеНаРасчетныйСчет(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ПоступлениеНаРасчетныйСчет"" КАК ТипДокумента,
	|	""ПоступлениеБезналичныхДенежныхСредств"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен
	|		И ДанныеДокумента.ПроведеноБанком КАК Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника)
	|		ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗаймаСотрудником) КАК ЭтоФизЛицо,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника)
	|				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗаймаСотрудником)
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника)
	|				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗаймаСотрудником)
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо.Наименование
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо, ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)) КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК тРасшифровкаПлатежа
	|		ПО ДанныеДокумента.Ссылка = тРасшифровкаПлатежа.Ссылка
	|			И (тРасшифровкаПлатежа.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации)
	|						ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации)
	|					ТОГДА ДанныеДокумента.БанковскийСчетОтправитель.Владелец.ИНН = Контрагенты.ИНН
	|							И ДанныеДокумента.БанковскийСчетОтправитель.Владелец.КПП = Контрагенты.КПП
	|							И ДанныеДокумента.БанковскийСчетОтправитель.Владелец.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|							И НЕ Контрагенты.ПометкаУдаления
	|							И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|				КОГДА ЕСТЬNULL(тРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств, ЛОЖЬ) = &СтатьяВнутрПередача
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация"	
	
КонецПроцедуры

Процедура ТекстЗапроса_ПриходныйКассовыйОрдер(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ПриходныйКассовыйОрдер"" КАК ТипДокумента,
	|	""ПриходныйКассовыйОрдер"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника)
	|		ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗаймаСотрудником) КАК ЭтоФизЛицо,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника)
	|				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗаймаСотрудником)
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника)
	|				ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗаймаСотрудником)
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо.Наименование
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо, ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)) КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации)
	|						ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации)
	|					ТОГДА ДанныеДокумента.БанковскийСчет.Владелец.ИНН = Контрагенты.ИНН
	|							И ДанныеДокумента.БанковскийСчет.Владелец.КПП = Контрагенты.КПП
	|							И ДанныеДокумента.БанковскийСчет.Владелец.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|							И НЕ Контрагенты.ПометкаУдаления 
	|							И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы)
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ(ДанныеДокумента.Организация = &Аудиотехник И ДанныеДокумента.Контрагент = &КонтрагентВладимирРП)"	
	
КонецПроцедуры

Процедура ТекстЗапроса_РасходныйКассовыйОрдер(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""РасходныйКассовыйОрдер"" КАК ТипДокумента,
	|	""РасходныйКассовыйОрдер"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) КАК ЭтоФизЛицо,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
	|			ТОГДА ДанныеДокумента.ПодотчетноеЛицо.Наименование
	|		ИНАЧЕ Контрагенты.Наименование
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо, ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)) КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
	|						ИЛИ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию)
	|					ТОГДА ДанныеДокумента.БанковскийСчет.Владелец.ИНН = Контрагенты.ИНН
	|							И ДанныеДокумента.БанковскийСчет.Владелец.КПП = Контрагенты.КПП
	|							И ДанныеДокумента.БанковскийСчет.Владелец.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|							И НЕ Контрагенты.ПометкаУдаления 
	|							И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|	И ДанныеДокумента.Организация = &Организация"	
	
КонецПроцедуры

Процедура ТекстЗапроса_ВозвратТоваровОтПокупателя(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ВозвратТоваровОтПокупателя"" КАК ТипДокумента,
	|	""ВозвратТоваровОтКлиента"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументРеализации.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВозвратТоваровОтПокупателя"",
	|	""ВозвратТоваровМеждуОрганизациями"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеДокумента.Организация.ИНН = Контрагенты.ИНН
	|			И ДанныеДокумента.Организация.КПП = Контрагенты.КПП
	|			И ДанныеДокумента.Организация.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|			И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.ОрганизацияПолучатель = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВозвратТоваровОтПокупателя"",
	|	""КорректировкаРеализации"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументОснование.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)"	
	
КонецПроцедуры                                     

Процедура ТекстЗапроса_ОплатаПлатежнойКартой(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ОплатаПлатежнойКартой"" КАК ТипДокумента,
	|	""ОперацияПоПлатежнойКарте"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо, ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)) КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ОперацияПоПлатежнойКарте КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ(ДанныеДокумента.Организация = &Аудиотехник И ДанныеДокумента.Контрагент = &КонтрагентВладимирРП)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ОплатаПлатежнойКартой"",
	|	""ОперацияПоЯндексКассе"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо, ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)),
	|	Контрагенты.НаименованиеПолное,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.ОперацияПоЯндексКассе КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ(ДанныеДокумента.Организация = &Аудиотехник И ДанныеДокумента.Контрагент = &КонтрагентВладимирРП)"	
	
КонецПроцедуры

Процедура ТекстЗапроса_КорректировкаДолга(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""КорректировкаДолга"" КАК ТипДокумента,
	|	""КорректировкаЗадолженности"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен
	|ИЗ
	|	Документ.КорректировкаЗадолженности КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""КорректировкаДолга"",
	|	""СписаниеБезналичныхДенежныхСредств"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен
	|		И ДанныеДокумента.ПроведеноБанком
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК тРасшифровкаПлатежа
	|		ПО (ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (ДанныеДокумента.Организация = &Организация)
	|			И ДанныеДокумента.Ссылка = тРасшифровкаПлатежа.Ссылка
	|			И (ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику))
	|			И (НЕ ДанныеДокумента.Валюта.Код = ""643"")
	|			И (НЕ ДанныеДокумента.Валюта = тРасшифровкаПлатежа.ВалютаВзаиморасчетов)
	|			И (НЕ тРасшифровкаПлатежа.ВалютаВзаиморасчетов.Код = ""643"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""КорректировкаДолга"",
	|	""ВзаимозачетЗадолженности"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Ссылка В
	|			(ВЫБРАТЬ
	|				ЕСТЬNULL(Кт.Ссылка, Дт.Ссылка)
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка,
	|					ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Справочник.ДоговорыКонтрагентов), ТИП(Справочник.Претензии))
	|							ТОГДА ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Объект
	|						КОГДА ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|								ИЛИ НЕ ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Валюта.Код = ""643""
	|									И ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Документ.ЗаказКлиента), ТИП(Документ.ЗаказПоставщику))
	|							ТОГДА ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов
	|						ИНАЧЕ ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Договор
	|					КОНЕЦ КАК ОбъектРасчетов,
	|					СУММА(ВзаимозачетЗадолженностиКредиторскаяЗадолженность.СуммаУпр) КАК Сумма
	|				ИЗ
	|					Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК ВзаимозачетЗадолженностиКредиторскаяЗадолженность
	|				ГДЕ
	|					ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|					И ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка.Организация = &Организация
	|				СГРУППИРОВАТЬ ПО
	|					ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка,
	|					ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Справочник.ДоговорыКонтрагентов), ТИП(Справочник.Претензии))
	|							ТОГДА ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Объект
	|						КОГДА ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|								ИЛИ НЕ ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Валюта.Код = ""643""
	|									И ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Документ.ЗаказКлиента), ТИП(Документ.ЗаказПоставщику))
	|							ТОГДА ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов
	|						ИНАЧЕ ВзаимозачетЗадолженностиКредиторскаяЗадолженность.ОбъектРасчетов.Договор
	|					КОНЕЦ) КАК Кт
	|					ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|						ВзаимозачетЗадолженностиДебиторскаяЗадолженность.Ссылка,
	|						ВЫБОР
	|							КОГДА ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Справочник.ДоговорыКонтрагентов), ТИП(Справочник.Претензии))
	|								ТОГДА ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Объект
	|							КОГДА ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|									ИЛИ НЕ ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Валюта.Код = ""643""
	|										И ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Документ.ЗаказКлиента), ТИП(Документ.ЗаказПоставщику))
	|								ТОГДА ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов
	|							ИНАЧЕ ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Договор
	|						КОНЕЦ КАК ОбъектРасчетов,
	|						СУММА(ВзаимозачетЗадолженностиДебиторскаяЗадолженность.СуммаУпр) КАК Сумма
	|					ИЗ
	|						Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ВзаимозачетЗадолженностиДебиторскаяЗадолженность
	|					ГДЕ
	|						ВзаимозачетЗадолженностиДебиторскаяЗадолженность.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И ВзаимозачетЗадолженностиДебиторскаяЗадолженность.Ссылка.Организация = &Организация
	|					СГРУППИРОВАТЬ ПО
	|						ВзаимозачетЗадолженностиДебиторскаяЗадолженность.Ссылка,
	|						ВЫБОР
	|							КОГДА ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Справочник.ДоговорыКонтрагентов), ТИП(Справочник.Претензии))
	|								ТОГДА ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Объект
	|							КОГДА ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|									ИЛИ НЕ ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Валюта.Код = ""643""
	|										И ТИПЗНАЧЕНИЯ(ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Объект) В (ТИП(Документ.ЗаказКлиента), ТИП(Документ.ЗаказПоставщику))
	|								ТОГДА ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов
	|							ИНАЧЕ ВзаимозачетЗадолженностиДебиторскаяЗадолженность.ОбъектРасчетов.Договор
	|						КОНЕЦ) КАК Дт
	|					ПО
	|						Кт.ОбъектРасчетов = Дт.ОбъектРасчетов
	|							И Кт.Ссылка = Дт.Ссылка
	|			ГДЕ
	|				НЕ ЕСТЬNULL(Кт.Сумма, 0) = ЕСТЬNULL(Дт.Сумма, 0))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДокумента,
	|	ГУИД,
	|	ТипДокументаЕРП"	
	
КонецПроцедуры

Процедура ТекстЗапроса_СчетФактураВыданный(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""СчетФактураВыданный"" КАК ТипДокумента,
	|	""СчетФактураВыданный"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ДанныеДокументаДокументыОснования.ДокументОснование.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокументаДокументыОснования.ДокументОснование.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.Договор.Наименование КАК Договор
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК ДанныеДокументаДокументыОснования
	|		ПО ДанныеДокумента.Ссылка = ДанныеДокументаДокументыОснования.Ссылка
	|			И (ДанныеДокументаДокументыОснования.НомерСтроки = 1)
	|			И (ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И ((ДанныеДокумента.Организация = &Организация И НЕ ДанныеДокументаДокументыОснования.ДокументОснование Ссылка Документ.ВозвратТоваровМеждуОрганизациями)
	|				ИЛИ (ДанныеДокумента.Контрагент = &Организация И НЕ ДанныеДокументаДокументыОснования.ДокументОснование Ссылка Документ.ПередачаТоваровМеждуОрганизациями))
	|			И НЕ ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент ССЫЛКА Справочник.Организации
	|					ТОГДА ВЫБОР
	|								КОГДА ДанныеДокумента.Организация = &Организация
	|									ТОГДА ДанныеДокумента.Контрагент.ИНН = Контрагенты.ИНН
	|											И ДанныеДокумента.Контрагент.КПП = Контрагенты.КПП
	|											И ДанныеДокумента.Контрагент.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|								ИНАЧЕ ДанныеДокумента.Организация.ИНН = Контрагенты.ИНН
	|										И ДанныеДокумента.Организация.КПП = Контрагенты.КПП
	|										И ДанныеДокумента.Организация.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|							КОНЕЦ
	|							И НЕ Контрагенты.ПометкаУдаления
	|							И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)"	
	
КонецПроцедуры



Процедура ТекстЗапроса_ХозрасчетныйТовары(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура) КАК ГУИД,
	|	СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) КАК Количество,
	|	""ХозрасчетныйТовары"" КАК ТипДокумента,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура.Наименование КАК Наименование,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(&ДатаОстатков, Организация = &Организация И ЕСТЬNULL(ВидЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)) КАК ТоварыОрганизацийОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное
	|
	|ИМЕЮЩИЕ 
	|	НЕ СУММА(ТоварыОрганизацийОстатки.КоличествоОстаток) = 0"	
	
КонецПроцедуры

Процедура ТекстЗапроса_ХозрасчетныйРасчеты(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ХозрасчетныйРасчеты"" КАК ТипДокумента,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ДанныеРегистра.Заказ КАК Заказ,
	|	ДанныеРегистра.Префикс КАК Префикс,
	|	ДанныеРегистра.Договор КАК Договор,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	СУММА(ДанныеРегистра.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		Контрагенты.Ссылка КАК Контрагент,
	|		ВЫБОР
	|			КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеРегистра.ОбъектРасчетов.Организация = &Реамед
	|							ТОГДА ""Договор-оферты (сайт)""
	|						ИНАЧЕ ""Без договора""
	|					КОНЕЦ
	|			КОГДА Ключи.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					И НЕ ЕСТЬNULL(ДанныеРегистра.ОбъектРасчетов.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|				ТОГДА ""Договор-оферты (сайт)""
	|			ИНАЧЕ Ключи.Договор.Наименование
	|		КОНЕЦ КАК Договор,
	|		ДанныеРегистра.Валюта.Код КАК Валюта,
	|		""ЗК"" КАК Префикс,
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.ОбъектРасчетов.Объект ССЫЛКА Документ.ЗаказКлиента
	|					И НЕ ДанныеРегистра.ОбъектРасчетов.Валюта.Код = ""643""
	|				ТОГДА ДанныеРегистра.ОбъектРасчетов.Объект
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК Заказ,
	|		ДанныеРегистра.СуммаОстаток КАК Сумма
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаОстатков, ОбъектРасчетов.Организация = &Организация) КАК ДанныеРегистра
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
	|			ПО ДанныеРегистра.АналитикаУчетаПоПартнерам = Ключи.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО (ВЫБОР
	|					КОГДА Ключи.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|						ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|					КОГДА Ключи.Контрагент ССЫЛКА Справочник.Контрагенты
	|						ТОГДА Ключи.Контрагент = Контрагенты.Ссылка
	|					ИНАЧЕ Ключи.Контрагент.ИНН = Контрагенты.ИНН
	|							И Ключи.Контрагент.КПП = Контрагенты.КПП
	|							И Ключи.Контрагент.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|							И НЕ Контрагенты.ПометкаУдаления
	|							И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|				КОНЕЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Ключи.Контрагент,
	|		Ключи.Договор.Наименование,
	|		ДанныеРегистра.Валюта.Код,
	|		""ЗП"",
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.ОбъектРасчетов.Объект ССЫЛКА Документ.ЗаказПоставщику
	|					И НЕ ДанныеРегистра.ОбъектРасчетов.Валюта.Код = ""643""
	|				ТОГДА ДанныеРегистра.ОбъектРасчетов.Объект
	|			ИНАЧЕ NULL
	|		КОНЕЦ,
	|		ДанныеРегистра.СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки(&ДатаОстатков, ОбъектРасчетов.Организация = &Организация) КАК ДанныеРегистра
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
	|			ПО ДанныеРегистра.АналитикаУчетаПоПартнерам = Ключи.Ссылка) КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеРегистра.Контрагент ССЫЛКА Справочник.Контрагенты
	|					ТОГДА ДанныеРегистра.Контрагент = Контрагенты.Ссылка
	|				ИНАЧЕ ДанныеРегистра.Контрагент.ИНН = Контрагенты.ИНН
	|						И ДанныеРегистра.Контрагент.КПП = Контрагенты.КПП
	|						И ДанныеРегистра.Контрагент.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|						И НЕ Контрагенты.ПометкаУдаления
	|						И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Наименование,
	|	ДанныеРегистра.Договор,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.Префикс,
	|	ДанныеРегистра.Заказ,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка)
	|
	|ИМЕЮЩИЕ
	|	НЕ СУММА(ДанныеРегистра.Сумма) = 0"	
	
КонецПроцедуры






#КонецОбласти

#Область ТекстыЗапросовТовары

Процедура ТекстЗапросаТовары_АвансовыйОтчет(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка.АвансовыйОтчет) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.Номенклатура.Наименование КАК Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК тТовары
	|ГДЕ
	|	НЕ тТовары.Ссылка.АвансовыйОтчет = ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка)
	|	И тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка.АвансовыйОтчет,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код"	
	
КонецПроцедуры	

Процедура ТекстЗапросаТовары_ПоступлениеТоваровУслуг(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.Номенклатура.Наименование КАК Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	ВЫБОР
	|		КОГДА тТовары.Ссылка.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ тТовары.ЗаказПоставщику.Дата
	|	КОНЕЦ КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И НЕ тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
	|	И (НЕ(тТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|					ИЛИ тТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ИЛИ НЕ тТовары.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код,
	|	ВЫБОР
	|		КОГДА тТовары.Ссылка.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ тТовары.ЗаказПоставщику.Дата
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	"""",
	|	"""",
	|	тТовары.НомерГТД.Код,
	|	СУММА(ВЫБОР КОГДА тТовары.Количество = 0 ТОГДА 1 ИНАЧЕ тТовары.Количество КОНЕЦ),
	|	0 КАК КоличествоДо,
	|	NULL,
	|	""""
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И НЕ тТовары.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.НомерГТД.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура),
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код,
	|	СУММА(тТовары.Количество),
	|	0 КАК КоличествоДо,
	|	NULL,
	|	""""
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК тТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО тТовары.Ссылка.Организация.ИНН = Контрагенты.ИНН
	|			И тТовары.Ссылка.Организация.КПП = Контрагенты.КПП
	|			И тТовары.Ссылка.Организация.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|			И (НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович"")
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.ОрганизацияПолучатель = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код"
	
КонецПроцедуры	

Процедура ТекстЗапросаТовары_ПоступлениеДопРасходов(ТекстЗапроса)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДопРасходы.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.Номенклатура.Наименование КАК Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	"""" КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДопРасходы.Ссылка КАК Ссылка,
	|		ДопРасходы.АналитикаРасходов КАК АналитикаРасходов
	|	ИЗ
	|		Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ДопРасходы
	|	ГДЕ
	|		ДопРасходы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ДопРасходы.Ссылка.Организация = &Организация
	|		И ДопРасходы.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) КАК ДопРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК тТовары
	|		ПО ДопРасходы.АналитикаРасходов = тТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДопРасходы.Ссылка,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное"	
	
КонецПроцедуры	

Процедура ТекстЗапросаТовары_КорректировкаПоступления(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ТоварыПосле.ГУИД, ТоварыДо.ГУИД)) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ТоварыПосле.ГУИДНоменклатура, ТоварыДо.ГУИДНоменклатура)) КАК ГУИДНоменклатура,
	|	ЕСТЬNULL(ТоварыПосле.Наименование, ТоварыДо.Наименование) КАК Наименование,
	|	ЕСТЬNULL(ТоварыПосле.НаименованиеПолное, ТоварыДо.НаименованиеПолное) КАК НаименованиеПолное,
	|	ЕСТЬNULL(ТоварыПосле.НомерГТД, ТоварыДо.НомерГТД) КАК НомерГТД,
	|	ЕСТЬNULL(ТоварыПосле.Количество, 0) КАК КоличествоПосле,
	|	ЕСТЬNULL(ТоварыПосле.Количество, 0) + ЕСТЬNULL(ТоварыДо.Количество, 0) КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		(тТовары.Ссылка) КАК ГУИД,
	|		(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|		тТовары.Номенклатура.Наименование КАК Наименование,
	|		тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|		тТовары.НомерГТД.Код КАК НомерГТД,
	|		СУММА(тТовары.Количество) КАК Количество
	|	ИЗ
	|		Документ.КорректировкаПриобретения.Товары КАК тТовары
	|	ГДЕ
	|		тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И тТовары.Ссылка.Организация = &Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		тТовары.Ссылка,
	|		тТовары.Номенклатура,
	|		тТовары.Номенклатура.Наименование,
	|		тТовары.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код) КАК ТоварыПосле
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			(тТовары.Ссылка) КАК ГУИД,
	|			(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|			тТовары.Номенклатура.Наименование КАК Наименование,
	|			тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|			тТовары.НомерГТД.Код КАК НомерГТД,
	|			СУММА(-тТовары.Количество) КАК Количество
	|		ИЗ
	|			Документ.КорректировкаПриобретения.Расхождения КАК тТовары
	|		ГДЕ
	|			тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			И тТовары.Ссылка.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			тТовары.Ссылка,
	|			тТовары.Номенклатура,
	|			тТовары.Номенклатура.Наименование,
	|			тТовары.Номенклатура.НаименованиеПолное,
	|			тТовары.НомерГТД.Код) КАК ТоварыДо
	|		ПО ТоварыПосле.ГУИД = ТоварыДо.ГУИД
	|			И ТоварыПосле.ГУИДНоменклатура = ТоварыДо.ГУИДНоменклатура
	|			И ТоварыПосле.НомерГТД = ТоварыДо.НомерГТД"
	
КонецПроцедуры	

Процедура ТекстЗапросаТовары_ГТДИмпорт(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.Номенклатура.Наименование КАК Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.Ссылка.НомерДекларации КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.Ссылка.НомерДекларации"	
	
КонецПроцедуры	

Процедура ТекстЗапросаТовары_ВозвратТоваровПоставщику(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование КАК Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.ВидыЗапасов КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура),
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код,
	|	СУММА(тТовары.Количество),
	|	0,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями.Товары КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код"	
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_ОприходованиеТоваров(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.Номенклатура.Наименование КАК Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И НЕ тТовары.Ссылка.СтатьяДоходов = &СтатьяИзлишки
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура),
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код,
	|	СУММА(тТовары.Количество),
	|	0,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И тТовары.НаДоходыРасходы
	|	И (тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИЛИ тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(тТовары.Ссылка.ДокументОснование КАК Документ.РеализацияТоваровУслуг).ВернутьМногооборотнуюТару, ЛОЖЬ))
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код"
	
КонецПроцедуры	

Процедура ТекстЗапросаТовары_ПеремещениеТоваров(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.Номенклатура.Наименование КАК Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	"""" КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И (тТовары.Ссылка.СкладОтправитель В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ДополнительныеСведения.Объект КАК Объект
	|				ИЗ
	|					РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|				ГДЕ
	|					ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|					И ДополнительныеСведения.Значение = ИСТИНА)
	|			ИЛИ тТовары.Ссылка.СкладПолучатель В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ДополнительныеСведения.Объект КАК Объект
	|				ИЗ
	|					РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|				ГДЕ
	|					ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|					И ДополнительныеСведения.Значение = ИСТИНА))
	|	И НЕ(тТовары.Ссылка.СкладОтправитель В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						ДополнительныеСведения.Объект КАК Объект
	|					ИЗ
	|						РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|					ГДЕ
	|						ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|						И ДополнительныеСведения.Значение = ИСТИНА)
	|				И тТовары.Ссылка.СкладПолучатель В ИЕРАРХИИ
	|					(ВЫБРАТЬ
	|						ДополнительныеСведения.Объект КАК Объект
	|					ИЗ
	|						РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|					ГДЕ
	|						ДополнительныеСведения.Свойство.Имя = ""РС_СкладыСоисполнения""
	|						И ДополнительныеСведения.Значение = ИСТИНА))
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.Номенклатура,
	|	тТовары.Номенклатура.Наименование,
	|	тТовары.Номенклатура.НаименованиеПолное"	
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_КомплектацияНоменклатуры(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Вл.ГУИД КАК ГУИД,
	|	Вл.ГУИДНоменклатура КАК ГУИДНоменклатура,
	|	Вл.Наименование КАК Наименование,
	|	Вл.НаименованиеПолное КАК НаименованиеПолное,
	|	Вл.НомерГТД КАК НомерГТД,
	|	СУММА(Вл.КоличествоПосле) КАК КоличествоПосле,
	|	СУММА(Вл.КоличествоДо) КАК КоличествоДо,
	|	Вл.Заказ КАК Заказ,
	|	Вл.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура) КАК ГУИДНоменклатура,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование КАК Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|				ТОГДА тТовары.НомерГТД.Код
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК НомерГТД,
	|		СУММА(тТовары.Количество) КАК КоличествоПосле,
	|		0 КАК КоличествоДо,
	|		"""" КАК ВидНоменклатуры,
	|		"""" КАК Заказ
	|	ИЗ
	|		Документ.СборкаТоваров.ВидыЗапасовСписание КАК тТовары
	|	ГДЕ
	|		тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И тТовары.Ссылка.Организация = &Организация
	|		И тТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВложенныйЗапрос.Ссылка КАК Ссылка
	|				ИЗ
	|					(ВЫБРАТЬ
	|						СборкаТоваров.Ссылка КАК Ссылка,
	|						СборкаТоваров.Номенклатура КАК Номенклатура,
	|						СборкаТоваров.Количество КАК Количество
	|					ИЗ
	|						Документ.СборкаТоваров КАК СборкаТоваров
	|					ГДЕ
	|						СборкаТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И СборкаТоваров.Организация = &Организация
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						СборкаТоваров.Ссылка,
	|						СборкаТоваров.Номенклатура,
	|						-СборкаТоваров.Количество
	|					ИЗ
	|						Документ.СборкаТоваров.Товары КАК СборкаТоваров
	|					ГДЕ
	|						СборкаТоваров.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И СборкаТоваров.Ссылка.Организация = &Организация) КАК ВложенныйЗапрос
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.Ссылка,
	|					ВложенныйЗапрос.Номенклатура
	|				ИМЕЮЩИЕ
	|					НЕ СУММА(ВложенныйЗапрос.Количество) = 0)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		тТовары.Ссылка,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|				ТОГДА тТовары.НомерГТД.Код
	|			ИНАЧЕ """"
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура),
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|				ТОГДА """"
	|			ИНАЧЕ тТовары.НомерГТД.Код
	|		КОНЕЦ,
	|		СУММА(тТовары.Количество),
	|		0,
	|		"""",
	|		""""
	|	ИЗ
	|		Документ.СборкаТоваров.ВидыЗапасовОприходование КАК тТовары
	|	ГДЕ
	|		тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И тТовары.Ссылка.Организация = &Организация
	|		И тТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВложенныйЗапрос.Ссылка КАК Ссылка
	|				ИЗ
	|					(ВЫБРАТЬ
	|						СборкаТоваров.Ссылка КАК Ссылка,
	|						СборкаТоваров.Номенклатура КАК Номенклатура,
	|						СборкаТоваров.Количество КАК Количество
	|					ИЗ
	|						Документ.СборкаТоваров КАК СборкаТоваров
	|					ГДЕ
	|						СборкаТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И СборкаТоваров.Организация = &Организация
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						СборкаТоваров.Ссылка,
	|						СборкаТоваров.Номенклатура,
	|						-СборкаТоваров.Количество
	|					ИЗ
	|						Документ.СборкаТоваров.Товары КАК СборкаТоваров
	|					ГДЕ
	|						СборкаТоваров.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|						И СборкаТоваров.Ссылка.Организация = &Организация) КАК ВложенныйЗапрос
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.Ссылка,
	|					ВложенныйЗапрос.Номенклатура
	|				ИМЕЮЩИЕ
	|					НЕ СУММА(ВложенныйЗапрос.Количество) = 0)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		тТовары.Ссылка,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|				ТОГДА """"
	|			ИНАЧЕ тТовары.НомерГТД.Код
	|		КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Номенклатура),
	|		тТовары.Номенклатура.Наименование,
	|		тТовары.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код,
	|		СУММА(тТовары.Количество),
	|		0,
	|		тТовары.Номенклатура.ВидНоменклатуры,
	|		""""
	|	ИЗ
	|		Документ.ОприходованиеИзлишковТоваров.Товары КАК тТовары
	|	ГДЕ
	|		тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И тТовары.Ссылка.Организация = &Организация
	|		И тТовары.Ссылка.СтатьяДоходов = &СтатьяИзлишки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		тТовары.Ссылка,
	|		тТовары.Номенклатура,
	|		тТовары.Номенклатура.ВидНоменклатуры,
	|		тТовары.Номенклатура.Наименование,
	|		тТовары.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура),
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код,
	|		СУММА(тТовары.Количество),
	|		0,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры,
	|		""""
	|	ИЗ
	|		Документ.СписаниеНедостачТоваров.ВидыЗапасов КАК тТовары
	|	ГДЕ
	|		тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И тТовары.Ссылка.Организация = &Организация
	|		И тТовары.Ссылка.СтатьяРасходов = &СтатьяНедостачиПриИнвентаризации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		тТовары.Ссылка,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура),
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код,
	|		СУММА(тТовары.Количество),
	|		0,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры,
	|		""ПО""
	|	ИЗ
	|		Документ.ПорчаТоваров.ВидыЗапасов КАК тТовары
	|	ГДЕ
	|		тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И тТовары.Ссылка.Организация = &Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		тТовары.Ссылка,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|		УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура),
	|		тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код,
	|		СУММА(тТовары.Количество),
	|		0,
	|		тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура.ВидНоменклатуры,
	|		""ПС""
	|	ИЗ
	|		Документ.ПорчаТоваров.ВидыЗапасов КАК тТовары
	|	ГДЕ
	|		тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И тТовары.Ссылка.Организация = &Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		тТовары.Ссылка,
	|		тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура.ВидНоменклатуры,
	|		тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура,
	|		тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура.Наименование,
	|		тТовары.АналитикаУчетаНоменклатурыОприходование.Номенклатура.НаименованиеПолное,
	|		тТовары.НомерГТД.Код) КАК Вл
	|
	|СГРУППИРОВАТЬ ПО
	|	Вл.ГУИД,
	|	Вл.ГУИДНоменклатура,
	|	Вл.Наименование,
	|	Вл.НаименованиеПолное,
	|	Вл.Заказ,
	|	Вл.НомерГТД,
	|	Вл.ВидНоменклатуры"	
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_СписаниеТоваров(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование КАК Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.СписаниеНедостачТоваров.ВидыЗапасов КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И НЕ тТовары.Ссылка.СтатьяРасходов = &СтатьяНедостачиПриИнвентаризации
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура),
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код,
	|	СУММА(тТовары.Количество),
	|	0,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И тТовары.НаДоходыРасходы
	|	И (тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ИЛИ тТовары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|				И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(тТовары.Ссылка.ДокументОснование КАК Документ.РеализацияТоваровУслуг).ВернутьМногооборотнуюТару, ЛОЖЬ))
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код"
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_ТребованиеНакладная(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование КАК Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ВнутреннееПотребление.ВидыЗапасов КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И НЕ тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию)
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код"	
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_ПередачаМатериаловВЭксплуатацию(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.Ссылка) КАК ГУИД,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(тТовары.АналитикаУчетаНоменклатуры.Номенклатура) КАК ГУИДНоменклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование КАК Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	тТовары.НомерГТД.Код КАК НомерГТД,
	|	СУММА(тТовары.Количество) КАК КоличествоПосле,
	|	0 КАК КоличествоДо,
	|	"""" КАК Заказ,
	|	"""" КАК ВидНоменклатуры
	|ИЗ
	|	Документ.ВнутреннееПотребление.ВидыЗапасов КАК тТовары
	|ГДЕ
	|	тТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И тТовары.Ссылка.Организация = &Организация
	|	И тТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВЭксплуатацию)
	|
	|СГРУППИРОВАТЬ ПО
	|	тТовары.Ссылка,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.Наименование,
	|	тТовары.АналитикаУчетаНоменклатуры.Номенклатура.НаименованиеПолное,
	|	тТовары.НомерГТД.Код"	
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_РеализацияТоваровУслуг(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"" КАК ТипДокумента,
	|	""РеализацияТоваровУслуг"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ(ДанныеДокумента.Организация = &Аудиотехник И ДанныеДокумента.Контрагент = &КонтрагентВладимирРП И ДанныеДокумента.Склад = &СкладБольницаСА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"",
	|	""РеализацияУслугПрочихАктивов"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"",
	|	""ПередачаТоваровМеждуОрганизациями"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеДокумента.ОрганизацияПолучатель.ИНН = Контрагенты.ИНН
	|			И ДанныеДокумента.ОрганизацияПолучатель.КПП = Контрагенты.КПП
	|			И ДанныеДокумента.ОрганизацияПолучатель.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|			И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""РеализацияТоваровУслуг"",
	|	""КорректировкаРеализации"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументОснование.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара)"	
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_КорректировкаРеализации(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""КорректировкаРеализации"" КАК ТипДокумента,
	|	""КорректировкаРеализации"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументОснование.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И НЕ ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара)
	|	И НЕ ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)"	
	
КонецПроцедуры

Процедура ТекстЗапросаТовары_ВозвратТоваровОтПокупателя(ТекстЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""ВозвратТоваровОтПокупателя"" КАК ТипДокумента,
	|	""ВозвратТоваровОтКлиента"" КАК ТипДокументаЕРП,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка) КАК ГУИД,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК Контрагент,
	|	Контрагенты.Наименование КАК КонтрагентНаименование,
	|	Контрагенты.ИНН КАК КонтрагентИНН,
	|	Контрагенты.КПП КАК КонтрагентКПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументРеализации.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВозвратТоваровОтПокупателя"",
	|	""ВозвратТоваровМеждуОрганизациями"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ДанныеДокумента.Договор.Наименование,
	|	NULL,
	|	NULL,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеДокумента.Организация.ИНН = Контрагенты.ИНН
	|			И ДанныеДокумента.Организация.КПП = Контрагенты.КПП
	|			И ДанныеДокумента.Организация.ЮридическоеФизическоеЛицо = Контрагенты.ЮридическоеФизическоеЛицо
	|			И (НЕ Контрагенты.ПометкаУдаления)
	|			И НЕ Контрагенты.Наименование = ""Нифонтов Александр Викторович""
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.ОрганизацияПолучатель = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ВозвратТоваровОтПокупателя"",
	|	""КорректировкаРеализации"",
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеДокумента.Ссылка),
	|	ДанныеДокумента.Номер,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Проведен,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка),
	|	Контрагенты.Наименование,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДокумента.Организация = &Реамед
	|						ТОГДА ""Договор-оферты (сайт)""
	|					ИНАЧЕ ""Без договора""
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(ДанныеДокумента.Соглашение.ИспользуютсяДоговорыКонтрагентов, ИСТИНА)
	|			ТОГДА ""Договор-оферты (сайт)""
	|		ИНАЧЕ ДанныеДокумента.Договор.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Валюта.Код = ""643""
	|			ТОГДА NULL
	|		ИНАЧЕ ДанныеДокумента.ДокументОснование.ЗаказКлиента
	|	КОНЕЦ КАК Заказ,
	|	""ЗК"" КАК Префикс,
	|	ДанныеДокумента.СуммаДокумента
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ВЫБОР
	|				КОГДА ДанныеДокумента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|					ТОГДА Контрагенты.ИмяПредопределенныхДанных = ""РозничныйПокупатель""
	|				ИНАЧЕ ДанныеДокумента.Контрагент = Контрагенты.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)"	
	
КонецПроцедуры                                     


#КонецОбласти