//++Конарев 01.02.2023 Формирует движения по регистру РСК_УслугиСоисполнителей
//
Процедура ТекстЗапросаДвиженияОтраженияУслугСоисполнителей(Запрос, Документ) Экспорт  

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивовРасходы.Сделка КАК Сделка,
	|	ПриобретениеУслугПрочихАктивовРасходы.Содержание КАК Содержание,
	|	ПриобретениеУслугПрочихАктивовРасходы.НомерСтроки КАК КодСтроки,
	|	ПриобретениеУслугПрочихАктивовРасходы.Количество КАК Количество,
	|	ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПриобретениеУслугПрочихАктивовРасходы.Цена КАК Цена,
	|	ПриобретениеУслугПрочихАктивовРасходы.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_УслугиСоисполнителей
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивовРасходы
	|ГДЕ
	|	ПриобретениеУслугПрочихАктивовРасходы.Ссылка = &Ссылка
	|	И ПриобретениеУслугПрочихАктивовРасходы.СтатьяРасходов = &СтатьяРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УслугиСоисполнителей.Сделка КАК Сделка,
	|	ВТ_УслугиСоисполнителей.Содержание КАК Содержание,
	|	ВТ_УслугиСоисполнителей.КодСтроки КАК КодСтроки,
	|	ВТ_УслугиСоисполнителей.Количество КАК Количество,
	|	ВТ_УслугиСоисполнителей.Период КАК Период,
	|	ВТ_УслугиСоисполнителей.ВидДвижения КАК ВидДвижения,
	|	ВТ_УслугиСоисполнителей.Цена КАК Цена,
	|	ВТ_УслугиСоисполнителей.Сумма КАК Сумма
	|ИЗ
	|	ВТ_УслугиСоисполнителей КАК ВТ_УслугиСоисполнителей"; 
		
    Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);
	Запрос.УстановитьПараметр("СтатьяРасходов",ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("121008"));
	
КонецПроцедуры