
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура РСК_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	//++ НЕ УТ
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПереработчику")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
		ЗаполнитьДокументНаОснованииДанныхПереработчика(ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПереработчику2_5")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетПереработчика2_5") Тогда

		ЗаполнитьДокументНаОснованииДанныхПереработчика2_5(ДанныеЗаполнения);

	КонецЕсли;
	//-- НЕ УТ
	#Вставка 
	//Конарев++ Заполнение на основании задания торговому представителю
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		СтрокиДляЗаполнения = ПолучитьИзВременногоХранилища(ДанныеЗаполнения.АдресСтрокВоВременномХранилище);
		ЗаполнитьДокументНаОснованииДанныхЗаданияТорговомуПредставителю(ДанныеЗаполнения.ДокументОснование,СтрокиДляЗаполнения);
	КонецЕсли;
	#КонецВставки
	
	ПараметрыЗаполнения = Документы.ПриобретениеУслугПрочихАктивов.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(НалогообложениеНДС, ПараметрыЗаполнения);

	ПараметрыЗаполнения = Документы.ПриобретениеУслугПрочихАктивов.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ЗакупкаПодДеятельность, ПараметрыЗаполнения);

	ПараметрыВыбораСтатейИАналитик = Документы.ПриобретениеУслугПрочихАктивов.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);

	ВзаиморасчетыСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);

	ПриобретениеУслугПрочихАктивовЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

	ИнициализироватьДокумент(ДанныеЗаполнения);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);

КонецПроцедуры   

Процедура ЗаполнитьДокументНаОснованииДанныхЗаданияТорговомуПредставителю(Основание,СтрокиДляЗаполнения)
	
	Расходы.Загрузить(СтрокиДляЗаполнения);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание",Основание);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеТорговомуПредставителю.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ЗаданиеТорговомуПредставителю.Склад.Поклажедержатель КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(ЗаданиеТорговомуПредставителю.Склад.Поклажедержатель КАК Справочник.Контрагенты).Партнер КАК Партнер,
	|	ЗаданиеТорговомуПредставителю.ДоговорСИ КАК Договор
	|ИЗ
	|	Документ.ЗаданиеТорговомуПредставителю КАК ЗаданиеТорговомуПредставителю
	|ГДЕ
	|	ЗаданиеТорговомуПредставителю.Ссылка = &Основание";
	
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Результат);
	ЭтотОбъект.СуммаВзаиморасчетов = СтрокиДляЗаполнения.Итог("Сумма");
	ЭтотОбъект.СуммаДокумента	   = СтрокиДляЗаполнения.Итог("Сумма");
	
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура РСК_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	ПриобретениеУслугПрочихАктивовЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	ПараметрыРегистрации = Документы.ПриобретениеУслугПрочихАктивов.ПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
	УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПриПроведении(ПараметрыРегистрации);
	#Вставка
	//++Конарев 01.02.2023 Отражение услуг соисполнителей 
	ПроведениеДокументов.СформироватьДвиженияОтраженияУслугСоисполнителя(ЭтотОбъект, Отказ);
	#КонецВставки
	
КонецПроцедуры





