
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 18441
//e1cib/data/Документ.Задание?ref=ab07dee36e6144fa4febbd3758b2a1bd
	ОткрытьФорму(
		"Справочник.НоменклатураКонтрагентов.Форма.РСК_ФормаСпискаТСР",,
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
//-- КонецЗадачи 18441
КонецПроцедуры
