
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ РС Консалт: Трофимов Евгений 20.07.2022 Тикет 19109
	//e1cib/data/Документ.Задание?ref=8573c6b02148ef8e4e1c3baafe4d427b
    РСК_ПроводитьДокументыПослеЗагрузкиЧерезXML = ПараметрыСеанса.РСК_ПроводитьДокументыПослеЗагрузкиЧерезXML;              
	//-- КонецТикета 19109
	
КонецПроцедуры

&НаКлиенте
Процедура РСК_РСК_ПроводитьДокументыПослеЗагрузкиЧерезXMLПриИзмененииПосле(Элемент)
	//++ РС Консалт: Трофимов Евгений 20.07.2022 Тикет 19109
	//e1cib/data/Документ.Задание?ref=8573c6b02148ef8e4e1c3baafe4d427b
	РСК_УстановитьЗначениеПараметраСеанса("РСК_ПроводитьДокументыПослеЗагрузкиЧерезXML",РСК_ПроводитьДокументыПослеЗагрузкиЧерезXML);
	//-- КонецТикета 19109
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РСК_УстановитьЗначениеПараметраСеанса(ИмяПараметраСеанса, НовоеЗначение)
	//++ РС Консалт: Трофимов Евгений 20.07.2022 Тикет 19109
	//e1cib/data/Документ.Задание?ref=8573c6b02148ef8e4e1c3baafe4d427b
	ПараметрыСеанса[ИмяПараметраСеанса] = НовоеЗначение;
	//-- КонецТикета 19109
КонецПроцедуры // РасшТ_УстановитьЗначениеПараметраСеанса()