
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 26.10.2022 Задача 21384
	//e1cib/data/Документ.Задание?ref=b0773e366ad07a244bbad1a0c7a3ebaa
	Параметры.Свойство("ЗаказКлиента", ЗаказКлиента);
	Параметры.Свойство("НоменклатураКонтрагента", НоменклатураКонтрагента);
	Список.ТекстЗапроса = СтрЗаменить(
		Список.ТекстЗапроса,
		"ЗаказКлиентаТовары.Ссылка = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)",
		"ЗаказКлиентаТовары.Ссылка = &Заказ"
	);
	Список.ТекстЗапроса = СтрЗаменить(
		Список.ТекстЗапроса,
		"ЗаказКлиентаТовары.НоменклатураПартнера = ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)",
		"(ЗаказКлиентаТовары.НоменклатураПартнера = &НоменклатураПартнера
		|ИЛИ ЗаказКлиентаТовары.НоменклатураПартнера = ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка))"
	);
	Список.Параметры.УстановитьЗначениеПараметра("Заказ", ЗаказКлиента);
	Список.Параметры.УстановитьЗначениеПараметра("НоменклатураПартнера", НоменклатураКонтрагента);
	//-- КонецЗадачи 21384	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 26.10.2022 Задача 21384
	//e1cib/data/Документ.Задание?ref=b0773e366ad07a244bbad1a0c7a3ebaa
	СтруктураСтроки = РСК_Клиент.ПолучитьТекущуюСтроку(
		Элементы.Список,
		"Номенклатура,Характеристика,Серия,Цена"
	);
	Закрыть(СтруктураСтроки);
	//-- КонецЗадачи 21384	
КонецПроцедуры
