
&Перед("ПриСозданииФормыДокумента")
Процедура РСК_ПриСозданииФормыДокумента(ФормаДокумента, ПараметрыФормыДокумента)
	//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17528
	//e1cib/data/Документ.Задание?ref=82231effd7619b064ed35950658f28aa
	//Эта вставка нужна для того, чтобы в документе «Заказ клиента» появилась колонка «Номенклатура контрагента»

	//Спасибо доброму человеку:
	//http://forum.infostart.ru/forum9/topic260865/message2708774/#message2708774
    Если СтрНачинаетсяС(ФормаДокумента.ИмяФормы, "Документ.ЗаказКлиента") Тогда // только для заказа клиента
        ПараметрыФормыДокумента.ВариантУказанияНоменклатурыПоУмолчанию = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.ВариантУказанияНоменклатураКонтрагента();
    КонецЕсли;
	//-- КонецЗадачи 17528
КонецПроцедуры

&Вместо("УстановитьУсловноеОформлениеФормыДокумента")
Процедура РСК_УстановитьУсловноеОформлениеФормыДокумента(ФормаДокумента, ПараметрыФормыДокумента)
	//++РС Консалт: Минаков А.С.
КонецПроцедуры
