
&НаКлиенте
Процедура ИзменитьДокументы(Команда)
	Ответ = Новый Структура;
	Ответ.Вставить("ИзменятьСтатус", ИзменятьСтатус);
	Ответ.Вставить("НовыйСтатус", НовыйСтатус);
	Ответ.Вставить("ДополнитьКомментарий", ДополнитьКомментарий);
	Ответ.Вставить("ДополнительныйКомментарий", ДополнительныйКомментарий);
	Закрыть(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьСтатусПриИзменении(Элемент)
	Элементы.НовыйСтатус.Доступность = ИзменятьСтатус;
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьКомментарийПриИзменении(Элемент)
	Элементы.ДополнительныйКомментарий.Доступность = ДополнитьКомментарий;
КонецПроцедуры
