   
&НаСервере
Процедура ИзменитьФорму()
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	Элементы.Товары.Подвал = Истина;
	Элементы.ТоварыКоличествоУпаковок.ПутьКДаннымПодвала = "Объект.Товары.ИтогКоличествоУпаковок";
	
	МассивДобавить = Новый Массив(2);
	МассивДобавить[0] = Новый РеквизитФормы("РСК_Вес", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(30,ДопустимаяДлина.Переменная)), );
	МассивДобавить[1] = Новый РеквизитФормы("РСК_Кубатура", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(30,ДопустимаяДлина.Переменная)));
	ИзменитьРеквизиты(МассивДобавить);
	
	НовыйЭлементГруппа = Элементы.Добавить("ГруппаИтоги", Тип("ГруппаФормы"), Элементы.Подвал);
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
	НовыйЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлементГруппа.ЦветФона = ЦветаСтиля.ИтогиФон;
	
	НовыйЭлементГруппа = Элементы.Добавить("ГруппаВес", Тип("ГруппаФормы"), Элементы.ГруппаИтоги);
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("РСК_Вес", Тип("ПолеФормы"), НовыйЭлементГруппа);	
	НовыйЭлемент.Заголовок = "Вес всего/к отгрузке";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "РСК_Вес";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 12;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлементГруппа = Элементы.Вставить("ГруппаОбъем", Тип("ГруппаФормы"), Элементы.ГруппаИтоги, НовыйЭлементГруппа);
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("РСК_Кубатура", Тип("ПолеФормы"), НовыйЭлементГруппа);	
	НовыйЭлемент.Заголовок = "Объем всего/к отгрузке";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "РСК_Кубатура";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 12;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь
	//++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры  

&НаСервере
&После("ОбновитьКолонкуДоступноСервер")
Процедура РСК_ОбновитьКолонкуДоступноСервер()
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	РСК_РассчитатьВГХ()
	//++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры

&НаСервере
Процедура РСК_РассчитатьВГХ() 
	
	//++ РС Консалт: Минаков А.С. Задача 20226  
	ТаблицаТовары = Объект.Товары.Выгрузить(, "Номенклатура,Характеристика,Серия,КоличествоУпаковок,Упаковка,ВариантОбеспечения");
	//++ РС Консалт: Минаков А.С. Задача 20226 
		
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	Если ТаблицаТовары.Количество() Тогда
		ВГХПоказатели = РСК_ВызовСервера.РассчитатьВесогабаритныеХарактеристикиДокумента(ТаблицаТовары);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВГХПоказатели);  
	Иначе
		РСК_Вес      = "0/0";
		РСК_Кубатура = "0/0";
	КонецЕсли;
	//-- 
	
КонецПроцедуры

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура РСК_ПриЧтенииСозданииНаСервере()
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	ИзменитьФорму();
	РСК_РассчитатьВГХ()
	//++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры

&НаКлиенте
&После("ТоварыПриОкончанииРедактирования")
Процедура РСК_ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	//++ РС Консалт: Минаков А.С. Задача 20226
	РСК_РассчитатьВГХ()
	//++ РС Консалт: Минаков А.С. Задача 20226	
	
КонецПроцедуры

//РСК+ Кикинева А.Г. заявка 256971 заполнение документа остатками по складу отправителю
&НаСервере
Функция ЗаполнитьТоварПоОстаткамСкладаСервер()
	
	Документ=РеквизитФормыВЗначение("Объект");  
	
	ЗапросТекст = "ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.Склад КАК Склад,
|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
|	ТоварыНаСкладахОстатки.Серия КАК Серия,
|	ВЫБОР
|		КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|				ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток)
|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
|	КОНЕЦ КАК Количество,
|	ВЫБОР
|		КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|				ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток)
|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
|	КОНЕЦ КАК КоличествоУпаковок,
|	ВЫБОР
|		КОГДА НЕ ТоварыНаСкладахОстатки.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
|			ТОГДА 14
|	КОНЕЦ КАК СтатусУказанияСерий,
|   ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить) КАК ВариантОбеспечения
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, &Склад = Склад) КАК ТоварыКОтгрузкеОстатки
|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыКОтгрузкеОстатки.Характеристика
|			И ТоварыНаСкладахОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
|ГДЕ
|	ВЫБОР
|			КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|					ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|				ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток) > 0
|			ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
|		КОНЕЦ
|
|УПОРЯДОЧИТЬ ПО
|	ТоварыНаСкладахОстатки.Номенклатура.Наименование,
|	ТоварыНаСкладахОстатки.Характеристика.Наименование";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;                                   
	Запрос.УстановитьПараметр("Дата", Документ.Дата);
	Запрос.УстановитьПараметр("Склад", Документ.СкладОтправитель);   
	
	Документ.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецФункции

&НаКлиенте
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТоварПоОстаткамСкладаСервер();	
		ОбновитьФорму= Новый Структура;
		ЭтаФорма.Записать(ОбновитьФорму);
	КонецЕсли;	     
	
	КонецПроцедуры

 &НаКлиенте
 Процедура ЗаполнитьТоварПоОстаткамСклада(Команда)   
	 
	 Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект);
	 ТекстВопроса = "Табличная часть будет заполнена остатками на складе. Продолжить?";
	 ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	  
КонецПроцедуры


&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ЗаполнитьТоварПоОстаткамСклада");
	НоваяКоманда.Действие = "ЗаполнитьТоварПоОстаткамСклада";
	НоваяКоманда.Заголовок = "Заполнить по остаткам";
	//Создаем Кнопку
	НоваяКнопка = ЭтаФорма.Элементы.Добавить("КнопкаВГруппеТовары", Тип("КнопкаФормы"),ЭтаФорма.Элементы.ГруппаЗаполнить);
	НоваяКнопка.ИмяКоманды = "ЗаполнитьТоварПоОстаткамСклада";    
	
	КонецПроцедуры

//РСК- Кикинева А.Г. заявка 256971 заполнение документа остатками по склду отправителю

//++ РС Консалт: Трофимов Евгений 07.04.2023 Тикет 25052
//e1cib/data/Документ.Задание?ref=a4a67cdb5bddc0eb45ea7796c621b6ea
&НаКлиенте
Процедура ОбновитьВидимостьЭлементовПриЗаполненииНаОсновании() Экспорт

	//Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтаФорма);
	//ПриЧтенииСозданииНаСервере();

КонецПроцедуры


