
&После("ПередЗаписью")
Процедура РСК_ПередЗаписью(Отказ)
	
	//++РС Консалт: Минаков А.С. Задача 25303
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат
	КонецЕсли;
	
	СкладыСоисполнителей = реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("РС_Склад", "СКЛАДЫ СОИСПОЛНИТЕЛЕЙ");
	
	ДополнительныеСвойства.Вставить("РС_МожноУстановитьСвойствоСоисполнитель", ЭтоНовый() Или Справочники.Склады.ИерархияГрупп(Ссылка).Найти(СкладыСоисполнителей) = Неопределено)
	//++РС Консалт: Минаков А.С. Задача 25303
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура РСК_ПриЗаписи(Отказ)
	
	//++РС Консалт: Минаков А.С. Задача 25303
	Перем РС_МожноУстановитьСвойствоСоисполнитель;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат
	КонецЕсли;
		
	ДополнительныеСвойства.Свойство("РС_МожноУстановитьСвойствоСоисполнитель", РС_МожноУстановитьСвойствоСоисполнитель);
	
	Если РС_МожноУстановитьСвойствоСоисполнитель Тогда
		
		СкладыСоисполнителей = реа_ОбщийСерверПовтИсп.ПолучитьПредопределенноеЗначение("РС_Склад", "СКЛАДЫ СОИСПОЛНИТЕЛЕЙ");
		
		Если Не Справочники.Склады.ИерархияГрупп(Ссылка).Найти(СкладыСоисполнителей) = Неопределено Тогда		
			Если Не УправлениеСвойствами.ЗначениеСвойства(Ссылка, "РС_СкладыСоисполнения") = Истина Тогда							
				МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
				
				МенеджерЗаписи.Объект = Ссылка;
				МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "РС_СкладыСоисполнения");
				МенеджерЗаписи.Значение = Истина;
				
				МенеджерЗаписи.Записать(Истина)			
			КонецЕсли	
		КонецЕсли
	КонецЕсли
	//++РС Консалт: Минаков А.С. Задача 25303
	
КонецПроцедуры


