
&НаСервере
Процедура КопироватьПараметрыНаСервере()
	Сообщить(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КопироватьПараметры(Команда)   
	ОбъектЗагрузки=Неопределено;
	Если ЗначениеЗаполнено(Номенклатура) Тогда 
		ОбъектЗагрузки=Номенклатура;
	КонецЕсли;
	Если ЗначениеЗаполнено(Характеристика) Тогда 
		ОбъектЗагрузки=Характеристика;
	КонецЕсли;
    Если ЗначениеЗаполнено(Серия) Тогда 
		ОбъектЗагрузки=Серия;
	КонецЕсли;
    ЭтаФорма.Закрыть(ОбъектЗагрузки);

	
	//КопироватьПараметрыНаСервере();
КонецПроцедуры
