
&ИзменениеИКонтроль("ИдентификаторОбъектаМетаданных")
Функция РСК_ИдентификаторОбъектаМетаданных(ОписаниеОбъектаМетаданных, ВызыватьИсключение)
	#Вставка
	//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17663
	//e1cib/data/Документ.Задание?ref=88f3f13427c9f0f148712e5847a0baaa
                  
	//Эта корректировка нужна для адаптации расширения к версионированию объектов.
	Если ТипЗнч(ОписаниеОбъектаМетаданных) = Тип("Строка") Тогда
		ИдентификаторРасширения = Справочники.ИдентификаторыОбъектовРасширений.НайтиПоНаименованию(ОписаниеОбъектаМетаданных, Истина);
		Если ЗначениеЗаполнено(ИдентификаторРасширения) Тогда
			Возврат ИдентификаторРасширения;
		КонецЕсли;
	КонецЕсли;
	//-- КонецЗадачи 17663
	#КонецВставки

	Возврат Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(
	ОписаниеОбъектаМетаданных, ВызыватьИсключение);

КонецФункции  

Процедура ВыполнитьАлгоритм(Знач Алгоритм, Знач Параметры = Неопределено) Экспорт
		
	Выполнить Алгоритм;
	
КонецПроцедуры


