
&ИзменениеИКонтроль("УстановитьБлокировкуРегистров")
Процедура РСК_УстановитьБлокировкуРегистров(ДокументОбъект, МенеджерВременныхТаблиц)
	
	#Вставка     
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("НеИспользоватьБлокировкуРегистров") Тогда   
		Возврат;
	КонецЕсли;
	#КонецВставки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтборыОстатков.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	ВтОтборыОстатковОрганизаций КАК ОтборыОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтборыОстатков.ВидЗапасов КАК ВидЗапасов
	|ИЗ
	|	ВтОтборыОстатковОрганизаций КАК ОтборыОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ОтборыОстатков.ВидЗапасов = ВидыЗапасов.Ссылка
	|ГДЕ
	|	(ВидыЗапасов.ЭтоДубль
	|			ИЛИ ВидыЗапасов.Устаревший)";

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	РезультатЗапросаОтборОстатков			= РезультатЗапроса[0];
	РезультатЗапросаУстаревшиеВидыЗапасов	= РезультатЗапроса[1];

	ОбъектДвижения = ?(ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Сторно"),
	ДокументОбъект.СторнируемыйДокумент.ПолучитьОбъект(),
	ДокументОбъект);

	Блокировка = Новый БлокировкаДанных;

	Если ЕстьДвижениеВКоллекции(ОбъектДвижения, "ТоварыОрганизаций") Тогда

		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыОрганизаций");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапросаОтборОстатков;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("АналитикаУчетаНоменклатуры", "АналитикаУчетаНоменклатуры");

		Если ЕстьДвижениеВКоллекции(ДокументОбъект,"РезервыТоваровОрганизаций") = Неопределено Тогда
			ТекстИсключения = НСтр("ru = 'Ошибка в описании движений документа: документ является регистратором %Регистр1% и не является регистратором %Регистр2%.';
			|en = 'An error occurred in the document record description: the document is the %Регистр1% recorder and is not the %Регистр2% recorder.'");
			ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Регистр2%", "РезервыТоваровОрганизаций");
			ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Регистр1%", "ТоварыОрганизаций");

			ВызватьИсключение ТекстИсключения;
		КонецЕсли;

		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТоваровОрганизаций");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапросаОтборОстатков;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("АналитикаУчетаНоменклатуры", "АналитикаУчетаНоменклатуры");

		Если Не РезультатЗапросаУстаревшиеВидыЗапасов.Пустой() Тогда
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УстаревшиеВидыЗапасовСОстатками");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапросаУстаревшиеВидыЗапасов;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ВидЗапасов", "ВидЗапасов");
		КонецЕсли;

	КонецЕсли;

	Если ЕстьДвижениеВКоллекции(ОбъектДвижения, "ТоварыКОформлениюОтчетовКомитенту") Тогда

		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапросаОтборОстатков;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("АналитикаУчетаНоменклатуры", "АналитикаУчетаНоменклатуры");

	КонецЕсли;

	//++ НЕ УТ
	Если ЕстьДвижениеВКоллекции(ОбъектДвижения, "ТоварыПереданныеПереработчику") Тогда

		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыПереданныеПереработчику");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапросаОтборОстатков;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("АналитикаУчетаНоменклатуры", "АналитикаУчетаНоменклатуры");

	КонецЕсли;
	//-- НЕ УТ

	Если ЕстьДвижениеВКоллекции(ОбъектДвижения, "ТоварыПереданныеНаКомиссию") Тогда

		ЗапросПоКомиссии = Новый Запрос;
		ЗапросПоКомиссии.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтборыОстатков.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
		|ИЗ
		|	ВтОтборыОстатковОрганизаций КАК ОтборыОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АналитикаКомиссионера.КлючАналитики КАК АналитикаУчетаНоменклатуры
		|ИЗ
		|	ВтОтборыОстатковОрганизаций КАК ОтборыОстатков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
		|		ПО Ключи.Ссылка = ОтборыОстатков.АналитикаУчетаНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаКомиссионера
		|		ПО АналитикаКомиссионера.Номенклатура = Ключи.Номенклатура
		|			И АналитикаКомиссионера.Характеристика = Ключи.Характеристика
		|			И АналитикаКомиссионера.Серия = Ключи.Серия
		|			И АналитикаКомиссионера.МестоХранения = &Партнер
		|			И АналитикаКомиссионера.Назначение = Ключи.Назначение
		//++ НЕ УТ
		|			И АналитикаКомиссионера.СтатьяКалькуляции = Ключи.СтатьяКалькуляции
		//-- НЕ УТ
		|";

		ЗапросПоКомиссии.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

		Если ТипЗнч(ОбъектДвижения) = Тип("ДокументОбъект.ОтчетПоКомиссииМеждуОрганизациями") Тогда
			ЗапросПоКомиссии.УстановитьПараметр("Партнер", ОбъектДвижения.Комиссионер);
		Иначе
			ЗапросПоКомиссии.УстановитьПараметр("Партнер", ОбъектДвижения.Партнер);
		КонецЕсли;

		РезультатЗапросаПоКомиссии = ЗапросПоКомиссии.Выполнить();

		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыПереданныеНаКомиссию");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапросаПоКомиссии;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("АналитикаУчетаНоменклатуры", "АналитикаУчетаНоменклатуры");

	КонецЕсли;

	Блокировка.Заблокировать();

КонецПроцедуры
