&НаКлиенте
&ИзменениеИКонтроль("СоглашениеНачалоВыбора")
Процедура РСК_СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Удаление
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();

	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Владелец;
	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	ПараметрыВыбораСоглашения.ДатаДокумента               = ТекущаяДатаСервера();
	ПараметрыВыбораСоглашения.ТолькоИспользуемыеВРаботеТП = Истина;;
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;

	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
	#КонецУдаления
	#Вставка
	УстановитьПараметрыВыбора();
	ЗакупкиКлиент.НачалоВыбораСоглашенияСПоставщиком(Элемент,СтандартнаяОбработка,Объект.Владелец,Объект.Соглашение);
	#КонецВставки
	
КонецПроцедуры     

&НаСервере
Процедура УстановитьПараметрыВыбора()
	Отбор = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Действует", Истина);
	Отбор.Добавить(НовыйПараметр);
	Элементы.Соглашение.ПараметрыВыбора = Новый ФиксированныйМассив(Отбор);	
КонецПроцедуры
