
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	тз = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы);
	Параметры.Свойство("Валюта", Валюта);
	Параметры.Свойство("ДатаКурсаВалют", ДатаКурсаВалют);
	ВалютаРегл = Валюта;	
	Список.Загрузить(тз);
	СписокРегл.Загрузить(тз);
	Элементы.СписокСумма.ТекстПодвала = Формат(тз.Итог("Сумма"), "ЧДЦ=2");
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Сум = 0;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		Сум = Сум + ДанныеСтроки.Сумма;
	КонецЦикла;
	СуммаВыделенных = Сум;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Валюта) Тогда
		Возврат;
	КонецЕсли;
	ПересчётВВалюту();
	СписокПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПересчётВВалюту()
	Для Каждого Стр Из СписокРегл Цикл
		СтрокиСписка = Список.НайтиСтроки(Новый Структура("Колонка", Стр.Колонка));
		НС = СтрокиСписка[0];
		НС.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(Стр.Сумма, ВалютаРегл, Валюта, ДатаКурсаВалют);
	КонецЦикла;
	Элементы.СписокСумма.ТекстПодвала = Формат(Список.Выгрузить().Итог("Сумма"), "ЧДЦ=2");
КонецПроцедуры // ПересчётВВалюту()

