
//&После("ПередЗаписью")
Процедура ПередЗаписью(Отказ, Замещение)
	//++ РС Консалт: Трофимов Евгений 30.10.2022 Задача 21498
	//e1cib/data/Документ.Задание?ref=876c2b135606fdde465629558f95c2e0
	Если ЭтотОбъект.Количество() > 0 Тогда
		Если ТипЗнч(ЭтотОбъект[0].Регистратор) = Тип("ДокументСсылка.ЗаказПоставщику") 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект[0].Регистратор, "Дата") < '2022.01.01' Тогда
			
			ЭтотОбъект.Очистить();
			
		КонецЕсли;
	КонецЕсли;
	//-- КонецЗадачи 21498	
КонецПроцедуры
