

&ИзменениеИКонтроль("ПодборВРасшифровкуПлатежа")
Процедура РСК_ПодборВРасшифровкуПлатежа(Форма, ИмяЭлемента, Оповещение, ДополнительныеОтборы)
	
	Попытка
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыМеханизма = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "Взаиморасчеты");
	СтруктураПараметров = ВзаиморасчетыКлиентСервер.СтруктураПараметровПоИмениЭлемента(ПараметрыМеханизма.МассивПараметров, ИмяЭлемента);
	
	ПартнерПрочиеОтношения = СтруктураПараметров.ПартнерПрочиеОтношения;
	ПодборДебиторскойЗадолженности = СтруктураПараметров.ПодборДебиторскойЗадолженности;
	ПодборТолькоБезусловнойЗадолженности = СтруктураПараметров.ПодборТолькоБезусловнойЗадолженности;
	
	Контрагент           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Контрагент);
	Ссылка               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Ссылка);
	Организация          = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Организация);
	Валюта               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ВалютаДокумента);
	СуммаДокумента       = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.СуммаДокумента);
	Дата                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.Дата);
	ИдентификаторПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Форма, СтруктураПараметров.ИдентификаторПлатежа);
	ТипРасчетов          = СтруктураПараметров.ТипРасчетов;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОбъектСсылка",                          Ссылка);
	ПараметрыОткрытия.Вставить("АдресПлатежейВХранилище",               СтруктураПараметров.АдресРасшифровкаПлатежа);
	ПараметрыОткрытия.Вставить("Организация",                           Организация);
	ПараметрыОткрытия.Вставить("Контрагент",                            Контрагент);
	ПараметрыОткрытия.Вставить("ВалютаДокумента",                       Валюта);
	ПараметрыОткрытия.Вставить("СуммаДокумента",                        СуммаДокумента);
	ПараметрыОткрытия.Вставить("ДатаДокумента",                         Дата);
	ПараметрыОткрытия.Вставить("ТипРасчетов",                           ТипРасчетов);
	ПараметрыОткрытия.Вставить("ИдентификаторПлатежа",                  ИдентификаторПлатежа);
	ПараметрыОткрытия.Вставить("ПартнерПрочиеОтношения",                ПартнерПрочиеОтношения);
	ПараметрыОткрытия.Вставить("УчитыватьФилиалы",                      Истина);
	ПараметрыОткрытия.Вставить("ПодборДебиторскойЗадолженности",        ПодборДебиторскойЗадолженности);
	ПараметрыОткрытия.Вставить("ПодборТолькоБезусловнойЗадолженности",  ПодборТолькоБезусловнойЗадолженности);
	ПараметрыОткрытия.Вставить("ДополнительныеОтборы",                  ДополнительныеОтборы);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("СтруктураПараметров", СтруктураПараметров);
	ДополнительныеПараметры.Вставить("ОповещениеПослеЗавершения", Оповещение);
	ДополнительныеПараметры.Вставить("ПараметрыМеханизма", ПараметрыМеханизма);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодборВРасшифровкуПлатежаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	#Удаление
	ОткрытьФорму(
		"Справочник.ОбъектыРасчетов.Форма.ПодборОбъектовРасчетов",
		ПараметрыОткрытия, 
		Форма,,,,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#КонецУдаления
	#Вставка
	ОткрытьФорму(
	"Справочник.ОбъектыРасчетов.Форма.РС_ПодборОбъектовРасчетов",
	ПараметрыОткрытия, 
	Форма,,,,
	ОповещениеОЗакрытии,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	#КонецВставки
	
КонецПроцедуры
