
&После("ОбработкаПолученияФормыСправочникаФизическиеЛица")
Процедура РСК_ОбработкаПолученияФормыСправочникаФизическиеЛица(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17962
	//e1cib/data/Документ.Задание?ref=9b4a4bd78853fc894a29395571ad63e6
	
	//В документе «Задание на перевозку» имеется реквизит «Водитель». Это Физ.лицо.
	//Заказчик попросил, чтобы транспортное средство указывалось в карточке водителя.
	//При тестировании под неполноправным пользователем выяснилось, что карточка физ.лица открывает другую форму (типа упрощённую)
	//В упрощённой форме отсуствуют нужные для заказчика реквизиты, поэтому избавляемся от этой замены форм так:
	Если УправлениеДоступом.ЕстьРоль("РСК_МенеджерПоВыдачеТСР") Тогда 
		СтандартнаяОбработка = Истина;
		Если ВидФормы = "ФормаВыбора" Тогда
			ВыбраннаяФорма = "ФормаВыбора";
		ИначеЕсли ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "ФормаЭлемента";
		КонецЕсли;
	КонецЕсли;
	//-- КонецЗадачи 17962
КонецПроцедуры
