
&НаСервере
&Вместо("ЗаполнитьСведенияОПоставщике")
Функция САВ_ЗаполнитьСведенияОПоставщике()
	Результат = "";
	
	СтруктураЗаписи = ПодготовитьДанныеЗаписиРегистра();
	РезультатСведенияОПоставщике =
		ЭлектронноеАктированиеЕИС.СведенияОПоставщикеИЕгоПодписантах(Организация, СтруктураЗаписи);
	Если РезультатСведенияОПоставщике.Выполнено Тогда
		СведенияОПоставщике = РезультатСведенияОПоставщике.СведенияОПоставщике;
		ИдентификаторУчастникаДокументооборота =
			СведенияОПоставщике.ИдентификаторУчастникаДокументооборота;
		НаименованиеОрганизации = СведенияОПоставщике.ПолноеНаименование;
		Подписанты.Очистить();
		Для каждого Подписант Из СведенияОПоставщике.Подписанты Цикл
			Строка = Подписанты.Добавить();
			Строка.ФИО = СтрШаблон("%1 %2 %3", Подписант.Фамилия,
				Подписант.Имя, Подписант.Отчество);
			Строка.Должность = Подписант.Должность;
			ЭлектронноеАктированиеЕИС.СохранитьПодписанта(Организация, Подписант)
		КонецЦикла;
		СклоняемаяСтрока = НСтр("ru = 'сотрудник';
								|en = 'сотрудник'");
		КоличествоПодписантов = Подписанты.Количество();
		ПодписантыНадпись = ПолучитьСклоненияСтрокиПоЧислу(
			СклоняемаяСтрока,
			КоличествоПодписантов, ,
			"ЧС=Количественное",
			"ПД=Именительный")[0];
		ДанныеЛичногоКабинетаПолучены = Истина;
	Иначе
		Результат = РезультатСведенияОПоставщике.ОписаниеОшибки;
		ДанныеЛичногоКабинетаПолучены = Ложь;
	КонецЕсли;
	
	УправлениеЭУ();
	Возврат Результат;

КонецФункции
