
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// СтрДанные = Новый Структура("Основание", ПараметрКоманды);
	//ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", СтрДанные);
	//
	//ОткрытьФорму("Документ.ЗаказНаПеремещение.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.ЗаданиеТорговомуПредставителю.Форма.ФормаДокумента" 
		И ПараметрыВыполненияКоманды.Источник.Модифицированность = Истина Тогда
		
		ПоказатьПредупреждение(,"Нужно записать изменения в документе");
		Возврат;
		
	КонецЕсли;   
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента" 
		И ПараметрыВыполненияКоманды.Источник.Модифицированность = Истина Тогда
		
		ПоказатьПредупреждение(,"Нужно записать изменения в документе");
		Возврат;
		
	КонецЕсли;                  

	ФормаРеализации = ПолучитьФорму(
		"Документ.ЗаказНаПеремещение.ФормаОбъекта",,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	ДанныеФормы = ФормаРеализации.Объект;
	ЗаполнитьФормуНаСервере(ДанныеФормы, ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, ФормаРеализации.Объект);
	ФормаРеализации.Открыть();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере(ДанныеФормы, ОтчетПоВыдачеТСР)
	УстановитьПривилегированныйРежим(Истина);
	оРеал = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	оРеал.Заполнить(ОтчетПоВыдачеТСР);
	ЗначениеВДанныеФормы(оРеал, ДанныеФормы);
КонецПроцедуры
