
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++РС Консалт Назаров М.Ю. 22 июля 2022 г. 15:33:59 чтобы договра можно выбрать из формы в заказе клиента
	Значения = Новый Массив;
	Значения.Добавить(Истина);
	Значения.Добавить(Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"КомиссионныеПродажи25",
	Значения,
	ВидСравненияКомпоновкиДанных.ВСписке,
	Неопределено,
	ЗначениеЗаполнено(Партнер));
	//--РС Консалт Назаров М.Ю. 22 июля 2022 г. 15:33:59

КонецПроцедуры
