
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура РСК_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ВнешнийОбъект = Параметры.ВнешнийОбъект;
	МетаданныеПотребителя = Параметры.ВнешнийОбъект.Метаданные();
	ИмяПотребителя = ?(МетаданныеПотребителя.Синоним <> "",
	МетаданныеПотребителя.Синоним,
	МетаданныеПотребителя.Имя);
	ПолноеИмяПотребителя = МетаданныеПотребителя.ПолноеИмя();

	ОбновитьПредставлениеСоздаваемогоОбъекта();
    #Вставка 
	Если ОбщегоНазначения.ЭтоДокумент(МетаданныеПотребителя) И 
			НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнешнийОбъект,"Проведен") Тогда  
		Элементы.ГруппаСтраницаНетСвязанногоОбъекта.Доступность = Ложь;		
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
