
&ИзменениеИКонтроль("ТекстЗапросаТаблицаТоварыОрганизаций")
Функция РСК_ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ТоварыОрганизаций";

	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтВидыЗапасов", ТекстыЗапроса) Тогда
		ТекстЗапросаВтВидыЗапасов(Запрос, ТекстыЗапроса);
	КонецЕсли;

	ТекстЗапроса = "
	// приход продукции и возвратных отходов по получателю
	|ВЫБРАТЬ
	|	&Дата													КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)					КАК ВидДвижения,
	|	втВидыЗапасов.АналитикаУчетаНоменклатурыПоПолучателю	КАК АналитикаУчетаНоменклатуры,
	|	&Организация											КАК Организация,
	|	втВидыЗапасов.ВидЗапасов								КАК ВидЗапасов,
	#Удаление
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)				КАК НомерГТД,
	#КонецУдаления
	#Вставка
	//++ РС Консалт: Минаков А.С. Задача 25314
	|	втВидыЗапасов.НомерГТД									КАК НомерГТД,
	//++ РС Консалт: Минаков А.С. Задача 25314
	#КонецВставки
	|	втВидыЗапасов.Количество								КАК Количество,
	|	втВидыЗапасов.КоличествоПоРНПТ							КАК КоличествоПоРНПТ,
	|	0														КАК КОформлениюСписания,
	|	0														КАК КОформлениюСписанияПоРНПТ,
	|	втВидыЗапасов.ХозяйственнаяОперация						КАК ХозяйственнаяОперация,
	|	втВидыЗапасов.ВидДеятельностиНДС						КАК НалогообложениеНДС,
	|	втВидыЗапасов.Номенклатура								КАК Номенклатура,
	|	втВидыЗапасов.Характеристика							КАК Характеристика,
	|	ИСТИНА													КАК Первичное
	|ИЗ
	|	втВидыЗапасов КАК втВидыЗапасов
	|
	|ГДЕ
	|	втВидыЗапасов.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// списание материалов из кладовых
	|ВЫБРАТЬ
	|	&Дата													КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)					КАК ВидДвижения,
	|	втВидыЗапасов.АналитикаУчетаНоменклатурыПоОтправителю	КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА втВидыЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА втВидыЗапасов.ВидЗапасовВладельца.Организация
	|		ИНАЧЕ &Организация
	|	КОНЕЦ													КАК Организация,
	|	ВЫБОР
	|		КОГДА втВидыЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА втВидыЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ втВидыЗапасов.ВидЗапасов
	|	КОНЕЦ													КАК ВидЗапасов,
	|	втВидыЗапасов.НомерГТД									КАК НомерГТД,
	|	втВидыЗапасов.Количество								КАК Количество,
	|	втВидыЗапасов.КоличествоПоРНПТ							КАК КоличествоПоРНПТ,
	|	0														КАК КОформлениюСписания,
	|	0														КАК КОформлениюСписанияПоРНПТ,
	|	втВидыЗапасов.ХозяйственнаяОперация						КАК ХозяйственнаяОперация,
	|	втВидыЗапасов.ВидДеятельностиНДС						КАК НалогообложениеНДС,
	|	втВидыЗапасов.Номенклатура								КАК Номенклатура,
	|	втВидыЗапасов.Характеристика							КАК Характеристика,
	|	ИСТИНА													КАК Первичное
	|ИЗ
	|	втВидыЗапасов КАК втВидыЗапасов
	|
	|ГДЕ
	|	втВидыЗапасов.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|	И НЕ втВидыЗапасов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|	И НЕ втВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаВтТовары")
Функция РСК_ТекстЗапросаВтТовары(Запрос, ТекстыЗапроса)

	ИмяРегистра = "ВтТовары";

	УстановитьПараметрЗапросаПустаяАналитикаУчетаПартий(Запрос);

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаАналитикУчетаПартий", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаАналитикУчетаПартий(Запрос, ТекстыЗапроса);
	КонецЕсли;

	//++ НЕ УТКА

	//++ Устарело_Переработка24
	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаЗаказовДавальцаПоНазначениям", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаЗаказовДавальцаПоНазначениям(Запрос, ТекстыЗапроса, "ВидыЗапасов");
	КонецЕсли;
	//-- Устарело_Переработка24

	//-- НЕ УТКА

	ТекстЗапроса = 
	// Выходные изделия (товары) по получателю
	"ВЫБРАТЬ
	|	ТаблицаТовары.НаправлениеВыпуска					КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(КлючиАналитикиОтправителя.КлючАналитики, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ												КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	ТаблицаТовары.ВидЗапасов							КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО										КАК КорВидЗапасов,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий		КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО										КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <>
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС
	|		ИНАЧЕ &ВыпускПодДеятельность
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	#Удаление
	|	НЕОПРЕДЕЛЕНО										КАК НомерГТД,
	#КонецУдаления
	#Вставка
	//++ РС Консалт: Минаков А.С. Задача 25314
	|	ТаблицаТовары.НомерГТД								КАК НомерГТД,
	//++ РС Консалт: Минаков А.С. Задача 25314
	#КонецВставки
	|	ТаблицаТовары.Спецификация							КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)	КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество							КАК Количество,
	|	0													КАК КоличествоПоРНПТ,
	|	ВЫБОР
	//++ Устарело_Переработка24
	|		КОГДА ТаблицаТовары.ОформитьОтчетДавальцу
	|			ТОГДА 0
	//-- Устарело_Переработка24
	|		КОГДА ИСТИНА
	|			ТОГДА ТаблицаТовары.Сумма
	|	КОНЕЦ												КАК Сумма,
	|	0													КАК СуммаЗабалансовая,
	|		
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукции) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА &Подразделение
	|		ИНАЧЕ ТаблицаТовары.Подразделение
	|	КОНЕЦ											КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ЛОЖЬ											КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ											КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ) КАК ЦеховаяКладовая
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВидыЗапасовВыходныеИзделия КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиОтправителя
	|		ПО ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура = КлючиАналитикиОтправителя.Номенклатура
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика = КлючиАналитикиОтправителя.Характеристика
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия = КлючиАналитикиОтправителя.Серия
	|		И ТаблицаТовары.Ссылка.Подразделение = КлючиАналитикиОтправителя.МестоХранения
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение = КлючиАналитикиОтправителя.Назначение
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = КлючиАналитикиОтправителя.СтатьяКалькуляции
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки 		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти = ""ВидыЗапасовВыходныеИзделия""
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Выходные изделия (работы) по получателю
	|ВЫБРАТЬ
	|	ТаблицаТовары.НаправлениеВыпуска					КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	НЕОПРЕДЕЛЕНО										КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО										КАК КорВидЗапасов,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий		КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ СпрНоменклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА СпрНоменклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО										КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <>
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Назначение.ВидДеятельностиНДС
	|		ИНАЧЕ &ВыпускПодДеятельность
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО										КАК НомерГТД,
	|	ТаблицаТовары.Спецификация							КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)	КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество							КАК Количество,
	|	0													КАК КоличествоПоРНПТ,
	|	ТаблицаТовары.Сумма									КАК Сумма,
	|	0													КАК СуммаЗабалансовая,
	|	
	|	ТаблицаТовары.ИдентификаторСтроки					КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторСтроки					КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукции) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА &Подразделение
	|		ИНАЧЕ ТаблицаТовары.Подразделение
	|	КОНЕЦ												КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ИСТИНА												КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ												КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЛОЖЬ												КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаТовары
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК Операция
	|		ПО Операция.Ссылка = ТаблицаТовары.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СпрНоменклатура.Ссылка = ТаблицаТовары.Номенклатура
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки 		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти = ""ВыходныеИзделия""
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Работа по выходным изделиям (товарам) давальца
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)	КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)				КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ИЛИ ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(КлючиАналитикиОтправителя.КлючАналитики, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ												КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	КлючиАналитикиПолучателя.КлючАналитики				КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	НЕОПРЕДЕЛЕНО										КАК ВидЗапасов,
	|	ТаблицаТовары.ВидЗапасов							КАК КорВидЗапасов,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий		КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО										КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <>
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС
	|		ИНАЧЕ &ВыпускПодДеятельность
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО										КАК НомерГТД,
	|	ТаблицаТовары.Спецификация							КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)	КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество							КАК Количество,
	|	0													КАК КоличествоПоРНПТ,
	|	ТаблицаТовары.Сумма									КАК Сумма,
	|	0													КАК СуммаЗабалансовая,
	|	
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукции) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА &Подразделение
	|		ИНАЧЕ ТаблицаТовары.Подразделение
	|	КОНЕЦ												КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ИСТИНА												КАК Работа,
	|	ИСТИНА												КАК РаботаДляДавальца,
	|	ЛОЖЬ												КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВидыЗапасовВыходныеИзделия КАК ТаблицаТовары
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаЗаказовДавальцаПоНазначениям КАК ТаблицаЗаказовДавальцаПоНазначениям
	|		ПО ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение = ТаблицаЗаказовДавальцаПоНазначениям.Назначение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиПолучателя
	|		ПО КлючиАналитикиПолучателя.Номенклатура = ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура
	|		И КлючиАналитикиПолучателя.Характеристика = ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика
	|		И КлючиАналитикиПолучателя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		И КлючиАналитикиПолучателя.МестоХранения = ТаблицаЗаказовДавальцаПоНазначениям.Подразделение
	|		И КлючиАналитикиПолучателя.Назначение = ТаблицаЗаказовДавальцаПоНазначениям.НазначениеРабот
	|		И КлючиАналитикиПолучателя.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиОтправителя
	|		ПО ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура = КлючиАналитикиОтправителя.Номенклатура
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика = КлючиАналитикиОтправителя.Характеристика
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия = КлючиАналитикиОтправителя.Серия
	|		И ТаблицаТовары.Ссылка.Подразделение = КлючиАналитикиОтправителя.МестоХранения
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение = КлючиАналитикиОтправителя.Назначение
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = КлючиАналитикиОтправителя.СтатьяКалькуляции
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти	= ""ВидыЗапасовВыходныеИзделия""
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.ОформитьОтчетДавальцу
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Побочные изделия (товары) по получателю
	|ВЫБРАТЬ
	|	ТаблицаТовары.НаправлениеВыпуска					КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)	КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(КлючиАналитикиОтправителя.КлючАналитики, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ												КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	ТаблицаТовары.ВидЗапасов							КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО										КАК КорВидЗапасов,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий		КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО										КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <>
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС
	|		ИНАЧЕ &ВыпускПодДеятельность
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО										КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО										КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)	КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество							КАК Количество,
	|	0													КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца) ТОГДА
	|		0
	|	ИНАЧЕ
	|		ТаблицаТовары.Сумма
	|	КОНЕЦ												КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца) ТОГДА
	|		ТаблицаТовары.Сумма
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ												КАК СуммаЗабалансовая,
	|	
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукцииФиксированнаяСтоимость) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ПодразделениеПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Подразделение
	|		ИНАЧЕ ТаблицаТовары.ПодразделениеПолучатель
	|	КОНЕЦ											КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ЛОЖЬ											КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ											КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ) КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВидыЗапасовПобочныеИзделия КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиОтправителя
	|		ПО ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура = КлючиАналитикиОтправителя.Номенклатура
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика = КлючиАналитикиОтправителя.Характеристика
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия = КлючиАналитикиОтправителя.Серия
	|		И ТаблицаТовары.Подразделение = КлючиАналитикиОтправителя.МестоХранения
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение = КлючиАналитикиОтправителя.Назначение
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = КлючиАналитикиОтправителя.СтатьяКалькуляции
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти	= ""ВидыЗапасовПобочныеИзделия""
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Побочные изделия (работы) по получателю
	|ВЫБРАТЬ
	|	ТаблицаТовары.НаправлениеВыпуска					КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)	КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	НЕОПРЕДЕЛЕНО										КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО										КАК КорВидЗапасов,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий		КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ ТаблицаТовары.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Номенклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО										КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаТовары.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <>
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Назначение.ВидДеятельностиНДС
	|		ИНАЧЕ &ВыпускПодДеятельность
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО										КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО										КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)	КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество							КАК Количество,
	|	0													КАК КоличествоПоРНПТ,
	|	ТаблицаТовары.Сумма									КАК Сумма,
	|	0													КАК СуммаЗабалансовая,
	|	
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукцииФиксированнаяСтоимость) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ПодразделениеПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Подразделение
	|		ИНАЧЕ ТаблицаТовары.ПодразделениеПолучатель
	|	КОНЕЦ												КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ИСТИНА												КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ												КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЛОЖЬ												КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ПобочныеИзделия КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти	= ""ПобочныеИзделия""
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Работа по побочным изделиям (товарам) давальца
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение)			КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)	КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ИЛИ ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЕСТЬNULL(КлючиАналитикиОтправителя.КлючАналитики, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ												КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	КлючиАналитикиПолучателя.КлючАналитики				КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	НЕОПРЕДЕЛЕНО										КАК ВидЗапасов,
	|	ТаблицаТовары.ВидЗапасов							КАК КорВидЗапасов,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НаправлениеВыпуска = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий		КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ КлючиАналитикиПолучателя.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА КлючиАналитикиПолучателя.Номенклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ												КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО										КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлючиАналитикиПолучателя.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) <>
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА КлючиАналитикиПолучателя.Назначение.ВидДеятельностиНДС
	|		ИНАЧЕ &ВыпускПодДеятельность
	|	КОНЕЦ 												КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО										КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО										КАК Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)	КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество							КАК Количество,
	|	0													КАК КоличествоПоРНПТ,
	|	0													КАК Сумма,
	|	0													КАК СуммаЗабалансовая,
	|	
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукцииФиксированнаяСтоимость) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ПодразделениеПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Подразделение
	|		ИНАЧЕ ТаблицаТовары.ПодразделениеПолучатель
	|	КОНЕЦ											КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ИСТИНА											КАК Работа,
	|	ИСТИНА											КАК РаботаДляДавальца,
	|	ЛОЖЬ											КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВидыЗапасовПобочныеИзделия КАК ТаблицаТовары
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаЗаказовДавальцаПоНазначениям КАК ТаблицаЗаказовДавальцаПоНазначениям
	|		ПО ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение = ТаблицаЗаказовДавальцаПоНазначениям.Назначение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиПолучателя
	|		ПО КлючиАналитикиПолучателя.Номенклатура = ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура
	|		И КлючиАналитикиПолучателя.Характеристика = ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика
	|		И КлючиАналитикиПолучателя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|		И КлючиАналитикиПолучателя.МестоХранения = ТаблицаЗаказовДавальцаПоНазначениям.Подразделение
	|		И КлючиАналитикиПолучателя.Назначение = ТаблицаЗаказовДавальцаПоНазначениям.НазначениеРабот
	|		И КлючиАналитикиПолучателя.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиОтправителя
	|		ПО ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура = КлючиАналитикиОтправителя.Номенклатура
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика = КлючиАналитикиОтправителя.Характеристика
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия = КлючиАналитикиОтправителя.Серия
	|		И ТаблицаТовары.Ссылка.Подразделение = КлючиАналитикиОтправителя.МестоХранения
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение = КлючиАналитикиОтправителя.Назначение
	|		И ТаблицаТовары.АналитикаУчетаНоменклатуры.СтатьяКалькуляции = КлючиАналитикиОтправителя.СтатьяКалькуляции
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти	= ""ВидыЗапасовПобочныеИзделия""
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.ОформитьОтчетДавальцу
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Побочные изделия (товары) по партии
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)	КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)	КАК ХозяйственнаяОперация,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	КлючиАналитикиПолучателя.КлючАналитики			КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	ТаблицаТовары.ВидЗапасов						КАК ВидЗапасов,
	|	ТаблицаТовары.ВидЗапасов						КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО									КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий	КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка					КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА СпрПартииПроизводства.ГруппаПродукции
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК КорАналитикаФинансовогоУчета,
	|	СпрПартииПроизводства.ВидДеятельностиНДС		КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО									КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО									КАК Спецификация,
	|	ТаблицаТовары.СтатьяКалькуляции					КАК СтатьяКалькуляции,
	|	-1 * ТаблицаТовары.Количество					КАК Количество,
	|	0												КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца) ТОГДА
	|		0
	|	ИНАЧЕ
	|		-1 * ТаблицаТовары.Сумма
	|	КОНЕЦ											КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца) ТОГДА
	|		-1 * ТаблицаТовары.Сумма
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ											КАК СуммаЗабалансовая,
	|	
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукцииФиксированнаяСтоимость) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ПодразделениеПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Подразделение
	|		ИНАЧЕ ТаблицаТовары.ПодразделениеПолучатель
	|	КОНЕЦ											КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ЛОЖЬ											КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ											КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЛОЖЬ											КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВидыЗапасовПобочныеИзделия КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиПолучателя
	|		ПО КлючиАналитикиПолучателя.Номенклатура = ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура
	|		И КлючиАналитикиПолучателя.Характеристика = ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика
	|		И КлючиАналитикиПолучателя.Серия = ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия
	|		И КлючиАналитикиПолучателя.МестоХранения = ТаблицаТовары.Подразделение
	|		И КлючиАналитикиПолучателя.Назначение = ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение
	|		И КлючиАналитикиПолучателя.СтатьяКалькуляции = ТаблицаТовары.СтатьяКалькуляции
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти	= ""ВидыЗапасовПобочныеИзделия""
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Побочные изделия (работы) по партии
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)	КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)	КАК ХозяйственнаяОперация,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	КлючиАналитикиПолучателя.КлючАналитики			КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	НЕОПРЕДЕЛЕНО									КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО									КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО									КАК СтатьяРасходов,
	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий	КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка					КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА СпрПартииПроизводства.ГруппаПродукции
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК АналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			И НЕ ТаблицаТовары.Номенклатура.ГруппаАналитическогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Номенклатура.ГруппаАналитическогоУчета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК КорАналитикаФинансовогоУчета,
	|	СпрПартииПроизводства.ВидДеятельностиНДС		КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО									КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО									КАК Спецификация,
	|	ТаблицаТовары.СтатьяКалькуляции					КАК СтатьяКалькуляции,
	|	-1 * ТаблицаТовары.Количество					КАК Количество,
	|	0												КАК КоличествоПоРНПТ,
	|	-1 * ТаблицаТовары.Сумма						КАК Сумма,
	|	0												КАК СуммаЗабалансовая,
	|	
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВыпускПродукцииФиксированнаяСтоимость) КАК НастройкаХозяйственнойОперации,
	|
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ПодразделениеПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ТаблицаТовары.Подразделение
	|		ИНАЧЕ ТаблицаТовары.ПодразделениеПолучатель
	|	КОНЕЦ											КАК ПодразделениеПолучательРасходов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ТаблицаТовары.НастройкаСчетовУчета				КАК НастройкаСчетовУчета,
	|	ИСТИНА											КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ											КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЛОЖЬ											КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ПобочныеИзделия КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиПолучателя
	|		ПО КлючиАналитикиПолучателя.Номенклатура = ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура
	|		И КлючиАналитикиПолучателя.Характеристика = ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика
	|		И КлючиАналитикиПолучателя.Серия = ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия
	|		И КлючиАналитикиПолучателя.МестоХранения = ТаблицаТовары.Подразделение
	|		И КлючиАналитикиПолучателя.Назначение = ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение
	|		И КлючиАналитикиПолучателя.СтатьяКалькуляции = ТаблицаТовары.СтатьяКалькуляции
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
	|		ПО ТаблицаАналитикУчетаПартий.НомерСтроки		= ТаблицаТовары.НомерСтроки
	|		И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти	= ""ПобочныеИзделия""
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Работы по партии
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)	КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)	КАК ХозяйственнаяОперация,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	КлючиАналитикиПолучателя.КлючАналитики		КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	НЕОПРЕДЕЛЕНО								КАК ВидЗапасов,
	|	НЕОПРЕДЕЛЕНО								КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО								КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО								КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка				КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА СпрПартииПроизводства.ГруппаПродукции
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ										КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО								КАК КорАналитикаФинансовогоУчета,
	|	СпрПартииПроизводства.ВидДеятельностиНДС	КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО								КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО								КАК Спецификация,
	|	ТаблицаТовары.СтатьяКалькуляции				КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество					КАК Количество,
	|	0											КАК КоличествоПоРНПТ,
	|	0											КАК Сумма,
	|	0											КАК СуммаЗабалансовая,
	|	
	|	НЕОПРЕДЕЛЕНО								КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторСтроки			КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеРасходовНаПартииПроизводства) КАК НастройкаХозяйственнойОперации,
	|
	|	НЕОПРЕДЕЛЕНО								КАК ПодразделениеПолучательРасходов,
	|	НЕОПРЕДЕЛЕНО								КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО								КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО								КАК НастройкаСчетовУчета,
	|	ИСТИНА										КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ										КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЛОЖЬ										КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиПолучателя
	|		ПО КлючиАналитикиПолучателя.Номенклатура = ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура
	|		И КлючиАналитикиПолучателя.Характеристика = ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика
	|		И КлючиАналитикиПолучателя.Серия = ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия
	|		И КлючиАналитикиПолучателя.МестоХранения = ТаблицаТовары.Подразделение
	|		И КлючиАналитикиПолучателя.Назначение = ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение
	|		И КлючиАналитикиПолучателя.СтатьяКалькуляции = ТаблицаТовары.СтатьяКалькуляции
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Материалы по партии
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)	КАК НаправлениеВыпуска,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)	КАК ХозяйственнаяОперация,
	|	ТаблицаТовары.АналитикаУчетаНоменклатуры			КАК АналитикаУчетаНоменклатурыПоОтправителю,
	|	КлючиАналитикиПолучателя.КлючАналитики				КАК АналитикаУчетаНоменклатурыПоПолучателю,
	|	ТаблицаТовары.ВидЗапасов													КАК ВидЗапасов,
	|	ТаблицаТовары.ВидЗапасовПолучателя							КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО																		КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО																		КАК АналитикаУчетаПартий,
	|	СпрПартииПроизводства.Ссылка										КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|			ТОГДА СпрПартииПроизводства.ГруппаПродукции
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ																						КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО																		КАК КорАналитикаФинансовогоУчета,
	|	СпрПартииПроизводства.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
	|	ТаблицаТовары.НомерГТД													КАК НомерГТД,
	|	НЕОПРЕДЕЛЕНО																		КАК Спецификация,
	|	ТаблицаТовары.СтатьяКалькуляции									КАК СтатьяКалькуляции,
	|	ТаблицаТовары.Количество													КАК Количество,
	|	ТаблицаТовары.КоличествоПоРНПТ												КАК КоличествоПоРНПТ,
	|	0																									КАК Сумма,
	|	0																									КАК СуммаЗабалансовая,
	|	
	|	НЕОПРЕДЕЛЕНО											КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторСтроки					КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеРасходовНаПартииПроизводства) КАК НастройкаХозяйственнойОперации,
	|	
	|	НЕОПРЕДЕЛЕНО																		КАК ПодразделениеПолучательРасходов,
	|	НЕОПРЕДЕЛЕНО																		КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО																		КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО																		КАК НастройкаСчетовУчета,
	|	ЛОЖЬ																							КАК Работа,
	//++ НЕ УТКА

	//++ Устарело_Переработка24
	|	ЛОЖЬ																							КАК РаботаДляДавальца,
	//-- Устарело_Переработка24

	//-- НЕ УТКА
	|	ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)	КАК ЦеховаяКладовая
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВидыЗапасовМатериалыИРаботы КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиПолучателя
	|		ПО КлючиАналитикиПолучателя.Номенклатура = ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура
	|		И КлючиАналитикиПолучателя.Характеристика = ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика
	|		И КлючиАналитикиПолучателя.Серия = ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия
	|		И КлючиАналитикиПолучателя.МестоХранения = ТаблицаТовары.Подразделение
	|		И КлючиАналитикиПолучателя.Назначение = ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение
	|		И КлючиАналитикиПолучателя.СтатьяКалькуляции = ТаблицаТовары.СтатьяКалькуляции
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = &Ссылка
	|		И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра); 
	Возврат ТекстЗапроса;

КонецФункции
