
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Номенклатура", Номенклатура);
	Параметры.Свойство("Характеристика", Характеристика);
	Параметры.Свойство("Склад", Склад);
	Параметры.Свойство("Подразделение", Подразделение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РСК_АналогиИЗамены.ИсточникНоменклатура КАК Номенклатура,
	               |	РСК_АналогиИЗамены.ИсточникХарактеристика КАК Характеристика
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
	               |ГДЕ
	               |	РСК_АналогиИЗамены.ПриемникНоменклатура = &Номенклатура
	               |	И РСК_АналогиИЗамены.ПриемникХарактеристика = &Характеристика
	               |	И РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог) 
				   |	И (РСК_АналогиИЗамены.Подразделение = &Подразделение
				   |		ИЛИ РСК_АналогиИЗамены.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) 
				   |	И (РСК_АналогиИЗамены.ДатаОкончания >= &ТекущийДень
				   |		ИЛИ РСК_АналогиИЗамены.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РСК_АналогиИЗамены.ПриемникНоменклатура,
	               |	РСК_АналогиИЗамены.ПриемникХарактеристика
	               |ИЗ
	               |	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
	               |ГДЕ
	               |	РСК_АналогиИЗамены.ИсточникНоменклатура = &Номенклатура
	               |	И РСК_АналогиИЗамены.ИсточникХарактеристика = &Характеристика
	               |	И РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог) 
				   |	И (РСК_АналогиИЗамены.Подразделение = &Подразделение
				   |		ИЛИ РСК_АналогиИЗамены.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) 
				   |	И (РСК_АналогиИЗамены.ДатаОкончания >= &ТекущийДень
				   |		ИЛИ РСК_АналогиИЗамены.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РСК_АналогиИЗамены1.ИсточникНоменклатура,
	               |	РСК_АналогиИЗамены1.ИсточникХарактеристика
	               |ИЗ
	               |	РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_АналогиИЗамены КАК РСК_АналогиИЗамены1
	               |		ПО РСК_АналогиИЗамены.ПриемникНоменклатура = РСК_АналогиИЗамены1.ПриемникНоменклатура
	               |			И РСК_АналогиИЗамены.ПриемникХарактеристика = РСК_АналогиИЗамены1.ПриемникХарактеристика
	               |			И РСК_АналогиИЗамены.ВидСвязи = РСК_АналогиИЗамены1.ВидСвязи
				   |			И (РСК_АналогиИЗамены1.Подразделение = &Подразделение
				   |				ИЛИ РСК_АналогиИЗамены1.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	               |ГДЕ
	               |	РСК_АналогиИЗамены.ИсточникНоменклатура = &Номенклатура
	               |	И РСК_АналогиИЗамены.ИсточникХарактеристика = &Характеристика
	               |	И РСК_АналогиИЗамены.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.РСК_АналогиИЗаменыВидыСвязи.Аналог)
	               |	И НЕ(РСК_АналогиИЗамены1.ИсточникНоменклатура = &Номенклатура
	               |				И РСК_АналогиИЗамены1.ИсточникХарактеристика = &Характеристика) 
				   |	И (РСК_АналогиИЗамены.Подразделение = &Подразделение
				   |		ИЛИ РСК_АналогиИЗамены.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) 
				   |	И (РСК_АналогиИЗамены.ДатаОкончания >= &ТекущийДень
				   |		ИЛИ РСК_АналогиИЗамены.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))   
				   |	И (РСК_АналогиИЗамены1.ДатаОкончания >= &ТекущийДень
				   |		ИЛИ РСК_АналогиИЗамены1.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	(ВТ.Номенклатура <> &Номенклатура
	               |			ИЛИ ВТ.Характеристика <> &Характеристика)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.Номенклатура КАК Номенклатура,
	               |	ВТ2.Характеристика КАК Характеристика,
	               |	СУММА(РаспределениеЗапасов.Свободно) КАК Доступно,
	               |	спрНоменклатура.Наименование КАК Наименование,
	               |	ХарактеристикиНоменклатуры.Наименование КАК Наименование1
	               |ИЗ
	               |	ВТ2 КАК ВТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |		ПО (РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе))
	               |			И (РаспределениеЗапасов.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	               |			И (РаспределениеЗапасов.Склад = &Склад)
	               |			И (РаспределениеЗапасов.Номенклатура = ВТ2.Номенклатура)
	               |			И (РаспределениеЗапасов.Характеристика = ВТ2.Характеристика)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |		ПО ВТ2.Номенклатура = спрНоменклатура.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ПО ВТ2.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ2.Номенклатура,
	               |	ВТ2.Характеристика,
	               |	спрНоменклатура.Наименование,
	               |	ХарактеристикиНоменклатуры.Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	спрНоменклатура.Наименование,
	               |	ХарактеристикиНоменклатуры.Наименование"; 	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика); 
	Запрос.УстановитьПараметр("Склад", Склад);  
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ТекущийДень", НачалоДня(ТекущаяДата()));
	
	ТаблицаАналогов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
