
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Начало РС Консалт: Трофимов Евгений 05.07.2022 Выдача ТСР
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("РСК_АктВыдачиТСР") Тогда
			ЭтаФорма.Заголовок = "Акты выдачи ТСР";
		КонецЕсли;
	КонецЕсли;
	//Конец РС Консалт: Трофимов Евгений 05.07.2022 Выдача ТСР
КонецПроцедуры

&НаКлиенте
Процедура РСК_ИзменитьВыделенноеПосле(Команда)
	//Начало РС Консалт: Трофимов Евгений 05.07.2022 Выдача ТСР
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список); 
	//Конец РС Консалт: Трофимов Евгений 05.07.2022 Выдача ТСР
КонецПроцедуры
