
&НаКлиенте
Процедура РСК_ПриОткрытииПосле(Отказ)
	//++ РС Консалт: Трофимов Евгений 04.08.2022 Задача 19394
	//e1cib/data/Документ.Задание?ref=a08e5944efdf2c724d9f9d3c61ee1f3b
	Если ЭтоАРМКладовщика() И НЕ ОткрытЭмуляторСканера() Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФормуПоТаймауту", 1, Ложь);
	КонецЕсли;		
	//-- КонецЗадачи 19394
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 04.08.2022 Задача 19394
//e1cib/data/Документ.Задание?ref=a08e5944efdf2c724d9f9d3c61ee1f3b
&НаСервере
Функция ЭтоАРМКладовщика()
	Возврат не ПараметрыСеанса.РСК_АвторизовавшийсяКладовщик.Пустая();
КонецФункции

//++ РС Консалт: Трофимов Евгений 05.08.2022 Задача 19394
//e1cib/data/Документ.Задание?ref=a08e5944efdf2c724d9f9d3c61ee1f3b
&НаКлиенте
Функция ОткрытЭмуляторСканера()

	Окна = ПолучитьОкна();
	Для Каждого О Из Окна Цикл
		Если О.Заголовок = "Эмулятор сканера" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции // ОткрытЭмуляторСканера()


//++ РС Консалт: Трофимов Евгений 04.08.2022 Задача 19394
//e1cib/data/Документ.Задание?ref=a08e5944efdf2c724d9f9d3c61ee1f3b
&НаКлиенте
Процедура ЗакрытьФормуПоТаймауту()
	Если РСК_РаботаСоСканером.ТаймаутПрошел() Тогда
		ОтключитьОбработчикОжидания("ЗакрытьФормуПоТаймауту");
		РСК_Клиент.ЗакрытьВсеОкна();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура РСК_ОбработкаОповещенияВместо(ИмяСобытия, Параметр, Источник)
	//++ РС Консалт: Трофимов Евгений 05.08.2022 Задача 19394
	//e1cib/data/Документ.Задание?ref=a08e5944efdf2c724d9f9d3c61ee1f3b
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			РСК_РаботаСоСканером.УстановитьВремяПоследнегоСобытия();
			МассивШК = МенеджерОборудованияКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			Если  Лев(МассивШК.Штрихкод,2) = "21" И СтрДлина(МассивШК.Штрихкод) = 13 Тогда // Это операция.
				ВыполнитьСкладскуюОперациюПоШтрихкоду(МассивШК.Штрихкод)	
			Иначе //Если МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
				ОбработатьШтрихкоды(МассивШК);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	//-- КонецЗадачи 19394	
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.08.2022 Задача 19394
//e1cib/data/Документ.Задание?ref=a08e5944efdf2c724d9f9d3c61ee1f3b
&НаКлиенте
Процедура ВыполнитьСкладскуюОперациюПоШтрихкоду(ШК)
	НайденнаяОперация = РСК_РаботаСоСканером.ОперацияПоШтрихкоду(ШК);
	Если НайденнаяОперация = ПредопределенноеЗначение("Справочник.РСК_СкладскиеОперации.Завершено") Тогда
		РСК_РаботаСоСканером.УстановитьПараметрСеансаАвторизованныйКладовщик(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
		РСК_Клиент.ЗакрытьВсеОкна();
	КонецЕсли;	
КонецПроцедуры
