Функция ПользовательЯвляетсяМатериальноОтветственнымЛицом(Склад, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтветственноеЛицо",Пользователь);
	Запрос.УстановитьПараметр("Склад",Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РСК_МатериальноОтветственныеЛица.ОтветственноеЛицо КАК ОтветственноеЛицо
	|ИЗ
	|	РегистрСведений.РСК_МатериальноОтветственныеЛица КАК РСК_МатериальноОтветственныеЛица
	|ГДЕ
	|	РСК_МатериальноОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
	|	И РСК_МатериальноОтветственныеЛица.Склад = &Склад";  
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции    

Функция ДляСкладаУстановленоОграничениеПроведения(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад",Склад);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РСК_МатериальноОтветственныеЛица.Склад КАК Склад
	|ИЗ
	|	РегистрСведений.РСК_МатериальноОтветственныеЛица КАК РСК_МатериальноОтветственныеЛица
	|ГДЕ
	|	РСК_МатериальноОтветственныеЛица.Склад = &Склад";
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции