
&ИзменениеИКонтроль("ЗаполнитьПараметрыЗаказаНаДоставку")
Процедура РСК_ЗаполнитьПараметрыЗаказаНаДоставку(Параметры)

	ДокументыОснования = Параметры.ДокументыОснования;

	Если ДокументыОснования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ШаблонЗапросаШапка =
	"ВЫБРАТЬ
	|Т.Ссылка КАК ДокументОснование,
	|0 КАК ФормаОплаты,
	|NULL КАК ГрузоперевозчикСсылка,
	|"""" КАК ГрузоперевозчикИдентификатор,
	|"""" КАК ГрузоперевозчикНаименование,
	|"""" КАК ГрузоперевозчикТелефон,
	|"""" КАК ГрузоперевозчикИНН,
	|"""" КАК ГрузоперевозчикКПП,
	|"""" КАК ТарифНаименование,
	|"""" КАК ТарифИдентификатор,
	|"""" КАК ТарифНеГабарит,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ВремяОтгрузкиС,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ВремяОтгрузкиПо,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ВремяДоставкиС,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ВремяДоставкиПо,
	|0 КАК СпособОтгрузки,
	|0 КАК СпособДоставки,
	|NULL КАК Менеджер,
	|NULL КАК СкладОтправитель,
	|NULL КАК СкладПолучатель,
	|NULL КАК ОтправительКонтрагентСсылка,
	|"""" КАК ОтправительКонтрагентИНН,
	|"""" КАК ОтправительКонтрагентКПП,
	|"""" КАК ОтправительКонтрагентНаименование,
	|0 КАК ОтправительКонтрагентЮрФизЛицо,
	|NULL КАК ОтправительКонтрагентЮридическийАдресВладелец,
	|"""" КАК ОтправительКонтрагентЮридическийАдресПредставление,
	|"""" КАК ОтправительКонтрагентЮридическийАдресЗначение,
	|ЛОЖЬ КАК ОтправительКонтрагентЭтоОрганизация,
	|NULL КАК ОтправительАдресВладелец,
	|"""" КАК ОтправительАдресВладелецНаименование,
	|"""" КАК ОтправительАдресПредставление,
	|"""" КАК ОтправительАдресЗначенияПолей,
	|"""" КАК ОтправительАдресЗначение,
	|NULL КАК ОтправительКонтактноеЛицоСсылка,
	|"""" КАК ОтправительКонтактноеЛицоНаименование,
	|"""" КАК ОтправительКонтактноеЛицоТелефонПредставление,
	|"""" КАК ОтправительКонтактноеЛицоТелефонЗначение,
	|NULL КАК ПолучательКонтрагентСсылка,
	|"""" КАК ПолучательКонтрагентИНН,
	|"""" КАК ПолучательКонтрагентКПП,
	|"""" КАК ПолучательКонтрагентНаименование,
	|0 КАК ПолучательКонтрагентЮрФизЛицо,
	|NULL КАК ПолучательКонтрагентЮридическийАдресВладелец,
	|"""" КАК ПолучательКонтрагентЮридическийАдресПредставление,
	|"""" КАК ПолучательКонтрагентЮридическийАдресЗначение,
	|ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация,
	|NULL КАК ПолучательАдресВладелец,
	|"""" КАК ПолучательАдресВладелецНаименование,
	|"""" КАК ПолучательАдресПредставление,
	|"""" КАК ПолучательАдресЗначенияПолей,
	|"""" КАК ПолучательАдресЗначение,
	|NULL КАК ПолучательКонтактноеЛицоСсылка,
	|"""" КАК ПолучательКонтактноеЛицоНаименование,
	|"""" КАК ПолучательКонтактноеЛицоТелефонПредставление,
	|"""" КАК ПолучательКонтактноеЛицоТелефонЗначение,
	|NULL КАК ПлательщикКонтрагентСсылка,
	|"""" КАК ПлательщикКонтрагентИНН,
	|"""" КАК ПлательщикКонтрагентКПП,
	|"""" КАК ПлательщикКонтрагентНаименование,
	|0 КАК ПлательщикКонтрагентЮрФизЛицо,
	|ИСТИНА КАК ПлательщикКонтрагентЭтоОрганизация,
	|NULL КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	|"""" КАК ПлательщикКонтрагентЮридическийАдресПредставление,
	|"""" КАК ПлательщикКонтрагентЮридическийАдресЗначение,
	|NULL КАК ПлательщикКонтактноеЛицоСсылка,
	|"""" КАК ПлательщикКонтактноеЛицоНаименование,
	|"""" КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	|"""" КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	|1 КАК ПлательщикРоль,
	|"""" КАК ПунктПриемаГрузаИдентификатор,
	|NULL КАК ПунктПриемаГрузаСсылка,
	|"""" КАК ПунктВыдачиГрузаИдентификатор,
	|NULL КАК ПунктВыдачиГрузаСсылка,
	|0 КАК СуммаДокумента,
	|NULL КАК ВалютаСсылка,
	|"""" КАК ВалютаКод,
	|"""" КАК ВалютаНаименование,
	|ВЫБОР
	|	КОГДА ЕСТЬNULL(КурсыВалюты.Кратность, 0) > 0
	|			И ЕСТЬNULL(КурсыВалюты.Курс, 0) > 0
	|		ТОГДА КурсыВалюты.Курс / КурсыВалюты.Кратность
	|	ИНАЧЕ 1
	|КОНЕЦ КАК ВалютаКоэффициент,
	|ОрганизацииБизнесСеть.Организация КАК ОрганизацияБизнесСетиСсылка,
	|ОрганизацииБизнесСеть.Идентификатор КАК ОрганизацияБизнесСетиИдентификатор
	|ПОМЕСТИТЬ ДанныеОснований
	|ИЗ #ТаблицаДокумента КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
	|		ПО Т.Организация = ОрганизацииБизнесСеть.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалюты
	|		ПО ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) = КурсыВалюты.Валюта
	|ГДЕ
	|	Т.Ссылка В (&Основания)
	|";

	ШаблонЗапросаВидыЗапасов = 
	"ВЫБРАТЬ
	|	ТабВидыЗапасов.Ссылка КАК Ссылка,
	|	ТабВидыЗапасов.НомерСтроки КАК НомерСтроки,
	|	ТабВидыЗапасов.ВидЗапасов КАК УдалитьВидЗапасов,
	|	ТИПЗНАЧЕНИЯ(ТабВидыЗапасов.Ссылка) КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА ТабВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ТабВидыЗапасов.ВидЗапасов.Контрагент.ИНН
	|		ИНАЧЕ ТабВидыЗапасов.Ссылка.Организация.ИНН
	|	КОНЕЦ КАК ИННВладельцаГруза
	|ПОМЕСТИТЬ ТаблицаВидыЗапасов
	|ИЗ
	|	#ТаблицаДокумента КАК ТабВидыЗапасов
	|ГДЕ
	|	ТабВидыЗапасов.Ссылка В(&Основания)";

	ПустойШаблонЗапросаВидыЗапасов = 
	"ВЫБРАТЬ
	|	NULL КАК Ссылка,
	|	0 КАК НомерСтроки,
	|	NULL КАК УдалитьВидЗапасов,
	|	NULL КАК ТипДокумента,
	|	NULL КАК ИННВладельцаГруза
	|ПОМЕСТИТЬ ТаблицаВидыЗапасов
	|ГДЕ
	|	ЛОЖЬ";

	ШаблонЗапросаТовары =
	"ВЫБРАТЬ
	|Т.Ссылка КАК Ссылка,
	|&ПодстановкаАртикул КАК Артикул,
	|&ПодстановкаЭтоУслуга КАК ЭтоУслуга,
	|ДанныеВидовЗапасов.ИННВладельцаГруза КАК ИННВладельцаГруза,
	|NULL КАК Номенклатура,
	|NULL КАК Упаковка,
	|0 КАК Цена,
	|0 КАК Количество,
	|0 КАК СуммаВсего,
	|0 КАК СуммаСНДС,
	|0 КАК СуммаНДС,
	|&ПодстановкаСтавкаНДС КАК СтавкаНДС,
	|&ПодстановкаПредставлениеСтавкаНДС КАК СтавкаНДСПредставление,
	|0 КАК Вес,
	|0 КАК Объем,
	|0 КАК Длина,
	|0 КАК Ширина,
	|0 КАК Высота
	|ПОМЕСТИТЬ ДанныеОснованийТовары
	|ИЗ #ТаблицаДокумента КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|	ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасов КАК ДанныеВидовЗапасов
	|	ПО Т.Ссылка = ДанныеВидовЗапасов.Ссылка
	|		И Т.НомерСтроки = ДанныеВидовЗапасов.НомерСтроки
	|ГДЕ
	|	Т.Ссылка В (&Основания)
	|	И &ПодстановкаТипНоменклатуры
	|	И &ПодстановкаОтменено
	|";

	Основания = ДокументыОснования.ВыгрузитьЗначения();
	ОснованияПоТипам = РазложитьМассивСсылокПоТипам(Основания);
	ПервыйЗапросПоШапке = Истина;
	ПервыйЗапросПоТоварам = Истина;
	ТекстЗапроса = "";
	ТекстЗапросаПоШапке = "";
	ТекстЗапросаПоТоварам = "";
	ТекстЗапросаВидовЗапасов = "";

	Для Каждого КлючИЗначение Из ОснованияПоТипам Цикл

		МетаданныеОбъекта = Метаданные.НайтиПоТипу(КлючИЗначение.Ключ);
		ИмяТаблицыОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ИмяОбъекта = СтрРазделить(ИмяТаблицыОбъекта, ".")[1];

		ТекстЗапросаПоТипу = ШаблонЗапросаШапка;

		СНашегоСклада = ЭтоДокументОтгрузкиСНашегоСклада(ИмяОбъекта);
		НаНашСклад    = ЭтоДокументДоставкиНаНашСклад(ИмяОбъекта);

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеОбъекта) Тогда

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПлательщикКонтрагентСсылка", "Т.Организация КАК ПлательщикКонтрагентСсылка");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПлательщикКонтрагентИНН", "Т.Организация.ИНН КАК ПлательщикКонтрагентИНН");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПлательщикКонтрагентКПП", "Т.Организация.КПП КАК ПлательщикКонтрагентКПП");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПлательщикКонтрагентНаименование", "Т.Организация.НаименованиеСокращенное КАК ПлательщикКонтрагентНаименование");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПлательщикКонтрагентЮридическийАдресВладелец", "Т.Организация КАК ПлательщикКонтрагентЮридическийАдресВладелец");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ПлательщикЮрФизЛицо",
			"ВЫБОР
			|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
			|		ТОГДА 1
			|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
			|		ТОГДА 2
			|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|		ТОГДА 3
			|	ИНАЧЕ 0
			|КОНЕЦ КАК ПлательщикЮрФизЛицо");

			Если СНашегоСклада Тогда

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительКонтрагентСсылка", "Т.Организация КАК ОтправительКонтрагентСсылка");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительКонтрагентИНН", "Т.Организация.ИНН КАК ОтправительКонтрагентИНН");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительКонтрагентКПП", "Т.Организация.КПП КАК ОтправительКонтрагентКПП");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительКонтрагентНаименование", "Т.Организация.НаименованиеСокращенное КАК ОтправительКонтрагентНаименование");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ОтправительКонтрагентЮрФизЛицо",
				"ВЫБОР
				|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
				|		ТОГДА 1
				|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
				|		ТОГДА 2
				|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
				|		ТОГДА 3
				|	ИНАЧЕ 0
				|КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо");


				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеОбъекта) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительАдресВладелец", "Т.Склад КАК ОтправительАдресВладелец");
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительАдресВладелецНаименование", "Т.Склад.Наименование КАК ОтправительАдресВладелецНаименование");
				ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеОбъекта) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительАдресВладелец", "Т.СкладОтправитель КАК ОтправительАдресВладелец");
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительАдресВладелецНаименование", "Т.СкладОтправитель.Наименование КАК ОтправительАдресВладелецНаименование");
				КонецЕсли;

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительКонтрагентЮридическийАдресВладелец", "Т.Организация КАК ОтправительКонтрагентЮридическийАдресВладелец");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ЛОЖЬ КАК ОтправительКонтрагентЭтоОрганизация", "ИСТИНА КАК ОтправительКонтрагентЭтоОрганизация");

			ИначеЕсли НаНашСклад Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательКонтрагентСсылка", "Т.Организация КАК ПолучательКонтрагентСсылка");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентИНН", "Т.Организация.ИНН КАК ПолучательКонтрагентИНН");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентКПП", "Т.Организация.КПП КАК ПолучательКонтрагентКПП");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентНаименование", "Т.Организация.НаименованиеСокращенное КАК ПолучательКонтрагентНаименование");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ПолучательКонтрагентЮрФизЛицо",
				"ВЫБОР
				|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
				|		ТОГДА 1
				|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
				|		ТОГДА 2
				|	КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
				|		ТОГДА 3
				|	ИНАЧЕ 0
				|КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательАдресВладелец", "Т.Склад КАК ПолучательАдресВладелец");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресВладелецНаименование", "Т.Склад.Наименование КАК ПолучательАдресВладелецНаименование");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательКонтрагентЮридическийАдресВладелец", "Т.Организация КАК ПолучательКонтрагентЮридическийАдресВладелец");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация", "ИСТИНА КАК ПолучательКонтрагентЭтоОрганизация");
			КонецЕсли;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОрганизацияПолучатель", МетаданныеОбъекта) Тогда

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательКонтрагентСсылка",
			"ВЫБОР
			|	КОГДА Т.ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА Т.ОрганизацияПолучатель
			|	ИНАЧЕ Т.Организация
			|КОНЕЦ КАК ПолучательКонтрагентСсылка");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентИНН",
			"ВЫБОР
			|	КОГДА Т.ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА Т.ОрганизацияПолучатель.ИНН
			|	ИНАЧЕ Т.Организация.ИНН
			|КОНЕЦ КАК ПолучательКонтрагентИНН");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентКПП",
			"ВЫБОР
			|	КОГДА Т.ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА Т.ОрганизацияПолучатель.КПП
			|	ИНАЧЕ Т.Организация.КПП
			|КОНЕЦ КАК ПолучательКонтрагентКПП");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентНаименование",
			"ВЫБОР
			|	КОГДА Т.ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА Т.ОрганизацияПолучатель.НаименованиеСокращенное
			|	ИНАЧЕ Т.Организация.НаименованиеСокращенное
			|КОНЕЦ КАК ПолучательКонтрагентНаименование");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ПолучательКонтрагентЮрФизЛицо",
			"ВЫБОР
			|	КОГДА Т.ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА 
			|			ВЫБОР
			|				КОГДА Т.ОрганизацияПолучатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
			|					ТОГДА 1
			|				КОГДА Т.ОрганизацияПолучатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
			|					ТОГДА 2
			|				КОГДА Т.ОрганизацияПолучатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|					ТОГДА 3
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	ИНАЧЕ ВЫБОР
			|				КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
			|					ТОГДА 1
			|				КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
			|					ТОГДА 2
			|				КОГДА Т.Организация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
			|					ТОГДА 3
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательАдресВладелец", "Т.СкладПолучатель КАК ПолучательАдресВладелец");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресВладелецНаименование", "Т.СкладПолучатель.Наименование КАК ПолучательАдресВладелецНаименование");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательКонтрагентЮридическийАдресВладелец", "Т.СкладПолучатель КАК ПолучательКонтрагентЮридическийАдресВладелец");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ЛОЖЬ КАК ПолучательКонтрагентЭтоОрганизация", "ИСТИНА КАК ПолучательКонтрагентЭтоОрганизация");

		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеОбъекта) Тогда
			Если СНашегоСклада Тогда

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательКонтрагентСсылка", "Т.Контрагент КАК ПолучательКонтрагентСсылка");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентИНН", "Т.Контрагент.ИНН КАК ПолучательКонтрагентИНН");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентКПП", "Т.Контрагент.КПП КАК ПолучательКонтрагентКПП");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательКонтрагентНаименование",
				"ВЫБОР 
				|	КОГДА Т.Контрагент.НаименованиеПолное <> """" 
				|		ТОГДА Т.Контрагент.НаименованиеПолное 
				|	ИНАЧЕ Т.Контрагент.Наименование 
				|КОНЕЦ КАК ПолучательКонтрагентНаименование");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ПолучательКонтрагентЮрФизЛицо",
				"ВЫБОР
				|	КОГДА Т.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
				|		ТОГДА 1
				|	КОГДА Т.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
				|		ТОГДА 2
				|	КОГДА Т.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
				|		ТОГДА 3
				|	ИНАЧЕ 0
				|КОНЕЦ КАК ПолучательКонтрагентЮрФизЛицо");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательАдресВладелец", "Т.Партнер КАК ПолучательАдресВладелец");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательАдресВладелецНаименование", "Т.Партнер.Наименование КАК ПолучательАдресВладелецНаименование");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательКонтрагентЮридическийАдресВладелец", "Т.Контрагент КАК ПолучательКонтрагентЮридическийАдресВладелец");

			ИначеЕсли НаНашСклад Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительКонтрагентСсылка", "Т.Контрагент КАК ОтправительКонтрагентСсылка");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительКонтрагентИНН", "Т.Контрагент.ИНН КАК ОтправительКонтрагентИНН");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительКонтрагентКПП", "Т.Контрагент.КПП КАК ОтправительКонтрагентКПП");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительКонтрагентНаименование",
				"ВЫБОР 
				|	КОГДА Т.Контрагент.НаименованиеПолное <> """" 
				|		ТОГДА Т.Контрагент.НаименованиеПолное 
				|	ИНАЧЕ Т.Контрагент.Наименование 
				|КОНЕЦ КАК ОтправительКонтрагентНаименование");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ОтправительКонтрагентЮрФизЛицо",
				"ВЫБОР
				|	КОГДА Т.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
				|		ТОГДА 1
				|	КОГДА Т.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
				|		ТОГДА 2
				|	КОГДА Т.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель)
				|		ТОГДА 3
				|	ИНАЧЕ 0
				|КОНЕЦ КАК ОтправительКонтрагентЮрФизЛицо");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительАдресВладелец", "Т.Партнер КАК ОтправительАдресВладелец");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительАдресВладелецНаименование", "Т.Партнер.Наименование КАК ОтправительАдресВладелецНаименование");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительКонтрагентЮридическийАдресВладелец", "Т.Контрагент КАК ОтправительКонтрагентЮридическийАдресВладелец");
			КонецЕсли;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Менеджер", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Менеджер", "Т.Менеджер КАК Менеджер");
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Ответственный", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Менеджер", "Т.Ответственный КАК Менеджер");
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КонтактноеЛицо", МетаданныеОбъекта) Тогда
			Если СНашегоСклада Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПолучательКонтактноеЛицоСсылка",
				"Т.КонтактноеЛицо КАК ПолучательКонтактноеЛицоСсылка");
			ИначеЕсли НаНашСклад Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительКонтактноеЛицоСсылка",
				"Т.КонтактноеЛицо КАК ОтправительКонтактноеЛицоСсылка");
			КонецЕсли;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗаказПоставщику", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ОтправительКонтактноеЛицоСсылка",
			"Т.ЗаказПоставщику.КонтактноеЛицо КАК ОтправительКонтактноеЛицоСсылка");
		КонецЕсли;

		Если СНашегоСклада Тогда
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеОбъекта) Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладОтправитель",
				"Т.Склад КАК СкладОтправитель");
			ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеОбъекта) Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладОтправитель",
				"Т.СкладОтправитель КАК СкладОтправитель");
			КонецЕсли;
		КонецЕсли;

		Если НаНашСклад Тогда
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеОбъекта) Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладПолучатель",
				"Т.Склад КАК СкладПолучатель");
			ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеОбъекта) Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладПолучатель",
				"Т.СкладПолучатель КАК СкладПолучатель");
			КонецЕсли;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПеревозчикПартнер", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ГрузоперевозчикСсылка", "Т.ПеревозчикПартнер КАК ГрузоперевозчикСсылка");
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаОтгрузки", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки", "Т.ДатаОтгрузки КАК ДатаОтгрузки");
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаПоступления", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки", "Т.ДатаПоступления КАК ДатаДоставки");
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СпособДоставки", МетаданныеОбъекта) Тогда

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК СпособОтгрузки",
			"	ВЫБОР
			#Удаление
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
			#КонецУдаления
			#Вставка
	//++ РС Консалт: Минаков А.С. Задача 22756
			|		КОГДА Т.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.РСК_ПеревозчикДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.РСК_ПеревозчикДоПВЗ))
			#КонецВставки
			|			ТОГДА 2
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СпособОтгрузки");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК СпособДоставки",
			"	ВЫБОР
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
			|			ТОГДА 2
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СпособДоставки");

			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВремяДоставкиС", МетаданныеОбъекта) Тогда

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ВремяОтгрузкиС",
				"	ВЫБОР
				|		КОГДА Т.СпособДоставки = ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
				|			ТОГДА ШапкаДокумента.ВремяДоставкиС
				|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				|	КОНЕЦ КАК ВремяОтгрузкиС");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ВремяОтгрузкиДо",
				"	ВЫБОР
				|		КОГДА Т.СпособДоставки = ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
				|			ТОГДА ШапкаДокумента.ВремяДоставкиДо
				|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				|	КОНЕЦ КАК ВремяОтгрузкиДо");

			КонецЕсли;

			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВремяДоставкиПо", МетаданныеОбъекта) Тогда

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ВремяДоставкиС",
				"	ВЫБОР
				|		КОГДА Т.СпособДоставки = ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
				|			ТОГДА ШапкаДокумента.ВремяДоставкиС
				|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				|	КОНЕЦ КАК ВремяДоставкиС");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК ВремяДоставкиДо",
				"	ВЫБОР
				|		КОГДА Т.СпособДоставки = ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки)
				|			ИЛИ ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
				|			ТОГДА ШапкаДокумента.ВремяДоставкиДо
				|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				|	КОНЕЦ КАК ВремяДоставкиДо");

			КонецЕсли;

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительАдресПредставление",
			"	ВЫБОР
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
			|			ИЛИ Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
			|			ТОГДА Т.АдресДоставки
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ОтправительАдресПредставление");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительАдресЗначенияПолей",
			"	ВЫБОР
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
			|			ИЛИ Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
			|			ТОГДА Т.АдресДоставкиЗначенияПолей
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ОтправительАдресЗначенияПолей");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительАдресЗначение",
			"	ВЫБОР
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
			|			ИЛИ Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
			|			ТОГДА Т.АдресДоставкиЗначение
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ОтправительАдресЗначение");

			Если СНашегоСклада Тогда

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресПредставление",
				"Т.АдресДоставки КАК ПолучательАдресПредставление");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресЗначенияПолей",
				"Т.АдресДоставкиЗначенияПолей КАК ПолучательАдресЗначенияПолей");

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдресЗначение",
				"Т.АдресДоставкиЗначение КАК ПолучательАдресЗначение");

			КонецЕсли;

		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ВалютаСсылка", "Т.Валюта КАК ВалютаСсылка");
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) = КурсыВалюты.Валюта", "Т.Валюта = КурсыВалюты.Валюта");
		КонецЕсли;

		ДополнитьЗапросПоОснованиям(ТекстЗапросаПоШапке, ТекстЗапросаПоТипу, ПервыйЗапросПоШапке, ИмяТаблицыОбъекта);

		ИмяТаблицыЗапасов = "ВидыЗапасов";
		Если МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТаблицыЗапасов) = Неопределено Тогда
			ТекстЗапросаВидовЗапасов = ПустойШаблонЗапросаВидыЗапасов;
		Иначе
			ТекстЗапросаВидовЗапасов = "";
			ДополнитьЗапросПоОснованиям(
			ТекстЗапросаВидовЗапасов, ШаблонЗапросаВидыЗапасов, Истина, ИмяТаблицыОбъекта + "." + ИмяТаблицыЗапасов);
		КонецЕсли;

		СписокТабличныхЧастейТовары = Новый Массив();
		СписокТабличныхЧастейТовары.Добавить("Товары");
		СписокТабличныхЧастейТовары.Добавить("ЗаменяющиеТовары");

		Для Каждого ИмяТаблицыТЧ Из СписокТабличныхЧастейТовары Цикл

			ТекстЗапросаПоТипу = ШаблонЗапросаТовары;

			Если МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТаблицыТЧ) <> Неопределено Тогда

				МетаданныеОбъектаТЧ = МетаданныеОбъекта.ТабличныеЧасти[ИмяТаблицыТЧ]; // Структура
				ИмяТаблицыТЧОбъекта = ИмяТаблицыОбъекта + "." + МетаданныеОбъектаТЧ.Имя;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Номенклатура", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Номенклатура", "Т.Номенклатура КАК Номенклатура");
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаАртикул", "Т.Номенклатура.Код");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Упаковка", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"NULL КАК Упаковка", "Т.Упаковка КАК Упаковка");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КоличествоУпаковок", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"0 КАК Количество", "Т.КоличествоУпаковок КАК Количество");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Цена", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"0 КАК Цена", "Т.Цена КАК Цена");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Сумма", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"0 КАК СуммаВсего", "Т.Сумма КАК Сумма");
				Иначе
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"0 КАК СуммаВсего", "0 КАК Сумма");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаНДС", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"0 КАК СуммаНДС", "Т.СуммаНДС КАК СуммаНДС");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаСНДС", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"0 КАК СуммаСНДС", "Т.СуммаСНДС КАК СуммаСНДС");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СтавкаНДС", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"&ПодстановкаСтавкаНДС", "Т.СтавкаНДС.ПеречислениеСтавкаНДС");
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"&ПодстановкаПредставлениеСтавкаНДС", "Т.СтавкаНДС.Наименование");
				КонецЕсли;

				Если Параметры.ТипГрузоперевозки = СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СКурьер() Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"&ПодстановкаЭтоУслуга", "Т.Номенклатура.ВидНоменклатуры.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))");
				Иначе
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"&ПодстановкаТипНоменклатуры",
					"НЕ СправочникНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))");
				КонецЕсли;

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Отменено", МетаданныеОбъектаТЧ) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу,
					"&ПодстановкаОтменено",
					"НЕ Т.Отменено");
				КонецЕсли;

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаАртикул", """""");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаЭтоУслуга", "ЛОЖЬ");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаСтавкаНДС", "NULL");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаПредставлениеСтавкаНДС", """""");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаТипНоменклатуры", "ИСТИНА");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "&ПодстановкаОтменено", "ИСТИНА");

				ДополнитьЗапросПоОснованиям(ТекстЗапросаПоТоварам, ТекстЗапросаПоТипу, ПервыйЗапросПоТоварам, ИмяТаблицыТЧОбъекта);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	ТекстЗапроса = ТекстЗапросаПоШапке + ОбщегоНазначения.РазделительПакетаЗапросов() 
	+ "ВЫБРАТЬ
	|	ШапкаДокумента.ДокументОснование КАК ДокументОснование,
	|	ШапкаДокумента.ОрганизацияБизнесСетиСсылка КАК ОрганизацияБизнесСетиСсылка,
	|	ШапкаДокумента.ФормаОплаты КАК ФормаОплаты,
	|	ШапкаДокумента.ГрузоперевозчикСсылка КАК ГрузоперевозчикСсылка,
	|	ШапкаДокумента.ГрузоперевозчикИдентификатор КАК ГрузоперевозчикИдентификатор,
	|	ШапкаДокумента.ГрузоперевозчикНаименование КАК ГрузоперевозчикНаименование,
	|	ШапкаДокумента.ГрузоперевозчикТелефон КАК ГрузоперевозчикТелефон,
	|	ШапкаДокумента.ГрузоперевозчикИНН КАК ГрузоперевозчикИНН,
	|	ШапкаДокумента.ГрузоперевозчикКПП КАК ГрузоперевозчикКПП,
	|	ШапкаДокумента.ТарифНаименование КАК ТарифНаименование,
	|	ШапкаДокумента.ТарифИдентификатор КАК ТарифИдентификатор,
	|	ШапкаДокумента.ТарифНеГабарит КАК ТарифНеГабарит,
	|	ШапкаДокумента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ШапкаДокумента.ДатаДоставки КАК ДатаДоставки,
	|	ШапкаДокумента.ВремяОтгрузкиС КАК ВремяОтгрузкиС,
	|	ШапкаДокумента.ВремяОтгрузкиПо КАК ВремяОтгрузкиПо,
	|	ШапкаДокумента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ШапкаДокумента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ШапкаДокумента.СпособОтгрузки КАК СпособОтгрузки,
	|	ШапкаДокумента.СпособДоставки КАК СпособДоставки,
	|	ШапкаДокумента.ОтправительКонтрагентСсылка КАК ОтправительКонтрагентСсылка,
	|	ШапкаДокумента.ОтправительКонтрагентИНН КАК ОтправительКонтрагентИНН,
	|	ШапкаДокумента.ОтправительКонтрагентКПП КАК ОтправительКонтрагентКПП,
	|	ШапкаДокумента.ОтправительКонтрагентНаименование КАК ОтправительКонтрагентНаименование,
	|	ШапкаДокумента.ОтправительКонтрагентЮрФизЛицо КАК ОтправительКонтрагентЮрФизЛицо,
	|	ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация КАК ОтправительКонтрагентЭтоОрганизация,
	|	ШапкаДокумента.ОтправительКонтрагентЮридическийАдресВладелец КАК ОтправительКонтрагентЮридическийАдресВладелец,
	|	ШапкаДокумента.ОтправительАдресВладелец КАК ОтправительАдресВладелец,
	|	ШапкаДокумента.ОтправительАдресВладелецНаименование КАК ОтправительАдресВладелецНаименование,
	|	ШапкаДокумента.ОтправительАдресПредставление КАК ОтправительАдресПредставление,
	|	ШапкаДокумента.ОтправительАдресЗначенияПолей КАК ОтправительАдресЗначенияПолей,
	|	ВЫБОР КОГДА ШапкаДокумента.ОтправительАдресПредставление = """" ТОГДА """" ИНАЧЕ ШапкаДокумента.ОтправительАдресЗначение КОНЕЦ КАК ОтправительАдресЗначение,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация
	|			ТОГДА ВЫБОР
	|					КОГДА &СпособОпределенияКонтактногоЛица = 3
	|						ТОГДА ПользователиМенеджер.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 4
	|						ТОГДА СкладыОтправитель.ТекущийОтветственный
	|					КОГДА &СпособОпределенияКонтактногоЛица = 5
	|						ТОГДА ПользователиТекущий.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 1
	|						ТОГДА NULL
	|					КОГДА &СпособОпределенияКонтактногоЛица = 2
	|						ТОГДА &ОтветственныйСклада
	|					ИНАЧЕ ПользователиМенеджер.ФизическоеЛицо
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ОтправительКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаОтправитель.Ссылка, ШапкаДокумента.ОтправительКонтрагентСсылка)
	|				ИНАЧЕ ШапкаДокумента.ОтправительКонтактноеЛицоСсылка
	|			КОНЕЦ
	|	КОНЕЦ КАК ОтправительКонтактноеЛицоСсылка,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация
	|			ТОГДА ШапкаДокумента.ОтправительКонтактноеЛицоНаименование
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ОтправительКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаОтправитель.Наименование, ШапкаДокумента.ОтправительКонтрагентНаименование)
	|				ИНАЧЕ КонтактныеЛицаОтправитель.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ОтправительКонтактноеЛицоНаименование,
	|	ШапкаДокумента.ОтправительКонтактноеЛицоТелефонПредставление КАК ОтправительКонтактноеЛицоТелефонПредставление,
	|	ШапкаДокумента.ОтправительКонтактноеЛицоТелефонЗначение КАК ОтправительКонтактноеЛицоТелефонЗначение,
	|	ШапкаДокумента.ПолучательКонтрагентСсылка КАК ПолучательКонтрагентСсылка,
	|	ШапкаДокумента.ПолучательКонтрагентИНН КАК ПолучательКонтрагентИНН,
	|	ШапкаДокумента.ПолучательКонтрагентКПП КАК ПолучательКонтрагентКПП,
	|	ШапкаДокумента.ПолучательКонтрагентНаименование КАК ПолучательКонтрагентНаименование,
	|	ШапкаДокумента.ПолучательКонтрагентЮрФизЛицо КАК ПолучательКонтрагентЮрФизЛицо,
	|	ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация КАК ПолучательКонтрагентЭтоОрганизация,
	|	ШапкаДокумента.ПолучательКонтрагентЮридическийАдресВладелец КАК ПолучательКонтрагентЮридическийАдресВладелец,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательАдресВладелец = &РозничныйПокупатель
	|			ТОГДА ШапкаДокумента.ПолучательКонтрагентСсылка
	|		ИНАЧЕ ШапкаДокумента.ПолучательАдресВладелец
	|	КОНЕЦ КАК ПолучательАдресВладелец,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательАдресВладелец = &РозничныйПокупатель
	|			ТОГДА ШапкаДокумента.ПолучательКонтрагентНаименование
	|		ИНАЧЕ ШапкаДокумента.ПолучательАдресВладелецНаименование
	|	КОНЕЦ КАК ПолучательАдресВладелецНаименование,
	|	ШапкаДокумента.ПолучательАдресПредставление КАК ПолучательАдресПредставление,
	|	ШапкаДокумента.ПолучательАдресЗначенияПолей КАК ПолучательАдресЗначенияПолей,
	|	ВЫБОР КОГДА ШапкаДокумента.ПолучательАдресПредставление = """" ТОГДА """" ИНАЧЕ ШапкаДокумента.ПолучательАдресЗначение КОНЕЦ КАК ПолучательАдресЗначение,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация
	|			ТОГДА ВЫБОР
	|					КОГДА &СпособОпределенияКонтактногоЛица = 3
	|						ТОГДА ПользователиМенеджер.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 4
	|						ТОГДА СкладыПолучатель.ТекущийОтветственный
	|					КОГДА &СпособОпределенияКонтактногоЛица = 5
	|						ТОГДА ПользователиТекущий.ФизическоеЛицо
	|					КОГДА &СпособОпределенияКонтактногоЛица = 1
	|						ТОГДА NULL
	|					КОГДА &СпособОпределенияКонтактногоЛица = 2
	|						ТОГДА &ОтветственныйСклада
	|					ИНАЧЕ ПользователиМенеджер.ФизическоеЛицо
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ПолучательКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаПолучатель.Ссылка, ШапкаДокумента.ПолучательКонтрагентСсылка)
	|				ИНАЧЕ ШапкаДокумента.ПолучательКонтактноеЛицоСсылка
	|			КОНЕЦ
	|	КОНЕЦ КАК ПолучательКонтактноеЛицоСсылка,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация
	|			ТОГДА ШапкаДокумента.ПолучательКонтактноеЛицоНаименование
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ШапкаДокумента.ПолучательКонтрагентЮрФизЛицо = 2
	|					ТОГДА ЕСТЬNULL(КонтактныеЛицаПолучатель.Наименование, ШапкаДокумента.ПолучательКонтрагентНаименование)
	|				ИНАЧЕ КонтактныеЛицаПолучатель.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК ПолучательКонтактноеЛицоНаименование,
	|	ШапкаДокумента.ПолучательКонтактноеЛицоТелефонПредставление КАК ПолучательКонтактноеЛицоТелефонПредставление,
	|	ШапкаДокумента.ПолучательКонтактноеЛицоТелефонЗначение КАК ПолучательКонтактноеЛицоТелефонЗначение,
	|	ШапкаДокумента.ПлательщикКонтрагентСсылка КАК ПлательщикКонтрагентСсылка,
	|	ШапкаДокумента.ПлательщикКонтрагентИНН КАК ПлательщикКонтрагентИНН,
	|	ШапкаДокумента.ПлательщикКонтрагентКПП КАК ПлательщикКонтрагентКПП,
	|	ШапкаДокумента.ПлательщикКонтрагентНаименование КАК ПлательщикКонтрагентНаименование,
	|	ШапкаДокумента.ПлательщикКонтрагентЮрФизЛицо КАК ПлательщикКонтрагентЮрФизЛицо,
	|	ШапкаДокумента.ПлательщикКонтрагентЭтоОрганизация КАК ПлательщикКонтрагентЭтоОрганизация,
	|	ШапкаДокумента.ПлательщикКонтрагентЮридическийАдресВладелец КАК ПлательщикКонтрагентЮридическийАдресВладелец,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоСсылка КАК ПлательщикКонтактноеЛицоСсылка,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоНаименование КАК ПлательщикКонтактноеЛицоНаименование,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоТелефонПредставление КАК ПлательщикКонтактноеЛицоТелефонПредставление,
	|	ШапкаДокумента.ПлательщикКонтактноеЛицоТелефонЗначение КАК ПлательщикКонтактноеЛицоТелефонЗначение,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.ОтправительКонтрагентЭтоОрганизация
	|			ТОГДА 1
	|		КОГДА ШапкаДокумента.ПолучательКонтрагентЭтоОрганизация
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПлательщикРоль,
	|	ШапкаДокумента.ВалютаКоэффициент КАК ВалютаКоэффициент
	|ИЗ
	|	ДанныеОснований КАК ШапкаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаОтправитель
	|		ПО ШапкаДокумента.ОтправительКонтактноеЛицоСсылка = КонтактныеЛицаОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПолучатель
	|		ПО ШапкаДокумента.ПолучательКонтактноеЛицоСсылка = КонтактныеЛицаПолучатель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыОтправитель
	|		ПО ШапкаДокумента.СкладОтправитель = СкладыОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыПолучатель
	|		ПО ШапкаДокумента.СкладПолучатель = СкладыПолучатель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиМенеджер
	|		ПО ШапкаДокумента.Менеджер = ПользователиМенеджер.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиТекущий
	|		ПО (&ТекущийПользователь = ПользователиТекущий.Ссылка)";

	Если ТекстЗапросаПоТоварам <> "" Тогда 
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаВидовЗапасов
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаПоТоварам
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		+ "ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Упаковка КАК Упаковка,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Артикул КАК Артикул,
		|	ТаблицаТовары.ЭтоУслуга КАК ЭтоУслуга,
		|	ТаблицаТовары.ИННВладельцаГруза КАК ИННВладельцаГруза,
		|	ТаблицаТовары.Сумма * ШапкаДокумента.ВалютаКоэффициент КАК Сумма,
		|	ТаблицаТовары.Цена * ШапкаДокумента.ВалютаКоэффициент КАК Цена,
		|	ТаблицаТовары.СуммаСНДС * ШапкаДокумента.ВалютаКоэффициент КАК СуммаСНДС,
		|	ТаблицаТовары.СуммаНДС * ШапкаДокумента.ВалютаКоэффициент КАК СуммаНДС,
		|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТовары.СтавкаНДСПредставление КАК СтавкаНДСПредставление
		|ПОМЕСТИТЬ ВременнаяТаблицаТовары
		|ИЗ
		|	ДанныеОснований КАК ШапкаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеОснованийТовары КАК ТаблицаТовары
		|		ПО (ТаблицаТовары.Ссылка = ШапкаДокумента.ДокументОснование)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.СтавкаНДСПредставление КАК СтавкаНДСПредставление,
		|	Товары.Артикул КАК Артикул,
		|	Товары.ЭтоУслуга КАК ЭтоУслуга,
		|	Товары.ИННВладельцаГруза КАК ИННВладельцаГруза,
		|	СправочникНоменклатура.Наименование КАК Наименование,
		|	УпаковкиЕдиницыИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	Товары.Количество КАК Количество,
		|	Товары.Цена КАК Цена,
		|	Товары.СуммаСНДС КАК Сумма,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	Товары.Упаковка КАК Упаковка,
		|	&ТекстЗапросаВесУпаковки КАК Вес,
		|	&ТекстЗапросаОбъемУпаковки КАК Объем,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
		|				И ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.Знаменатель, 0) <> 0
		|			ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Высота, 0) * (ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.Числитель, 0) / ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ВысотаЕдиницаИзмерения.Знаменатель, 1)) КАК ЧИСЛО(15, 7))) * 100
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Высота,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
		|				И ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Знаменатель, 0) <> 0
		|			ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ширина, 0) * (ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Числитель, 0) / ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Знаменатель, 1)) КАК ЧИСЛО(15, 7))) * 100
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Ширина,
		|	ВЫБОР
		|		КОГДА &ТекстЗапросаДлинаУпаковки <> 0
		|			ТОГДА &ТекстЗапросаДлинаУпаковки
		|		КОГДА УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
		|				И ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ШиринаЕдиницаИзмерения.Знаменатель, 0) <> 0
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Глубина, 0) * (ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.Числитель, 0) / ЕСТЬNULL(УпаковкиЕдиницыИзмерения.ГлубинаЕдиницаИзмерения.Знаменатель, 1)) КАК ЧИСЛО(15, 7))
		|		ИНАЧЕ 0
		|	КОНЕЦ * 100 КАК Длина,
		|	ВЫБОР
		|		КОГДА СправочникВидыНоменклатуры.ИспользоватьИндивидуальноеНаименованиеПриПечати
		|			ТОГДА ЕСТЬNULL(СправочникВидыНоменклатуры.НаименованиеДляПечати, """")
		|		КОГДА &НаименованиеДляПечатиВидовНоменклатуры <> """"
		|			ТОГДА &НаименованиеДляПечатиВидовНоменклатуры
		|		ИНАЧЕ СправочникВидыНоменклатуры.Наименование
		|	КОНЕЦ КАК НаименованиеДляПечати
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	ВременнаяТаблицаТовары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СправочникВидыНоменклатуры
		|		ПО (СправочникНоменклатура.ВидНоменклатуры = СправочникВидыНоменклатуры.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (ВЫБОР
		|				КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|					ТОГДА СправочникНоменклатура.ЕдиницаИзмерения = УпаковкиЕдиницыИзмерения.Ссылка
		|				ИНАЧЕ Товары.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Товары.Количество * Товары.Вес), 0) КАК Вес,
		|	ЕСТЬNULL(СУММА(Товары.Количество * Товары.Объем), 0) КАК Объем,
		|	ЕСТЬNULL(МАКСИМУМ(Товары.Высота), 0) КАК МаксимальнаяВысота,
		|	ЕСТЬNULL(МАКСИМУМ(Товары.Длина), 0) КАК МаксимальнаяДлина,
		|	ЕСТЬNULL(МАКСИМУМ(Товары.Ширина), 0) КАК МаксимальнаяШирина,
		|	ЕСТЬNULL(МАКСИМУМ(Товары.Вес), 0) КАК МаксимальныйВес,
		|	ЕСТЬNULL(СУММА(Товары.Сумма), 0) КАК ПолнаяСтоимость,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|			КОГДА Товары.ЭтоУслуга
		|				ТОГДА 0
		|			ИНАЧЕ Товары.Сумма
		|		КОНЕЦ), 0) КАК Стоимость
		|ИЗ
		|	Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НаименованиеДляПечати КАК ТоварНаименование
		|ИЗ
		|	Товары КАК Товары
		|ГДЕ
		|	НЕ Товары.ЭтоУслуга
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.НаименованиеДляПечати";

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("УпаковкиЕдиницыИзмерения", "СправочникНоменклатура", Ложь));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("УпаковкиЕдиницыИзмерения", "СправочникНоменклатура", Ложь));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаДлинаУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаДлинаУпаковки("УпаковкиЕдиницыИзмерения", "СправочникНоменклатура", Ложь));

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Основания", Основания);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("РозничныйПокупатель", Справочники.Партнеры.РозничныйПокупатель);

	ДанныеПоУмолчанию = СервисДоставки.ПараметрыПоУмолчанию(Параметры.ТипГрузоперевозки);

	Запрос.УстановитьПараметр("СпособОпределенияКонтактногоЛица", ДанныеПоУмолчанию.СпособОпределенияКонтактногоЛица);
	Запрос.УстановитьПараметр("ОтветственныйСклада", ДанныеПоУмолчанию.КонтактноеЛицо);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

	УстановитьПривилегированныйРежим(Истина);
	Запрос.УстановитьПараметр("НаименованиеДляПечатиВидовНоменклатуры", Константы.НаименованиеДляПечатиВидовНоменклатуры.Получить());
	Результаты = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);

	РезультатПоШапке = Результаты[1];
	Если РезультатПоШапке.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ТаблицаПоДокументу = РезультатПоШапке.Выгрузить();
	ДанныеПоДокументу = ТаблицаПоДокументу[0];

	СервисДоставкиКлиентСервер.ЗаполнитьСтруктуруПоЛинейнымДанным(Параметры, ДанныеПоДокументу, ТаблицаПоДокументу.Колонки);

	Параметры.Вставить("ОрганизацияБизнесСетиСсылка", ДанныеПоДокументу.ОрганизацияБизнесСетиСсылка);

	// Заполним грузоперевозчика
	Если ЗначениеЗаполнено(Параметры.Грузоперевозчик.Ссылка) Тогда
		ГрузоперевозчикКонтрагент = ПартнерыИКонтрагенты.ПолучитьКонтрагентаПартнераПоУмолчанию(Параметры.Грузоперевозчик.Ссылка);
		Если ЗначениеЗаполнено(ГрузоперевозчикКонтрагент) Тогда
			ГрузоперевозчикПараметры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГрузоперевозчикКонтрагент, "ИНН,КПП,НаименованиеПолное,Наименование");
			ГрузоперевозчикПараметры.Наименование = 
			?(ЗначениеЗаполнено(ГрузоперевозчикПараметры.НаименованиеПолное),
			ГрузоперевозчикПараметры.НаименованиеПолное,
			ГрузоперевозчикПараметры.Наименование);

			ЗаполнитьЗначенияСвойств(Параметры.Грузоперевозчик, ГрузоперевозчикПараметры);
		КонецЕсли;

	КонецЕсли;

	// Заполним значения адресов
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Отправитель.Адрес);
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Получатель.Адрес);
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Отправитель.Контрагент.ЮридическийАдрес);
	СервисДоставки.ЗаполнитьАдресПоПараметрам(Параметры.Получатель.Контрагент.ЮридическийАдрес);

	//Заполним телефоны контактных лиц
	СервисДоставки.ЗаполнитьПараметрыКонтактногоЛица(Параметры.Отправитель.КонтактноеЛицо);

	СервисДоставки.ЗаполнитьПараметрыКонтактногоЛица(Параметры.Получатель.КонтактноеЛицо);

	РезультатИтогиПоТаблицеТовары = Результаты[6];
	РезультатНаименованийДляПечати = Результаты[7];

	// Заполним параметры грузовых мест

	Если Не РезультатИтогиПоТаблицеТовары.Пустой() Тогда
		ВыборкаПоТоварам = РезультатИтогиПоТаблицеТовары.Выбрать();
		Если ВыборкаПоТоварам.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Параметры.Груз, ВыборкаПоТоварам);
			Параметры.ПолнаяСтоимость = ВыборкаПоТоварам.ПолнаяСтоимость;
		КонецЕсли;
	КонецЕсли;

	Если Не РезультатНаименованийДляПечати.Пустой() Тогда
		ВыборкаПоТоварам = РезультатНаименованийДляПечати.Выбрать();
		Пока ВыборкаПоТоварам.Следующий() Цикл
			Если ЗначениеЗаполнено(СокрЛП(ВыборкаПоТоварам.ТоварНаименование)) Тогда
				Параметры.Груз.Содержимое = Параметры.Груз.Содержимое + ?(Параметры.Груз.Содержимое <> "", ", ", "") + ВыборкаПоТоварам.ТоварНаименование;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	РезультатПоТоварнымПозициям = Запрос.МенеджерВременныхТаблиц.Таблицы["Товары"].ПолучитьДанные();

	Если Не РезультатПоТоварнымПозициям.Пустой() Тогда

		ВыборкаПоПозиции = РезультатПоТоварнымПозициям.Выбрать();

		СоответствиеСтавокНДС = СоответствиеСтавокНДС();

		Пока ВыборкаПоПозиции.Следующий() Цикл

			НоваяСтрокаПозиции = Параметры.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПозиции, ВыборкаПоПозиции);

			НоваяСтрокаПозиции.СтавкаНДС = СоответствиеСтавокНДС.Получить(ВыборкаПоПозиции.СтавкаНДС);

			Если Параметры.ТипГрузоперевозки = СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СКурьер() Тогда

				Если ТипЗнч(ДанныеПоДокументу.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					НоваяСтрокаПозиции.ИННВладельцаГруза = ВыборкаПоПозиции.ИННВладельцаГруза;
				Иначе
					НоваяСтрокаПозиции.ИННВладельцаГруза = ДанныеПоДокументу.ОтправительКонтрагентИНН;
				КонецЕсли; 

				Если ВыборкаПоПозиции.ЭтоУслуга Тогда
					НоваяСтрокаПозиции.ТипНоменклатуры = 1; // услуга
				Иначе
					НоваяСтрокаПозиции.ТипНоменклатуры = 0; // товар
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДокументыОснованияСписок")
Процедура РСК_ЗаполнитьДокументыОснованияСписок(ОснованияСписок)

	Если ОснованияСписок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ШаблонЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|Т.Ссылка КАК Ссылка,
	|0 КАК СуммаДокумента,
	|NULL КАК СкладОтправитель,
	|NULL КАК СкладПолучатель,
	|NULL КАК ПартнерОтправитель,
	|NULL КАК ПартнерПолучатель,
	|NULL КАК Валюта,
	|NULL КАК Отправитель,
	|NULL КАК Получатель,
	|"""" КАК ОтправительАдрес,
	|"""" КАК ПолучательАдрес,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки,
	|ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки,
	|0 КАК СпособОтгрузки,
	|0 КАК СпособДоставки
	|ПОМЕСТИТЬ ДанныеОснований
	|ИЗ #ТаблицаДокумента КАК Т
	|
	|ГДЕ Т.Ссылка В (&Основания)";

	Основания = ОснованияСписок.ВыгрузитьКолонку("Ссылка");
	ОснованияПоТипам = РазложитьМассивСсылокПоТипам(Основания);
	ПервыйЗапрос = Истина;
	ТекстЗапроса = "";

	Для Каждого КлючИЗначение Из ОснованияПоТипам Цикл

		МетаданныеОбъекта = Метаданные.НайтиПоТипу(КлючИЗначение.Ключ);
		ИмяТаблицыОбъекта = МетаданныеОбъекта.ПолноеИмя();
		ИмяОбъекта = СтрРазделить(ИмяТаблицыОбъекта, ".")[1];

		ТекстЗапросаПоТипу = ШаблонЗапроса;
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СуммаДокумента", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК СуммаДокумента", "Т.СуммаДокумента КАК СуммаДокумента");
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Валюта", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Валюта", "Т.Валюта КАК Валюта");
		КонецЕсли;

		СНашегоСклада = ЭтоДокументОтгрузкиСНашегоСклада(ИмяОбъекта);
		НаНашСклад    = ЭтоДокументДоставкиНаНашСклад(ИмяОбъекта);

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеОбъекта) Тогда
			Если СНашегоСклада Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Отправитель", "Т.Организация КАК Отправитель");

				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеОбъекта) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладОтправитель", "Т.Склад КАК СкладОтправитель");
				ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеОбъекта) Тогда
					ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладОтправитель", "Т.СкладОтправитель КАК СкладОтправитель");
				КонецЕсли;

			ИначеЕсли НаНашСклад Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Получатель", "Т.Организация КАК Получатель");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладПолучатель", "Т.Склад КАК СкладПолучатель");
			КонецЕсли;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", МетаданныеОбъекта) Тогда
			Если СНашегоСклада Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Получатель", "Т.Контрагент КАК Получатель");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПартнерПолучатель", "Т.Партнер КАК ПартнерПолучатель");
			ИначеЕсли НаНашСклад Тогда
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Отправитель", "Т.Контрагент КАК Отправитель");
				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК ПартнерОтправитель", "Т.Партнер КАК ПартнерОтправитель");
			КонецЕсли;
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОрганизацияПолучатель", МетаданныеОбъекта) Тогда

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК Получатель",
			"ВЫБОР
			|	КОГДА Т.ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА Т.ОрганизацияПолучатель
			|	ИНАЧЕ Т.Организация
			|КОНЕЦ КАК Получатель");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "NULL КАК СкладПолучатель", "Т.СкладПолучатель КАК СкладПолучатель");

		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаОтгрузки", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтгрузки", "Т.ДатаОтгрузки КАК ДатаОтгрузки");
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаПоступления", МетаданныеОбъекта) Тогда
			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоставки", "Т.ДатаПоступления КАК ДатаДоставки");
		КонецЕсли;

		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СпособДоставки", МетаданныеОбъекта) Тогда

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК СпособОтгрузки",
			"	ВЫБОР
			#Удаление
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
			#КонецУдаления
			#Вставка
	//++ РС Консалт: Минаков А.С. Задача 22756
			|		КОГДА Т.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.РСК_ПеревозчикДоКлиента), ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.РСК_ПеревозчикДоПВЗ))
			#КонецВставки
			|			ТОГДА 2
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СпособОтгрузки");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, "0 КАК СпособДоставки",
			"	ВЫБОР
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада)
			|			ТОГДА 2
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СпособДоставки");

			ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ОтправительАдрес",
			"	ВЫБОР
			|		КОГДА Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
			|			ИЛИ Т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ОтОтправителяОпределяетСлужбаДоставки)
			|			ТОГДА Т.АдресДоставки
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ОтправительАдрес");


			Если СНашегоСклада Тогда

				ТекстЗапросаПоТипу = СтрЗаменить(ТекстЗапросаПоТипу, """"" КАК ПолучательАдрес",
				"Т.АдресДоставки КАК ПолучательАдрес");

			КонецЕсли;

		КонецЕсли;

		ДополнитьЗапросПоОснованиям(ТекстЗапроса, ТекстЗапросаПоТипу, ПервыйЗапрос, ИмяТаблицыОбъекта);

	КонецЦикла;

	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() 
	+ "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	Т.Валюта КАК Валюта,
	|	Т.Отправитель КАК Отправитель,
	|	Т.Получатель КАК Получатель,
	|	ВЫБОР
	|		КОГДА НЕ Т.СкладОтправитель ЕСТЬ NULL
	|			ТОГДА СкладыКонтактнаяИнформацияОтправитель.Представление
	|		КОГДА Т.ОтправительАдрес = """"
	|			ТОГДА ПартнерыКонтактнаяИнформацияОтправитель.Представление
	|		ИНАЧЕ Т.ОтправительАдрес
	|	КОНЕЦ КАК ОтправительАдрес,
	|	ВЫБОР
	|		КОГДА НЕ Т.СкладПолучатель ЕСТЬ NULL
	|			ТОГДА СкладыКонтактнаяИнформацияПолучатель.Представление
	|		КОГДА Т.ПолучательАдрес = """"
	|			ТОГДА ПартнерыКонтактнаяИнформацияПолучатель.Представление
	|		ИНАЧЕ Т.ПолучательАдрес
	|	КОНЕЦ КАК ПолучательАдрес,
	|	Т.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Т.ДатаДоставки КАК ДатаДоставки,
	|	Т.СпособОтгрузки КАК СпособОтгрузки,
	|	Т.СпособДоставки КАК СпособДоставки
	|ИЗ
	|	ДанныеОснований КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформацияОтправитель
	|		ПО Т.СкладОтправитель = СкладыКонтактнаяИнформацияОтправитель.Ссылка
	|			И (СкладыКонтактнаяИнформацияОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформацияПолучатель
	|		ПО Т.СкладПолучатель = СкладыКонтактнаяИнформацияПолучатель.Ссылка
	|			И (СкладыКонтактнаяИнформацияПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияОтправитель
	|		ПО Т.ПартнерОтправитель = ПартнерыКонтактнаяИнформацияОтправитель.Ссылка
	|			И (ПартнерыКонтактнаяИнформацияОтправитель.Вид = &АдресДоставки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформацияПолучатель
	|		ПО Т.ПартнерПолучатель = ПартнерыКонтактнаяИнформацияПолучатель.Ссылка
	|			И (ПартнерыКонтактнаяИнформацияПолучатель.Вид = &АдресДоставки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Основания", Основания);
	ВидКонтактнойИнформации = Неопределено;
	ПолучитьЗначениеВидаКонтактнойИнформацииДляАдресаДоставкиСкладаКонтрагента(ВидКонтактнойИнформации);
	Запрос.УстановитьПараметр("АдресДоставки", ВидКонтактнойИнформации);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	ОснованияСписок = РезультатЗапроса[1].Выгрузить();

КонецПроцедуры
