
&НаКлиенте
Процедура РСК_ВыбранныеЦеныПередНачаломДобавленияВместо(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//++ РС Консалт: Трофимов Евгений 15.02.2023 Задача 23088
	//e1cib/data/Документ.Задание?ref=abf6db76aafd7de84ef44e63a771c2e5
	Если ТипЗнч(Объект.Партнер) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Отказ = Истина;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Владелец", Объект.Партнер);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Отбор);
		
		ОткрытьФорму("Справочник.РСК_ВидыЦенФизЛиц.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		Возврат;
	КонецЕсли;		
	//-- КонецЗадачи 23088
	
	ПродолжитьВызов(Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры
