#Область Дауншифтинг
//++ РС Консалт: Трофимов Евгений 07.02.2023 Тикет 23694
//e1cib/data/Документ.Задание?ref=85df5f81b1cad03f41a905483c110911
//В релизе 8.3.18 и 8.3.21 это были предопределённые элементы
//В релизе 8.3.20 предопределённые элемены в расширении недопустимы!

Функция Выставка() Экспорт

	Возврат РегистрыСведений.реа_ПредопределенныеЗначения.Значение("ТипСоглашенияВыставка", ПустаяСсылка());

КонецФункции // Выставка()

Функция Стандартное() Экспорт

	Возврат РегистрыСведений.реа_ПредопределенныеЗначения.Значение("ТипСоглашенияСтандартное", ПустаяСсылка());

КонецФункции // Стандартное()

#КонецОбласти