
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	//++ РС Консалт: Минаков А.С. Задача 20226
	Элементы.Товары.Подвал = Истина;
	Элементы.ТоварыКоличествоУпаковок.ПутьКДаннымПодвала = "Объект.Товары.ИтогКоличествоУпаковок";
	//++ РС Консалт: Минаков А.С. Задача 20226
	
	//РСК+ Кикинева А.Г. задача 256971
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ЗаполнитьТоварПоОстаткамСклада");
	НоваяКоманда.Действие = "ЗаполнитьТоварПоОстаткамСклада";
	НоваяКоманда.Заголовок = "Заполнить по остаткам";
	//Создаем Кнопку
	НоваяКнопка = ЭтаФорма.Элементы.Добавить("КнопкаВГруппеТовары", Тип("КнопкаФормы"),ЭтаФорма.Элементы.ТоварыГруппаЗаполнить);
	НоваяКнопка.ИмяКоманды = "ЗаполнитьТоварПоОстаткамСклада";    
	//РСК- Кикинева А.Г. задача 256971   
	
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	НовыйЭлементГруппа = Элементы.Добавить("ГруппаВес", Тип("ГруппаФормы"), Элементы.ГруппаИтого);
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("РСК_Вес", Тип("ПолеФормы"), НовыйЭлементГруппа);	
	НовыйЭлемент.Заголовок = "Вес";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "РСК_Вес";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 12;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлементГруппа = Элементы.Вставить("ГруппаОбъем", Тип("ГруппаФормы"), Элементы.ГруппаИтого, НовыйЭлементГруппа);
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("РСК_Кубатура", Тип("ПолеФормы"), НовыйЭлементГруппа);	
	НовыйЭлемент.Заголовок = "Объем";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "РСК_Кубатура";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 12;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
	//--

КонецПроцедуры  

&НаСервере
Процедура РСК_РассчитатьВГХ() 
	
	ТаблицаТовары = Объект.Товары.Выгрузить(, "Номенклатура,Характеристика,Серия,КоличествоУпаковок,Упаковка"); 
	
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	Если ТаблицаТовары.Количество() Тогда
		ВГХПоказатели = РСК_ВызовСервера.РассчитатьВесогабаритныеХарактеристикиДокумента(ТаблицаТовары);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВГХПоказатели); 
	Иначе
		РСК_Вес      = "0";
		РСК_Кубатура = "0";
	КонецЕсли;
	//--
		
КонецПроцедуры

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура РСК_ПриЧтенииСозданииНаСервере()
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	РСК_РассчитатьВГХ();  
	//--
КонецПроцедуры

&НаКлиенте
Процедура РСК_ТоварыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	РСК_РассчитатьВГХ();   
	//--
КонецПроцедуры

&НаСервере
&После("ОбновитьЗависимыеРеквизитыФормыСерверПоЗаказу")
Процедура РСК_ОбновитьЗависимыеРеквизитыФормыСерверПоЗаказу()
	
	//++ РС Консалт: Минаков А.С. Задача 20226		
	Элементы.ТоварыНазначениеОтправителя.Доступность = Не Объект.ПеремещениеПоЗаказам
	//++ РС Консалт: Минаков А.С. Задача 20226
		
КонецПроцедуры

//РСК+ Кикинева А.Г. задача 256971 заполнение документа остатками по складу отправителю
&НаСервере
Функция ЗаполнитьТоварПоОстаткамСкладаСервер()
	
	Документ=РеквизитФормыВЗначение("Объект");  
	
	ЗапросТекст = "ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.Склад КАК Склад,
|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
|	ТоварыНаСкладахОстатки.Серия КАК Серия,
|	ВЫБОР
|		КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|				ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток)
|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
|	КОНЕЦ КАК Количество,
|	ВЫБОР
|		КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|				ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток)
|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
|	КОНЕЦ КАК КоличествоУпаковок,
|	ВЫБОР
|		КОГДА НЕ ТоварыНаСкладахОстатки.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
|			ТОГДА 14
|	КОНЕЦ КАК СтатусУказанияСерий
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, &Склад = Склад) КАК ТоварыКОтгрузкеОстатки
|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыКОтгрузкеОстатки.Характеристика
|			И ТоварыНаСкладахОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
|ГДЕ
|	ВЫБОР
|			КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|					ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|				ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток) > 0
|			ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
|		КОНЕЦ
|
|УПОРЯДОЧИТЬ ПО
|	ТоварыНаСкладахОстатки.Номенклатура.Наименование,
|	ТоварыНаСкладахОстатки.Характеристика.Наименование";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;                                   
	Запрос.УстановитьПараметр("Дата", Документ.Дата);
	Запрос.УстановитьПараметр("Склад", Документ.СкладОтправитель);   
	
	Документ.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецФункции

&НаКлиенте
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТоварПоОстаткамСкладаСервер();	
		ОбновитьФорму= Новый Структура;
		ЭтаФорма.Записать(ОбновитьФорму);
	КонецЕсли;	     
	
	КонецПроцедуры

 &НаКлиенте
 Процедура ЗаполнитьТоварПоОстаткамСклада(Команда)   
	 
	 Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект);
	 ТекстВопроса = "Табличная часть будет заполнена остатками на складе. Продолжить?";
	 ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	  
КонецПроцедуры

//РСК- Кикинева А.Г. задача 256971 заполнение документа остатками по складу отправителю
