
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	//++ РС Консалт: Минаков А.С. Задача 20226
	Элементы.Товары.Подвал = Истина;
	Элементы.ТоварыКоличествоУпаковок.ПутьКДаннымПодвала = "Объект.Товары.ИтогКоличествоУпаковок"
	//++ РС Консалт: Минаков А.С. Задача 20226
	
КонецПроцедуры

&НаСервере
&После("ОбновитьЗависимыеРеквизитыФормыСерверПоЗаказу")
Процедура РСК_ОбновитьЗависимыеРеквизитыФормыСерверПоЗаказу()
	
	//++ РС Консалт: Минаков А.С. Задача 20226		
	Элементы.ТоварыНазначениеОтправителя.Доступность = Не Объект.ПеремещениеПоЗаказам
	//++ РС Консалт: Минаков А.С. Задача 20226
		
КонецПроцедуры
