
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьЭтапыОплаты")
Процедура РСК_ЗаполнитьЭтапыОплаты()

	ПараметрыЗаполнения = ЭтапыОплатыСервер.ПараметрыЗаполненияЭтаповОплаты();
	ПараметрыЗаполнения.ЭтоРасчетыСКлиентами            = Ложь;
	ПараметрыЗаполнения.НакладнаяПоЗаказам              = НакладнаяПоЗаказам;
	ПараметрыЗаполнения.ПорядокРасчетов                 = ПорядокРасчетов;
	ПараметрыЗаполнения.ЭтоЗаказ                        = ЭтоЗаказ;
	ПараметрыЗаполнения.НетКонтроляПредоплаты           = НетКонтроляПредоплаты;
	ПараметрыЗаполнения.ДатаПереходаПраваСобственности  = ДатаПереходаПраваСобственности;

	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ЭтаФорма);
	ПараметрыЗаполнения.СуммаОплаты                     = СуммаОплатыПоДокументу;
	ПараметрыЗаполнения.СуммаЗалогаЗаТару               = СуммаЗалогаПоДокументу;

	Если НесколькоДатОтгрузки Тогда
		ПараметрыЗаполнения.ДатаОтгрузки = ТабличнаяЧасть.Выгрузить();
	КонецЕсли;
	#Вставка
	//++ РС Консалт: Трофимов Евгений 02.03.2023 Задача 23985
	//e1cib/data/Документ.Задание?ref=b37a5a78714d889647e1e0192b7e7134
	ПараметрыЗаполнения.ДатаРазмещения					= ДатаРазмещения;
	//Всегда нужно выгружать табличную часть так как могут быть разные даты прибытия в порт и/или даты окончания производства
	ПараметрыЗаполнения.ДатаОтгрузки = ТабличнаяЧасть.Выгрузить();
	//-- КонецЗадачи 23985	
	#КонецВставки

	ЭтапыОплатыСервер.ЗаполнитьЭтапыОплаты(ЭтапыГрафикаОплаты, ПараметрыЗаполнения);

	Если УпрощенныйРежим Тогда
		ПреобразоватьТаблицуЭтаповВДанныеУпрощенногоРежима(ЭтапыГрафикаОплаты.Выгрузить());
	КонецЕсли;

	ЗаполнитьДатыОтгрузки();

КонецПроцедуры

&НаКлиенте
Процедура РСК_ЭтапыГрафикаОплатыСдвигПриИзмененииВместо(Элемент)
	//++ РС Консалт: Трофимов Евгений 15.03.2023 Задача 23985
	//e1cib/data/Документ.Задание?ref=b37a5a78714d889647e1e0192b7e7134
	ТекущиеДанные = Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОсобыеВариантыОтсчета = Новый Массив;
	ОсобыеВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ДоДатыОкончанияПроизводства"));
	ОсобыеВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ДоДатыПрибытияВПорт"));
	ОсобыеВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ДоДатыРазмещения"));
	ОсобыеВариантыОтсчета.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыОкончанияПроизводства"));
	
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы.Объект, "ХозяйственнаяОперация")
		И (ВладелецФормы.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути")
		ИЛИ ВладелецФормы.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути"))
		И ОсобыеВариантыОтсчета.Найти(ТекущиеДанные.ВариантОтсчета) <> Неопределено Тогда
		
		СтрокаТабличнойЧасти = Неопределено;
		Если ЗначениеЗаполнено(ТекущиеДанные.Заказ) Тогда
			СтрокиЗаказа = ТабличнаяЧасть.НайтиСтроки(Новый Структура("Заказ", ТекущиеДанные.Заказ));
			Если СтрокиЗаказа.Количество() > 0 Тогда
				СтрокаТабличнойЧасти = СтрокиЗаказа[0];
			КонецЕсли;
		ИначеЕсли ТабличнаяЧасть.Количество() > 0 Тогда
			СтрокаТабличнойЧасти = ТабличнаяЧасть[0];
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти = Неопределено Тогда
			ПродолжитьВызов(Элемент);
			Возврат;
		КонецЕсли;
		
		ДатаЗаказа = СтрокаТабличнойЧасти.ДатаЗаказа;
		ДатаСогласования = СтрокаТабличнойЧасти.ДатаСогласования;
		Если ТекущиеДанные.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ДоДатыОкончанияПроизводства")
			ИЛИ ТекущиеДанные.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыОкончанияПроизводства") Тогда
			
			ДатаПереходаПраваСобственности = СтрокаТабличнойЧасти.ДатаОкончанияПроизводства;
			
		ИначеЕсли ТекущиеДанные.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ДоДатыПрибытияВПорт") Тогда
			ДатаПереходаПраваСобственности = СтрокаТабличнойЧасти.ДатаПрибытияВПорт;
		ИначеЕсли ТекущиеДанные.ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ДоДатыРазмещения") Тогда
			ДатаПереходаПраваСобственности = ДатаРазмещения;
		КонецЕсли;
		
		
		ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыСдвигВариантОтсчетаПриИзменении(
			Элементы.ЭтапыГрафикаОплаты.ТекущиеДанные,
			ДатаЗаказа,
			ДатаСогласования,
			ДатаОтгрузки,
			СрокПереходаПраваСобственности,
			ДатаПереходаПраваСобственности,
			Календарь);
		
		СортироватьЭтапыОплаты();
		
		
	Иначе
		ПродолжитьВызов(Элемент);
	КонецЕсли;
	//-- КонецЗадачи 23985	
КонецПроцедуры
