
&НаКлиенте
Процедура СтатьяЕРППриИзменении(Элемент)
	
	СтатьяЕРППриИзмененииНаСервере()	
	
КонецПроцедуры

&НаСервере
Процедура СтатьяЕРППриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Запись.ТипСтатьиБП) Тогда
		Если ТипЗнч(Запись.СтатьяЕРП) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда	
			Запись.ТипСтатьиБП = Перечисления.РСК_ТипыСтатейБП.Затрат
		ИначеЕсли ТипЗнч(Запись.СтатьяЕРП) = Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов") Тогда
			Запись.ТипСтатьиБП = Перечисления.РСК_ТипыСтатейБП.ПрочиеДоходыИРасходы
		ИначеЕсли ТипЗнч(Запись.СтатьяЕРП) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда 
			Запись.ТипСтатьиБП = Перечисления.РСК_ТипыСтатейБП.ДДС
		КонецЕсли
	КонецЕсли
	
КонецПроцедуры

