
&ИзменениеИКонтроль("ПараметрыОперацииФискализацииЧекаПоДокументу")
Процедура РСК_ПараметрыОперацииФискализацииЧекаПоДокументу(ПараметрыФискальногоЧека, ДокументСсылка, Организация, Кассир)

	//++ Локализация
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();

	ПараметрыФискальногоЧека.Вставить("ДокументОснование" , ДокументСсылка);

	ПараметрыФискальногоЧека.Вставить("СистемаНалогообложения", СистемаНалогообложенияПоДокументу(ДокументСсылка));	

	СведенияОЮрФизЛице = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ТекущаяДатаСеанса);
	ПараметрыФискальногоЧека.Вставить("Организация"       	, Организация);
	ПараметрыФискальногоЧека.Вставить("ОрганизацияНазвание"	, СведенияОЮрФизЛице.ПолноеНаименование);
	ПараметрыФискальногоЧека.Вставить("ОрганизацияИНН"		, СведенияОЮрФизЛице.ИНН);
	ПараметрыФискальногоЧека.Вставить("ОрганизацияКПП"		, СведенияОЮрФизЛице.КПП);
	ПараметрыФискальногоЧека.Вставить("АдресМагазина"		, СведенияОЮрФизЛице.ФактическийАдрес);
	ПараметрыФискальногоЧека.Вставить("НаименованиеМагазина", СведенияОЮрФизЛице.СокращенноеНаименование);

	Если Не ЗначениеЗаполнено(Кассир) Тогда
		Кассир = Пользователи.ТекущийПользователь();
	КонецЕсли;
	РеквизитыКассира = РозничныеПродажи.РеквизитыКассира(Кассир, Организация, ТекущаяДатаСеанса);
	Если ЗначениеЗаполнено(РеквизитыКассира.Должность) Тогда
		ПараметрыФискальногоЧека.Вставить("Кассир", РеквизитыКассира.Наименование + " - " + РеквизитыКассира.Должность);
	Иначе  
		#Удаление
		ПараметрыФискальногоЧека.Вставить("Кассир", РеквизитыКассира.Наименование);  
		#КонецУдаления  
		#Вставка
		ПараметрыФискальногоЧека.Вставить("Кассир",  ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(РеквизитыКассира.Наименование));  
		#КонецВставки
	КонецЕсли;
	ПараметрыФискальногоЧека.Вставить("КассирИНН", РеквизитыКассира.ИНН);

	ПараметрыФискальногоЧека.Вставить("НомерКассы"			, "00001");
	ПараметрыФискальногоЧека.Вставить("НомерЧека"			, 1);
	ПараметрыФискальногоЧека.Вставить("НомерСмены"			, 1);
	ПараметрыФискальногоЧека.Вставить("ДатаВремя"			, ТекущаяДатаСеанса);
	ПараметрыФискальногоЧека.Вставить("КопийЧека"			, 1);
	//-- Локализация

КонецПроцедуры
