
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 10.11.2022 Задача 21774
	//e1cib/data/Документ.Задание?ref=965d336b23679ef348b8eb7aa54d9bdf
	Параметры.Свойство("Акты", Акты);
	//-- КонецЗадачи 21774
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 10.11.2022 Задача 21774
	//e1cib/data/Документ.Задание?ref=965d336b23679ef348b8eb7aa54d9bdf
	ФормаОтправитель = ЭтаФорма.ВладелецФормы;
	Парам = Новый Структура;
	Парам.Вставить("Ключ", ВыбраннаяСтрока);
	ФормаПолучатель = ПолучитьФорму("Документ.ЗаданиеНаПеревозку.ФормаОбъекта",Парам,ЭтаФорма.ВладелецФормы);
	ФормаПолучатель.ДобавитьМассивПорученийЭкспедитору(Акты.ВыгрузитьЗначения(), Неопределено);
	ФормаОтправитель.ПослеВопросаОбУдаленииПоручений(КодВозвратаДиалога.Да, Неопределено);
	ФормаПолучатель.Открыть();
	Закрыть();
	//-- КонецЗадачи 21774
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюЗагрузочнуюВедомость(Команда)
	//++ РС Консалт: Трофимов Евгений 10.11.2022 Задача 21774
	//e1cib/data/Документ.Задание?ref=965d336b23679ef348b8eb7aa54d9bdf
	ФормаОтправитель = ЭтаФорма.ВладелецФормы;
	ФормаПолучатель = ПолучитьФорму("Документ.ЗаданиеНаПеревозку.ФормаОбъекта",,ЭтаФорма.ВладелецФормы);
	ДанныеФормы = ФормаПолучатель.Объект;
	СоздатьНовуюЗагрузочнуюВедомостьНаСервере(ДанныеФормы, ФормаОтправитель.Объект.Ссылка);
	КопироватьДанныеФормы(ДанныеФормы, ФормаПолучатель.Объект);
	ФормаПолучатель.ДобавитьМассивПорученийЭкспедитору(Акты.ВыгрузитьЗначения(), Неопределено);
	ФормаОтправитель.ПослеВопросаОбУдаленииПоручений(КодВозвратаДиалога.Да, Неопределено);
	ФормаПолучатель.Открыть();
	Закрыть();
	//-- КонецЗадачи 21774
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьНовуюЗагрузочнуюВедомостьНаСервере(ДанныеФормы, ДокументИсточник)
	//++ РС Консалт: Трофимов Евгений 10.11.2022 Задача 21774
	//e1cib/data/Документ.Задание?ref=965d336b23679ef348b8eb7aa54d9bdf
	о = ДокументИсточник.Скопировать();
	о.Маршрут.Очистить();
	о.Распоряжения.Очистить();
	ЗначениеВДанныеФормы(о, ДанныеФормы);
	//-- КонецЗадачи 21774
КонецПроцедуры // СоздатьНовуюЗагрузочнуюВедомостьНаСервере()

