
&НаСервере
&После("ПриСозданииНаСервере")
Процедура РСК_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступноИзменениеСтатуса 	= Пользователи.РолиДоступны("РСК_УтверждениеИРедактированиеТабеляУчетаРабочегоВремени",Пользователи.ТекущийПользователь());
	Элементы.Статус.Доступность = ДоступноИзменениеСтатуса; 
	Если НЕ ДоступноИзменениеСтатуса И Объект.Статус = Перечисления.СтатусыТабеляУчетаРабочегоВремени.Утвержден Тогда
		ЭтотОбъект.ТолькоПросмотр 			= Истина;
		Элементы.ШапкаЛевая.ТолькоПросмотр 	= Истина;
		Элементы.ШапкаПравая.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
