
&ИзменениеИКонтроль("ПривестиДанныеКТребуемомуФормату")
Процедура РСК_ПривестиДанныеКТребуемомуФормату(ОсновныеПараметры, Отказ, ОписаниеОшибки, ИсправленыОсновныеПараметры)

	ИндивидуальныйРежимПодготовкиДанныхКПередачеВОФД = Ложь;
	Если ОсновныеПараметры.Свойство("ИндивидуальныйРежимПодготовкиДанныхКПередачеВОФД", ИндивидуальныйРежимПодготовкиДанныхКПередачеВОФД) 
		И ИндивидуальныйРежимПодготовкиДанныхКПередачеВОФД = Истина Тогда
		Возврат;
	КонецЕсли;

	СпособФорматноЛогическогоКонтроля = Неопределено;

	Если ОсновныеПараметры.Свойство("СпособФорматноЛогическогоКонтроля", СпособФорматноЛогическогоКонтроля) Тогда
		Если НЕ (СпособФорматноЛогическогоКонтроля = ПредопределенноеЗначение("Перечисление.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки")
			ИЛИ СпособФорматноЛогическогоКонтроля = ПредопределенноеЗначение("Перечисление.СпособыФорматноЛогическогоКонтроля.ЗачитыватьСуммы")) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;

	СуммаЧастныхОплат = 0;
	НужноПриводитьСуммы = Ложь;
	СуммаПередачиБезОплаты = 0;
	ОбщаяСуммаЧека = 0;
	СуммаПолнойОплаты = 0;
	Для Каждого ПозицияЧека Из ОсновныеПараметры.ПозицииЧека Цикл
		Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
			БезПередачиТовара = Ложь;
			НужнаПроверкаСтавокНДС = Ложь;
			Если ПозицияЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная") Тогда
				СуммаЧастныхОплат = СуммаЧастныхОплат + ПозицияЧека.Сумма;
				БезПередачиТовара          = Истина;
				НужнаПроверкаСтавокНДС     = Истина;
				НужноПриводитьСуммы        = Истина;
			ИначеЕсли ПозицияЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ОплатаКредита") Тогда
				СуммаЧастныхОплат = СуммаЧастныхОплат + ПозицияЧека.Сумма;
				БезПередачиТовара          = Истина;
				НужноПриводитьСуммы        = Истина;    
				#Удаление
				Если ПозицияЧека.Свойство("СтавкаНДС") Тогда
					ПозицияЧека.СтавкаНДС = Неопределено;
				КонецЕсли;
				Если ПозицияЧека.Свойство("СуммаНДС") Тогда
					ПозицияЧека.СуммаНДС = 0;
				КонецЕсли;   
				#КонецУдаления
			ИначеЕсли ПозицияЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.Аванс")
				ИЛИ ПозицияЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная") Тогда
				БезПередачиТовара = Истина;
				НужнаПроверкаСтавокНДС = Истина;
				СуммаПолнойОплаты = СуммаПолнойОплаты + ПозицияЧека.Сумма;
			ИначеЕсли ПозицияЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты") Тогда
				СуммаПередачиБезОплаты = СуммаПередачиБезОплаты + ПозицияЧека.Сумма;
			ИначеЕсли ПозицияЧека.ПризнакСпособаРасчета = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой") Тогда
				СуммаПолнойОплаты = СуммаПолнойОплаты + ПозицияЧека.Сумма;
			КонецЕсли;

			Если БезПередачиТовара Тогда
				Если ПозицияЧека.Свойство("ЕдиницаИзмерения") Тогда
					ПозицияЧека.ЕдиницаИзмерения = "Платеж";
				КонецЕсли;
				Если ПозицияЧека.Свойство("Количество") Тогда
					ПозицияЧека.Количество = 1;
				КонецЕсли;
				Если ПозицияЧека.Свойство("Цена") Тогда
					ПозицияЧека.Цена = ПозицияЧека.Сумма;
				КонецЕсли;
				Если ПозицияЧека.Свойство("ЦенаСоСкидками") Тогда
					ПозицияЧека.ЦенаСоСкидками = ПозицияЧека.Сумма;
				КонецЕсли;
				Если ПозицияЧека.Свойство("СуммаСкидок") Тогда
					ПозицияЧека.СуммаСкидок = 0;
				КонецЕсли;
				ПозицияЧека.Вставить("ПризнакПредметаРасчета", ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПлатежВыплата"));
				ИсправленыОсновныеПараметры = Истина;
			КонецЕсли;

			Если НужнаПроверкаСтавокНДС Тогда
				Если ПозицияЧека.Свойство("СтавкаНДС") Тогда
					Если ПозицияЧека.СтавкаНДС = 18 ИЛИ ПозицияЧека.СтавкаНДС = 10 ИЛИ ПозицияЧека.СтавкаНДС = 20 Тогда
						ПозицияЧека.СтавкаНДС = 100 + ПозицияЧека.СтавкаНДС;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			ОбщаяСуммаЧека = ОбщаяСуммаЧека + ПозицияЧека.Сумма;
		КонецЕсли;
	КонецЦикла;

	Если НужноПриводитьСуммы Тогда
		ПривестиСуммыПозицийЧекаКСуммеТаблицыОплат(ОсновныеПараметры, ОбщаяСуммаЧека, СуммаПолнойОплаты, СуммаПередачиБезОплаты, Отказ, ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры
