
&ИзменениеИКонтроль("ПересчитатьСуммуСУчетомАвтоматическойСкидкиВСтрокеТЧ")
Процедура РСК_ПересчитатьСуммуСУчетомАвтоматическойСкидкиВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	СтруктураПараметровДействия = Неопределено;

	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомАвтоматическойСкидки", СтруктураПараметровДействия) Тогда

		Очищать = Неопределено;
		СтруктураПараметровДействия.Свойство("Очищать", Очищать);

		Если Очищать Тогда

			ТекущаяСтрока.СуммаАвтоматическойСкидки = 0;
			ТекущаяСтрока.ПроцентАвтоматическойСкидки = 0;

		КонецЕсли;

		Скидка = ТекущаяСтрока.СуммаАвтоматическойСкидки;
		
		#Удаление
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Сумма - Скидка;
		#КонецУдаления
		#Вставка 
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество  - Скидка;
		#КонецВставки

	КонецЕсли;

КонецПроцедуры

