//++Конарев Контроль отправки заявок по маршруту согласования сверхлимита

// Проверяет необходимость отправки заявки по маршруту сверхлимита
//
// Параметры:
//  СтатьиДДС   -  массив статей документа.
// 
// Возвращаемое значение:
//  Булево - Результат
//
Функция ОтправлятьНаСверхЛимит(СтатьиДДС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатьиДДС",СтатьиДДС);
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.РСК_ИсключитьСогласованиеСверхлимита = ЛОЖЬ
	|	И СтатьиДвиженияДенежныхСредств.Ссылка В (&СтатьиДДС)";

	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции 

//--