
&НаСервере
Процедура РСК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
		
	//++Конарев 01.02.2023 отрисовка нового реквизита ТЧ
	РеквизитСделка     		   = Элементы.Вставить("Сделка",Тип("ПолеФормы"),Элементы.Расходы,Элементы.РасходыПодразделение);
	РеквизитСделка.Вид 		   = ВидПоляФормы.ПолеВвода;
	РеквизитСделка.ПутьКДанным = "Объект.Расходы.Сделка";
	РеквизитСделка.Заголовок   = "Сделка";
	
	СтатьяРасходовУслугиСоиполнителей = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("121008");
	
КонецПроцедуры

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура РСК_УстановитьУсловноеОформление()
	НастройтьВидимостьКолонкиСделка();
КонецПроцедуры 

&НаСервере
Процедура НастройтьВидимостьКолонкиСделка()
	
	Статьи = ОбщегоНазначения.ВыгрузитьКолонку(Объект.Расходы,"СтатьяРасходов",Истина);	
	Элементы.Сделка.Видимость = Статьи.Найти(СтатьяРасходовУслугиСоиполнителей) <> Неопределено; 
	
КонецПроцедуры

&НаКлиенте
Процедура РСК_ПодобратьУслугиСоисполнителейПосле(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Соисполнитель", Объект.Партнер);
	ОповещенииОбОкончанииПодбора = Новый ОписаниеОповещения("ОбработатьРезультатПодбораУслугСоисполнителя", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.РСК_ФормаПодбораСтрок",ПараметрыПодбора,ЭтотОбъект,,,,ОповещенииОбОкончанииПодбора);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьРезультатПодбораУслугСоисполнителя(РезультатПодбора, ДополнительныеПараметры) Экспорт
	Если РезультатПодбора <> Неопределено Тогда
		ДобавитьОтобранныеСтроки(РезультатПодбора);	
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ДобавитьОтобранныеСтроки(РезультатПодбора);
	
	ВыбранныеСтроки = ПолучитьИзВременногоХранилища(РезультатПодбора.АдресСтрокВоВременномХранилище);
	Для Каждого ПодобраннаяСтрока Из ВыбранныеСтроки Цикл
		НоваяСтрока = Объект.Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ПодобраннаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РСК_РасходыСтатьяРасходовПриИзмененииПосле(Элемент)
	НастройтьВидимостьКолонкиСделка();
КонецПроцедуры
